[
   "1C-Битрикс vs UMI.CMS или расово верный холивар популярных коробочных CMS",
   "В топике пойдет речь о том, какая из систем (1C: Битрикс или UMI.CMS) лучше для создания Интернет-магазина на основе коробки с демоконтентом. \r\nЕсть системы, есть задача, есть испытуемые и есть числовые критерии. Есть сводная таблица и комментарии тех, кто сравнивал.\r\nНет подыгрывания участникам, подтасовки фактов и прочей джинсы. \n\r\nЭксперимент был проведен в рамках преподавания мной курса веб-технологий в ВолгГТУ. Для выполнения работы использовался выделенный сервер компании, в которой я работаю, помимо государственного ВУЗа. \r\nДля особо въедливых товарищей оговорюсь, что компания является Золотым партнером Битрикса и имеет много баллов от Юми. \r\nПредставители каждой из систем, с которыми я знаком (Котырев, Рыжиков, Сидоренко, Солончук) узнают о подробностях и результатах исследования из этого топика. Исследованиями я не торгую, мне за отрасль поболеть интересно.\r\nПеред тем, как минуснуть топик за то, что он про коробочные системы, которые вы, может быть, не любите, прочитайте его. Или просто проходите мимо.\r\nТут не агитация, тут анализ.\n\r\nИтак, задача-системы-критерии-испытуемые-результат.\n\nЗадача\r\nВ рамках лабораторной работы по юзабилити и хостингу я дал студентам ссылки на дистрибутивы систем, хостинг, минимальные инструкции. Они должны были поставить демо или триальные версии Интернет-магазина, поработать в них как администраторы сайта, оценить удобство, составить отчет.\r\nИсследуемые параметры-критерии: функционал демо-решений, удобство, качество, понятность с точки зрения нескольких ролей: админа, который ставит сайт, пользователя-покупателя, контент-менеджера и администратора панели управления.\r\nНЕ оценивалось качество систем как платформ для разработки, прямо не оценивалось качество кода (хотя по числу проблем при установке и стабильности оно косвенно видно).\r\nНЕ оценивался процесс натягивания своего дизайна. Только то, что сказано.\n\nЦель работы\r\nПознакомиться с понятием хостинга, установкой CMS-системы на хостинг, провести сравнительный анализ систем 1C-Битрикс и UMI.CMS, сделать выводы\n\nХод работы\r\n0. Получаем доступ.\r\nКаждому студенту выделено 2 домена третьего уровня на домене ***\r\nнапример sb12.***.ru для Битрикса и su12.***.ru для UMI\n\r\nу каждого есть 2 БД для установки систем. имя пользователя совпадает с именем БД\n\r\nдоступ к phpmyadmin ***.ru/myadmin\n\r\nв папке каждого домена лежит файл-заглушка index.html\r\nего можно и нужно удалить, он будет мешать работе.\n\r\nна хостинге можно делать все что угодно, кроме закачки скриптов, не предусмотренных в лабораторной работе\n\r\nСделать отчет.\r\nВ отчет обязательно включить пароли к системам.\n\r\nОценка студента зависит не от его симпатий к той или иной системе. Можете поставить хоть все -2 (очень плохо) в столбики, если сможете это аргументировать. Буду снижать оценку за халтуру и поверхностный подход. Главное — анализ и аргументация. \n\r\nпримеры установленных систем — полный адрес скрыт, студентам были предоставлены работающие версии обеих систем, которые я поставил:\r\nsu12.***.ru/ s12_umi TRnvFHm2\r\nsb12.***.ru/ s12_bitrix fKlGrbSb\n\nСистемы\r\nКак уже стало понятно, это доступные для скачки тестовые версии конкурирующих систем с демоконтентом. Согласно принципу fair play, все участники в равных условиях, никого не о чем не предупреждали, сервер был одинаково готов к приему обеих систем.\n\nBITRIX — 1c-bitrix.ru\nwww.1c-bitrix.ru/download/cms.php#tab-bitrixsetup-link\r\nДанные установки.\r\nбизнес-демоверсия\r\nРешение для установки — Интернет-магазин (эксперимент проводился уже при Эрмитаже) \n\nUMI-CMS.ru\nwww.umi-cms.ru/downloads/test_umicms/umicms_commerce_trial\r\nполучаем на свое имя триальный ключ UMI\r\nПри установке — Триальный ключ\r\nШаблон\r\nНовая версия интернет-магазина на xslt-шаблонизаторе \n\nКритерии\r\nКаждый студент составлял отчет такой структуры и выводил среднее значение оценки каждой системы по каждому показателю.\r\nЧисловые показатели оценивались от -2 до 2 по так называемой «шкале ожиданий».\r\n-2 — существенно хуже ожиданий, очень плохо\r\n-1 — хуже ожиданий, плохо\r\n0 — работа не выполнена по техническим причинам или не начиналась\r\n1 — соответствует ожиданиям, хорошо\r\n2 — существенно лучше ожиданий, очень хорошо\r\nКаждая оценка должна быть аргументирована минимум 1 фразой\n\n1. Удобство и понятность сайта поставщика системы\r\n1.1. Простота нахождения нужных данных на сайте\r\n1.2. Качество текстов, понятность документации (если вы ей пользовались)\r\n1.3. Общее впечатление — свободный комментарий не менее чем из 5 предложений по этапу 1\n\n2. Установка\r\n2.1. Простота начала установки \r\n2.2. Работа инсталлятора\r\n2.2.1. Функциональность инсталлятора\r\n2.2.2. Простота инсталлятора\r\n2.3. Общее впечатление — свободный комментарий не менее чем из 5 предложений по этапу 2\n\n3. Функциональность и качество демонстрационного решения с точки зрения пользователя\r\n3.1. Качество дизайна\r\n3.2. Качество демонстрационного наполнения\r\n3.3. Структура и навигация \r\n3.4. Функциональность \n\n4. Удобство и функциональность системы с точки зрения контент-менеджера сайта\r\nОцениваем удобство выполнения типовых задач.\r\nСнабжаем выполнение КАЖДОЙ задачи 1 скриншотом\r\n4.1. Смена заголовка браузера для главной страницы\r\n4.2. Смена названия магазина (выводится в шапке на главной странице)\r\n4.3. Изменение текста на главной странице на свой\r\n4.4. Редактирование товара\r\n4.5. Редактирование группы товаров (переименование) \r\n4.6. Добавление группы товаров «Компьютерная техника»\r\n4.7. Добавление 3 подгрупп товаров (конкретные подгруппы выбрать самостоятельно)\r\n4.8. Добавление 3 товаров в каждую группу (конкретные товары выбрать самостоятельно)\r\n4.9. Полное удаление одного товара (не того, что добавлен самостоятельно)\r\n4.10. Полное удаление одной группы товаров (не той, что добавлена нами)\n\n5. Удобство и функциональность панели администратора сайта (/bitrix для 1С-Битрикс и /admin для UMI.CMS)\r\n5.1. Функциональность. \r\n5.1.1. Составить карту панели администрирования системы\r\n5.1.2. Выбрать 3 различных раздела 2-го уровня панели администрирования системы и описать их функционал, удобство (повторений среди студентов быть не должно). \n\r\nПример Раздела 2-го уровня для Битрикса (Раздел Контент не выбирать)\r\nНастройки — Производительность\r\nСервисы — Опросы\n\r\nПример Раздела 2-го уровня для UMI (Раздел Структура не выбирать)\r\nКонфигурация \\ Языки\r\nОбмен данными \\ Экспорт данных\n\r\n5.1.3. Оценить функциональность панели администрирования по шкале ожиданий от -2 до 2 с аргументами\n\r\n5.2. Удобство \r\nОценить удобство панели администрирования в целом по шкале ожиданий от -2 до 2 с аргументами\n\n6. Выводы\r\n6.1. Составить сводную таблицу оценки каждой системы по каждому параметру, вывести среднюю оценку каждой системы по каждому параметру\r\n6.2. Написать выводы по работе каждой системы. Указать что больше всего понравилось и не понравилось, что больше всего удивило в каждой системе.\r\nУказать с какой системой вы бы хотели работать при наличии выбора.\n\nИспытуемые\r\nЭто 11 студентов 5 курса факультета электроники и выч.техники, нормальные вполне. С вебом некоторые были знакомы, но ни с одной из систем ранее не сталкивались.\n\r\nСтранно, что некоторые не сразу справились с установкой систем на сервер. Честное слово, я тут ни при чем, сам перед тем, как выдать задание, каждую систему поставил под студенческими правами и работу проделал.\n\nРезультат\r\nЗадание было выдано 11 человекам. 3 забили, остальные сделали. Кто-то быстро и сразу, кто-то как будто через кусты ежевики тюль тащил – но отчеты я получил.\r\n8 отчетов. Привожу баллы, поставленные системам и комментарии.\r\nПредставителям каждой из систем, если они заинтересуются, вышлю архив с отчетами. Там есть комментарии по каждой возникшей проблеме и мотивация оценок.\n\r\nДолго ломал голову как показать статистику чтобы все было понятно. Представляю свои потуги по созданию наглядной диаграммы.\r\nВ строках – показатели. Каждый оценивался по шкале от -2 до 2 каждым студентом для каждой системы. Показатель описывает одно потребительское свойство исследуемой системы. Для простоты все показатели считаются равновесными.\n\r\nЕсть 2 группы столбцов: Юми и Битрикс соответственно. Внутри каждой группы столбцов оценки, выставленные каждым из 8 студентов. Кое-где есть нули (такую оценку поставил студент), кое-где пропуски (задание было понято студентами неодинаково).\n\r\nДля анализа вычислено среднее по каждому показателю для каждой системы, среднее по студенту и среднее по системе вообще. \r\nПобедители по каждой номинации выделены полужирным, оценки для наглядности раскрашены в красно-зеленой гамме.\r\nРезультаты налицо.\n\n\r\nКак мне кажется, вполне видны достоинства и недостатки систем, проявившиеся в данных условиях.\n\nВыдержки от отчетов студентов (аргументация, выводы)\nОтчет 1\r\nBitrix\r\nКачественный продукт от профессионалов. Первое знакомство с ним оставило\r\nприятное впечатление. Если в системе и есть какие-то недостатки, то на них можно закрыть\r\nглаза, глядя на предоставляемый функционал и мощь.\r\nПонравилось:\r\n• простота режима правки;\r\n• документация;\r\n• демонстрационный набор товаров;\r\n• функционал;\r\n• дизайн;\r\nНе понравилось:\r\n• общая «сложность» административной панели (документация помогает, но теряется\r\nвремя);\r\n• неочевиден способ задания шаблона данных для товара;\n\r\nUMI.CMS\r\nПерспективная CMS, но на фоне Bitrix мало впечатляет.\r\nПонравилось:\r\n• достаточно простое создание шаблонов данных;\r\n• дизайн;\r\n• функционал;\r\nНе понравилось:\r\n• демонстрационный набор товаров;\r\n• режим правки (F2);\r\n• перегруженность интерфейса административной части;\r\nВыбор\r\nЕсли бы мне пришлось разрабатывать интернет-магазина, то я бы выбрал Bitrix, пусть\r\nк решаемой задаче будет применено и 5% процентов от возможностей Bitrix, но опыт работы\r\nс такой системой весьма ценен.\n\nОтчет 2\r\nПри установке UMI сразу же произвела приятное впечатление, к тому времени как доставился Битрикс, я успел там уже поковыряться с внешним видом, попробовать добавление/удаление товаров и новостей.\r\nС Битриксом были трудности лишь при установке и иногда при поиске нужных пунктов в админке, но в целом система сложностей не вызвала.\r\nИногда напрягали таймаут-ошибки 504, но это видимо вина хостинга.\r\nВ Битриксе удивила только орфографическая ошибка в слове Зарегистрированные.\r\nПри наличии выбора согласился бы работать с обоими системами.\n\nОтчет 3\r\nBitrix\r\nПри работе с данной CMS понравилось, что править при редактирование страницы можно добавлять любые компоненты сайта. Понравилось удобство и функциональность интерфейса административной панели. Очень быстро можно построить на основе Bitrix целый информационный портал. Так же радует хорошее информационное обеспечение, как для разработчиков, так и для пользователей на сайте поддержки Bitrix (присутствие видео и текстовых курсов, разделенных по модулям и с хорошими примерами). \r\nUMI.CMS\r\nПри работе с данной CMS понравилось возможность редактирование страницы «на лету», это возможность позволяет увидеть, как будет выглядеть страница после редактирования, прям во время редактирования. Есть приятная возможность добавление заметок на страницу. Огорчило отсутствие дополнительного функционала в панели администрирования, так же огорчает отсутствие древовидной структуры в панели администрирования. \r\nМой выбор\r\nЕсли бы у меня была задача разработать интернет-магазин, то я бы выбрал Bitrix как платформу, по той причине что в нем есть все что могло бы удовлетворить заказчика, и писать свой код мало когда понадобится. Подводя итоги скажу что Bitrix стоит тех денег которые за него просят.\n\nОтчет 4\r\n1С-Битрикс.\r\nУдобная система, предоставляющая огромное количество возможностей по управлению сайтом. Однако работа с ней затрудняется тем, что она, мягко говоря, тормозит в режиме редактирования (в отличие от той же UMI.CMS). Зато панель администрирования здесь шикарна и подходит тем, кто любит работать с древовидной структурой меню.\n\nUMI.CMS.\r\nВ режиме редактирования система работает быстро, чем облегчает жизнь администратору. А вот сама панель администрирования беднее возможностями, чем в 1С-Битрикс. Еще страшно усложняет жизнь местный файловый менеджер, например, при добавлении фотографий товара (а это одна из важных и часто повторяемых операций).\n\r\nТрудно сказать, с какой системой я бы работала при наличии выбора: они все-таки хороши каждая по-своему. Но учитывая, какой сюрприз подготовила мне UMI.CMS при установке, я бы остановилась на 1С-Битрикс (так надежнее).\n\nОтчет 5\r\nBitrix:\r\nСистема хорошая. Имеет богатый функционал. Но толи интернет у меня тупил, толи Хостинг был такой. Работать с сайтом было очень тяжело.(Может не разобрался что можно настроить). Очень долгие отклики. Частые обрывы связи(504 ошибка). Долго ключается режим редактирования страницы. Включение этого режима красивое но крайне не удобное. В режиме редактирования можно спокойно перемещаться по всему сайту\r\nUMI-cms:\r\nИнтересная система. Редактирования с помощью кнопки F2 очень удобно в отличие от битрикса. Работало пошустрее(хотя может это от погоды). Но в режиме редактирования очень неудобно ходить по сайту. Потому что нельзя нажать на ссылки. Не отображаются подраздел в подразделах, хотя создать можно.\n\r\nМежду данными CMS я не могу сказать какую бы я точно выбрал. Все зависит от задачи. Если нужно сделать сайт визитку, то я бы предпочел UMI. В случае если делать более серьезный проект то я бы предпочел Битрикс. В нем много хороших, полезных и главное качественных модулей, но и ресурсы хостовой машины ему нужно больше(ну мне так показалось)\n\nОтчет 6\r\nBitrix:\r\nМне понравилось работать с этой системой. Удобная структура, позволяющая быстро найти нужную информацию. Не понравилось, что как-то странно добавляются новые товары, т.к. нельзя сразу выбрать тип добавляемой информации. Понравилась админская часть системы, хорошо структурирована. Много контента в демонстрационной версии. Легко устанавливается.\n\r\nUMI-cms:\r\nНе плохая система. Больше всего понравилось легкое однокнопочное редактирование страницы. Админская панель удобно вынесена в правый-верхний угол и имеет закладочную структуру. Недостатки, поставилась со второго раза и криво, нет контента в примере, добавление новых товаров не понятно как устроено, подменю не заработало, навигация по админской панели тоже не заработало. \n\r\nПри наличии выбора выбрал бы Bitrix\n\nОтчет 7\r\nBitrix\r\nПонравилась возможность правки структуры страницы прямо «на лету» безо всяких унылых текстовых полей, в которые система вываливает противный код страницы. Понравилось наличие компонентности страницы, т.е. даже форма и та является компонентом, который обладает определёнными параметрами и может быть вставлен на несколько страниц, но при том будет иметь разные состояния на этих страницах. Понравилось удобство и функциональность, очень редко можно встретить продукт с таким дружелюбным интерфейсом административной панели. Используя только один раздел «Контент», можно построить на основе Bitrix целый информационный портал всего за день – главное разбираться в огромных возможностях Bitrix. Ещё приятно удивила документация и обучающие курсы для разработчиков и пользователей. Единственное что не понравилось (скорее это каприз) так это ресурсоемкость движка Bitrix.\r\nUMI.CMS\r\nДо установки данной CMS я был более лучшего мнения о ней. Пускай данная система с фронтэнда выглядит очень удобно, то со стороны бэкэнда – это просто ужас. Всё туже простоту разработчики решили занести и в административную панель, не задумавшись об удобстве. В принципе работать с CMS можно, но только со стороны фронтэнда. В самой CMS есть потенциал, но его очень трудно раскрыть средствами, предоставляемыми администратору сайта. Удивило в системе возможность редактирования «на лету», которая может обскакать и Bitrix.\r\nМой выбор\r\nЕсли бы меня спросили, на чём бы я предпочел разрабатывать сайт, то я бы без промедления сказал бы, что на Bitrix. Данная система хорошо себя зарекомендовала при выполнении данной работы. Я буду продолжать изучать её и делать попытки реализовывать не ней свои проекты.\n\nОтчет 8\r\nBitrix:\r\nМне понравилось работать с этой системой. Удобная структура, позволяющая быстро найти нужную информацию. Понравилась админская часть системы, хорошо структурирована. Произвёл большое впечатление способ установки CMS. Минусом системы является отсутствие бесплатных шаблонов дизайна.\r\nUMI-cms:\r\nСистема в целом не понравилась. Проблемы возникали в процессе и после установки. Не удалось установить систему должным образом ни на предоставленный хостинг, ни на локалхост: система устанавливалась без демо-контента.\n\r\nПредпочтение отдаю 1С-Битрикс.\n\nМои выводы\r\nЯ постарался организовать эксперимент таким образом, чтобы он в справедливых условиях показал работу и типичные проблемы каждой систем.\n\r\nЕсть еще 2 лабораторные работы у этих же студентов, где мы могли бы разобрать более сложные технологические операции, чем простая установка и управление готовой демосистемой, на этих или других системах, движках, фреймворках.\n\r\nЖду мнений, к толковым советам прислушаюсь.\n\nPS\r\nОсновное замечание по сути в том, что сравнены Битрикс и Юми, которые, мол, непоказательны и не покрывают рынок. С удовольствием проведу аналогичное мероприятие с участием TYPO3, DRUPAL, HostCMS, Zend Framefork, если буду понимать какую задачу им ставить? Системы разного калибра, степени абстракции, даже идеологии, они применяются часто на разных уровнях.\r\nЧто можно делать на этих системах, чтобы условия остались справедливыми?\r\nЕсть только 1 идея: дать сверстанный дизайн и предложить на нем сваять сайт с заданным примитивным функционалом. "
]