[
   "AMD исправила проблему зависания в системах с Ryzen из-за fTPM",
   "AMD спустя месяц исправила проблему зависания систем на Windows 10 и 11 с включенной функцией fTPM. Это программный модуль обеспечения доверенных вычислений на платформе AM4 с процессорами Ryzen. Компания выпустила обновление библиотек AGESA и дала советы по обходному пути решения проблемы.",
   "AMD выпустила исправление BIOS для производителей материнских плат. Однако для выхода обновлений на рынок потребуется некоторое время, и первое появится только в мае 2022 года. Тем временем AMD посоветовала применить «обходной путь», в котором используется дискретный ключ TPM вместо встроенной версии внутри процессора. Стоит отметить, что этот способ подходит не для всех систем, особенно для ноутбуков.",
   "Для использования функции доверенных вычислений fTPM процессор AMD вызывает из блока BIOS неизменяемый защищенный ключ. Как отметили в компании, в первой реализации прошивки для ряда конфигураций систем процессоры AMD Ryzen «могут периодически выполнять расширенные транзакции памяти, связанные с fTPM, во флеш-памяти SPI (SPIROM), расположенной на материнской плате, что может вести к временным паузам в интерактивности или отклике системы до завершения транзакции». Проблема затрагивает системы AM4, использующие архитектуры от Zen+ до Zen 3. Большинство пользователей просто отключили требование TPM в Windows 11, чтобы обойти эту проблему.",
   "Для решения недостатка компания AMD представила производителям материнских плат обновлённые библиотеки. ПО для материнских плат будет основано на пакете AMD AGESA 1207 или более новой версии.",
   "Чтобы решить проблему уже сейчас, необходимо приобрести дискретный модуль TPM 2.0 и перейти на его использование. Функция fTPM отключается в BIOS, а физический модуль TPM 2.0 перехватит управление на себя. Однако сам модуль недешевый (стоимость варьируется от $20 до $170), и не все материнские платы и ноутбуки имеют соответствующие разъемы и поддержку для их установки.",
   "Наконец, при переносе данных при переключении с функции fTPM на модуль TPM файлы могут оказаться испорченными. AMD рекомендует сделать резервную копию данных до переключения и совершать переход с отключенными механизмами шифрования. То же нужно будет сделать и при обновлении BIOS материнских плат.",
   "В июне Microsoft ввела в Windows 11 требование, которое не позволяет любой системе без технологии Trusted Platform Module (TPM) 2.0 устанавливать ОС. Windows 11 требует либо наличие физического ключа TPM, либо поддержку fTPM. Это требование вызвало стремительный рост продаж и резкое повышение цен на TPM 2.0."
]