[
   "Citymobil Data Meetup №3",
   "Ситимобил каждый месяц проводит митапы о применении Data science в городских и геосервисах, логистике и технологиях умных городов.На митапе мы рассмотрим разные особенности применения современных технологий в геосервисах. Поговорим и о классическом data science в задачах прогнозирования времени прибытия, о проектирование data warehouse (DWH), чтобы можно было эффективно применять методы машинного обучения и строить дэшборды. А также продолжим говорить о Switchback-экспериментах (у нас уже был доклад об этом не первом митапе), которые часто просто незаменимы в геосервисах. В этот раз в гости к Ситимобил придут коллеги из Самоката.Ждём вас 28 октября в 18:00.  РегистрацияМероприятие пройдет в онлайне. Сначала будут доклады, а затем каждый из нас сможет поучаствовать в дискуссии со спикерами. Так что советуем запастись интересными вопросами) 18:00 – 18:10    Вступительное словоАлексей ЧернобрововКонсультант по Data Science 18:10 – 18:40  «Эпизод 2: Атака тестов на свичбэк»Ксения Мензорова Data Science в Surge PricingСитимобилВ Ситимобил проходят десятки разных экспериментов. Компания активно применяет switchback для сложных экспериментов в динамическом ценообразовании. На одном из предыдущих митапов мы уже подробно рассказывали, что это такое и с чем это едят.Новый доклад поможет понять, какими статистическими методами можно проверить switchback-тест. А ещё он подскажет, как, с одной стороны, правильно выбрать подход, позволяющий бизнесу быстро принимать решения, а с другой – соблюдать некоторую математическую строгость.18:40 – 19:10    «Сказ про то как мы в Ситимобил DWH строим»Екатерина КолпаковаРуководитель DWHСитимобилКогда создаешь классные сервисы с применением машинного обучения, нельзя обойтись без продуманного построения хранилища данных. Сегодня в Ситимобил применяются 100500 баз данных для решения самых разнообразных задач.Мы подробно расскажем о подходе к построению подобных сложных систем, совмещении Data Vault и Data Lake, а также рассмотрим, как же в компании устроены потоки данных.19:10 – 19:40 «Прогнозирование времени доставки заказа»Николай РядчиковSenior ML SpecialistСамокатНа митапе я расскажу:Два разных прогноза: до оформления заказа и после;Необходимость детальной структуры местности для точного прогноза;Временные факторы прогноза;Очередность заказа в порядке выполнения курьером как важнейший фактор прогноза;Неизбежность продуктовых решений;Методология проведения экспериментов для проверки качества прогноза.19:40 – 20:10    Дискуссия со спикерамиРЕГИСТРАЦИЯ "
]