[
   "Citymobil Data Meetup №7",
   "Ситимобил продолжает серию митапов о применении Data Science и современных технологиях анализа данных для гео-сервисов.Задачи, которые решает Ситимобил, крайне многогранны. Наша главная цель –  качественный сервис для клиентов  и водителей. Мы постоянно работаем над улучшением пользовательского опыта. В рамках митапа обсудим, как с помощью технологий помочь водителям получать заказы по пути домой, чтобы было как можно меньше холостого хода. К сожалению, не все водители добросовестно пользуются нашим сервисом – некоторые из них совершают мошеннические действия, ухудшающие сервис для  клиентов. О том, как с этим можно бороться, мы тоже поговорим в рамках митапа.Ждём вас 28 февраля в 19:00. Мероприятие пройдет в онлайне. Сначала будут доклады, а затем каждый из нас сможет поучаствовать в диалоге со спикерами. Так что советуем запастись интересными вопросами! :) РЕГИСТРАЦИЯ19:00 – 19:10    Вступительное словоАлексей ЧернобрововHead of Data Science | Ситимобил  19:10 – 19:40   «Сбор и валидация субъективных данных на примере заказов по пути домой»Ольга ЦветковаАналитик данных | СитимобилРасскажу об инструментах, с помощью которых можно собирать субъективные данные и о том, как избавляться от человеческого фактора в полученной выборке с помощью semi-supervised learning. Затем покажу результаты на реальном кейсе.19:40 – 20:10     «Антифрод на рынке такси. Определение мошеннических действий через анализ связности графа поездок»Даниил КазанцевСпециалист по машинному обучению и анализу данных | СитимобилКак мошенники могут заработать на рынке такси?Что такое фрод в такси и как его найти?Как в Ситимобил создаются модели, определяющие мошеннические действия, и правила, сокращающие нам объем фрода?Как определять качество таких моделей и делать масштабируемые решения?Обо всем этом расскажу в своем докладе. Рассмотрим полный путь создания конкретного правила, использующего алгоритмы кластеризации на графах. Кроме того, я также расскажу про некоторые модификации метрик из теории графов для оценки «фродности» конкретного кластера. Покажу красивые картинки и продемонстрирую, как академические знания из университета помогают бороться с мошенниками в бизнесе.20:10 – 20:30     Дискуссия со спикерамиРЕГИСТРАЦИЯ "
]