[
   "Citymobil Data Meetup №4",
   "Ситимобил каждый месяц проводит митапы о применении Data science в городских и геосервисах, логистике и технологиях умных городов.Задачи, которые связаны с городской мобильностью, чрезвычайно сложны и разнообразны. Давайте представим: нам нужно вызвать такси до Красной площади. Но с какой стороны оптимально сделать точку остановки? Со стороны Варварки? А, может, лучше возле Охотного Ряда? В таких случаях нужно уметь переводить неформальный запрос от клиента в оптимальный маршрут. Для этого необходимы специальные поисковые подсказки: они помогут пассажиру оказаться в нужном месте, даже если он не знает точный адрес.Важная часть агрегаторов такси — водители, для которых тоже нужно создавать удобный сервис и работать над улучшением метрик для них с помощью грамотно выстроенной иерархии этих метрик.И, конечно, невозможно представить современные гео-сервисы без системы качественной системы маршрутизации доставки: для этого нужно уметь обрабатывать нетривиальные случаи, например, ситуации с несуществующими адресами. Обо всём этом мы обязательно поговорим на митапе.В гости к Ситимобил придут эксперты из Wheely и Почтатех, чтобы поделиться своим опытом решения подобных задач.Ждём вас 23 ноября в 18:30.  РЕГИСТРАЦИЯ. Участие бесплатноеМероприятие пройдет в онлайне. Сначала будут доклады, а затем каждый из нас сможет поучаствовать в дискуссии со спикерами. Так что советуем запастись интересными вопросами) 18:30 – 18:40    Вступительное словоЧернобрововHead of Data Science Ситимобил18:40 – 19:10  «Поисковые подсказки в Ситимобил: от эвристики до машинного обучения»Михаил Дьячков Data Science Team LeadСитимобилВы открываете приложение Ситимобил, чтобы заказать такси в то место, которое часто посещаете. Сегодня, вероятно, вы ожидаете, что все, что нужно сделать — нажать на кнопку «Заказать такси», и автомобиль уже подан и готов мчать в нужную точку. А куда бы вы хотели поехать и в какое время — все это приложение Ситимобил пытается предсказать благодаря истории ваших заказов и машинному обучению.Меня зовут Михаил Дьячков, и я расскажу вам о том, как работает алгоритм формирования поисковых подсказок конечных пунктов назначения в приложении Ситимобил. Вы узнаете, как на первый взгляд довольно простая задача превратилась в интересный сценарий: от эвристики до алгоритма машинного обучения и последующей выкатки его в эксплуатацию. С его помощью, мы надеемся, у нас получилось облегчить жизнь наших пользователей.19:10 – 19:40    «Системный подход к разработке целевых метрик улучшения качества шоферской базы»Алексей ВенжегаHead of AnalyticsWheelyРасскажу, как мы в Wheely подходили к созданию метрик для оценки привлечения и адаптации шоферов в нашем сервисе. Испытывают ли шоферы момент осознания ключевых ценностей партнерства с Wheely и становится работа в Wheely для них основной занятостью? Как сформулировали эти метрики в Netflix и Pinterest?Поговорим о нашем подходе к сегментации пользователей, с какими проблемами столкнулись и как обошли их.  И расскажу, как нам удалось связать эти метрики в одну гладкую систему «круговорота шоферов в Wheely» и объединить все вовлеченные команды единой терминологией и пониманием целей.19:40 – 20:10 «Как мы разбираемся с адресными данными, которым больше 100 лет?»Алексей КудиновProduct ManagerПочтатехКурьерская доставка в последнее время стала неотъемлемым атрибутом электронной коммерции, и Почта активно развивает это направление. Для более эффективного и точного планирования ежедневных развозок мы начали использовать внешние сервисы маршрутизации.В своём докладе я хочу рассказать о тех сложностях, с которыми мы столкнулись при внедрении автоматической маршрутизации: о несуществующих адресах, неизвестных геокоординатах и проблемы определения габаритов отправлений для оптимального заполнения транспорта.20:10 – 21:00    Дискуссия со спикерамиРЕГИСТРАЦИЯ "
]