[
   "Citymobil Data Meetup #2",
   "На митапе мы рассмотрим задачи оптимального планирования маршрутов, диспетчеризации и прогнозирования времени в пути с разных сторон. Поговорим о том, как применяются модели машинного обучения и динамическое программирование для решения этих задач, обсудим влияние внешних факторов. Таких, например, как пробки. А также поймём, как строить жизненный цикл подобных Data Science-решений, чтобы можно было эффективно их масштабировать и развивать под нагрузкой. В гости к Ситимобил придут коллеги из Optimate AI и Яндекс.Маршрутизации.Ждём вас 23 сентября в 18:00.  Регистрация18:00 – 18:10    Вступительное словоАлексей Чернобровов  | Консультант по Data Science  18:10 – 18:40   «Жизненный цикл ML-модели прогноза времени в пути»Максим Шаланкин | Data Scientist в гео-сервисе СитимобилВ Ситимобил мы обучаем много ML-моделей. Но, к сожалению, они не вечны. Мы постоянно дорабатываем и улучшаем их. Да, кстати, у нас они работают под большой нагрузкой. Из доклада вы узнаете, какие подходы мы используем для повышения устойчивости моделей к суровым условиям изменчивого мира. А ещё мы поговорим о жизненном цикле ML-моделей на примере задачи прогнозирования времени в пути.18:40 – 19:10    «Приближенное динамическое программирование в задачах транспортной диспетчеризации».Сергей Свиридов | CTO Optimate AIБольшинство подходов к динамической диспетчеризации транспортных средств – от курьеров и такси до большегрузных автомобилей, основаны на эвристиках или методах комбинаторной оптимизации. Существенным недостатком этих методов является «близорукость» таких подходов с точки зрения максимизации ценности, которую приносит флот транспортных средств во времени. В докладе мы рассмотрим, как приближённое динамическое программирование помогает использовать пространственные, временные и другие характеристики заказов и транспортных средств для улучшения алгоритмов диспетчеризации.19:10 – 19:40    «Пробки и их влияние на решение задачи оптимального построения маршрутов».Даниил Тарарухин |  Руководитель группы аналитики Яндекс.МаршрутизацияЯндекс.Маршрутизация – это сервис, который занимается решением задачи построения оптимальных маршрутов (много курьеров объезжают большое количество локаций, соблюдая многочисленные ограничения). С такими задачами сталкиваются транспортные компании, курьерские службы, ритейлеры с собственной доставкой, фудтех-компании и многие другие организации, у которых есть курьеры, торговые представители или любой коммерческий транспорт.В докладе я познакомлю слушателей с общей постановкой mVRP-задачи, расскажу, как для её решения учитывается дорожная ситуация, и как мы с помощью имитационного моделирования измеряли влияние пробок на качество решения оптимизационной задачи.РЕГИСТРАЦИЯ "
]