[
   "Cloudflare не будет блокировать российских пользователей",
   "\n\r\n7 марта 2022 года гендиректор Cloudflare Мэттью Принц рассказал, что платформа защиты контента и безопасного доступа к информационным ресурсам не будет блокировать всех пользователей из РФ и прекращать свои услуги в стране. Глава Cloudflare считает ошибкой любые попытки закрыть обычным пользователям доступ к открытому и безопасному интернету.\nМы внимательно рассмотрели все запросы на блокировку российских пользователей и обсудили их с экспертами правительства и гражданского общества. Наш вывод – им нужно больше доступа к интернету, а не меньше. Мы наблюдаем резкое увеличение запросов от российских сетей к мировым медиа, что показывает желание простых россиян видеть мировые новости, а не только читать внутренние СМИ в стране. Учитывая то, что Cloudflare предоставляет доступ к более открытому и безопасному интернету, мы считаем полное прекращение работы ошибкой\",\n\r\n– написал глава Cloudflare.В начале марта некоторые эксперты рассказали, что Cloudflare перестанет предоставлять защиту от DDoS российским компаниям, организациям и частным лицам. В компании это не подтвердили.\n\r\nCloudflare сообщила, что будет соблюдать все санкции против компаний, обновлять системы блокировки и вводить точечные ограничения для клиентов платформы, находящихся под санкциями.\n\r\nПо данным Bleeping Computer, Cloudflare удалила все ключи шифрования клиентов из центров обработки данных, расположенных в Украине, России и Беларуси, и внедрила свою технологию «Keyless SSL». Также компания добавила в конфигурацию всех серверов, расположенных в Украине, Беларуси и России, режим автоматического отключения в случае потери питания или разрыва интернет-соединения. Все данные на дисках серверов будут зашифрованы ключами. Заблокированные серверы не смогут загрузиться, если удаленно не будет введен безопасный ключ для конкретного сервера.\n\r\n1 марта 2022 года ассоциация локальных интернет-регистраторов RIPE NCC заявила о нейтралитете средств сетевой коммуникации и автономных систем. Исполнительный совет RIPE NCC считает, что средства коммуникации не должны зависеть от внутренних политических споров и международных конфликтов.\n\r\n2 марта 2022 года представители команды веб-сервиса для хостинга IT-проектов и их совместной разработки GitHub закончили спор о том, нужно ли блокировать российских разработчиков. Платформа заявила, что будет следить за ситуацией и не позволит попасть под блокировку всем подряд, включая обычных разработчиков. Ранее разработчики со всего мира обсуждали необходимость отключения GitHub в РФ. Дискуссия продолжалась 6 дней. \n\r\n3 марта GitLab заявила на требование незамедлительной блокировки всех российских разработчиков, что платформе важен и ценен каждый участник сообщества Open Source. "
]