[
   "Grid Design или вёрстка с Сеткой.",
   "На технику Сетки я обратил внимание около года назад. Тогда эта техника после очень поверхностного изучения показалась мне бесполезной и очень экспериментальной, отталкивало то что для реализаций необходимо создавать лишнюю разметку. Но сейчас уже становится трудно не замечать количество веб-сайтов построенных на сетке, а так же количество статей и уроков о ней. Благодаря последним стало гораздо проще изучить и понять принципы и концепцию, сделать более менее реальные выводы. Мой вывод спустя год таков — «Это простое и полезное решение которое когда либо было создано для вёрстки веб-страниц, должен знать каждый уважающий себя веб-дизайнер.»\n\r\nЧто такое сетка знает каждый кто когда либо работал с графическими редакторами (Photoshop, Fireworks, Gimp и т.п.) и конечно же оценил её необходимость при создание любого дизайна. Но как реализовать Сетку в вебе? По сути Табличная вёрстка была самым настоящим дизайном веб-страниц с Сеткой, несомненно очень удобным. Но не целевое использование элементов table приводило в ужас. \r\nК счастью огромная популярность веб стандартов, выросшая и продолжающая расти за последние годы, а так же их поддержка современными броузерами, дали нам возможность создавать много-функциональные страницы с очень небольшой, логичной разметкой. Такая вёрстка получила название Блочная. Но и у Блочной вёрстки оказалась слабая сторона. При создание страниц с огромным набором элементов различных по размерам и по смыслу, разметка таких страниц стала очень тяжёлым занятием, а если над разметкой работает более чем один человек такая работа может стать кошмаром.\r\nИ вот на выручку пришла техника с использованием Сетки. Эта техника является гибридом между Блочной и Табличной вёрсткой. Её использование даёт нам: \n\nскорость и лёгкость разработки\nсвободу позиционирования\nпропорциональность элементов страницы и их размещения\n\r\nПлата за всё это всего лишь чуть-чуть лишней разметки. Я думаю в наши дни когда стоимость человека часов гораздо дороже железа и производительности, нетрудно догадаться в какую сторону склоняется чаша весов.\n\r\nЧто такое вёрстка с Сеткой? Прежде всего это концепция. Концепция которая включает в себя очень много аспектов дизайна и очень мало правил для её реализаций. Это даёт полную свободу и никакой стандартизаций в её исполнении. Я скажу даже больше — одну и ту же Сетку можно реализовать самыми разными способами. Если вы уже читали про Сетку то могли заметить что каждый автор начинает с новой стороны углубляясь далеко в детали, это мягко говоря вводит в замешательство. К счастью начали появляться Grid Systems — CSS библиотеки для работы с Сеткой. И на их примере можно очень быстро освоить базовые принципы этой техники.\n\r\nЯ думаю не имеет смысла писать о всех аспектах Сетки, информацию о ней вы можете спокойно найти в Интернете. Я предлагаю создать свою простенькую Grid System.\n\r\nДля начала надо усвоить что сетка состоит из колонок и промежутков между ними. Основных величины три — это ширина сетки, ширина колонки, и ширина промежутка между колонками. Ширина колонок зависит от их количества.\n\r\nДавайте попробуем сделать сетку шириной 950 пикселей в 16 колонок с промежутками в 10 пикселей, выходит что одна колонка должна быть шириной 50 пикселей. Уяснив все величины мы открываем любой известный нам графически редактор и создаём макет. К Сетке так же можно добавить отступы с лева и с права, допустим по 20 пикселей и того получается макет шириной 990 пикселей. Мой пример посмотреть можно здесь.\n\r\nТеперь можно начать создавать нашу библиотеку. Как и большинство CSS библиотек наша нуждаетса в глобальном сбросе, я предлагаю CSS Reset от Эрика Майера, сохранив reset.css создадим grid.css в который сразу же можем добавить метод для чистки контейнеров содержащих плавающие блоки — Clear Fix. Первое что нам нужно это правило для контейнера который будет содержать все наши колонки. Ширина каждого контейнера ровна ширине нашей сетки.\n.container {\r\nmargin: 0 auto;\r\nwidth: 950px;\r\n}\r\nТеперь можно добавить правило для наших колонок, оно содержит ширину и отступ. Отступ выполняет роль промежутка(gutter) между колонками.\n.column { \r\nfloat: left;\r\nmargin-right: 10px;\r\noverflow: hidden;\r\nwidth: 50px;\r\n}\r\nДля последней колонки отступ не нужен, для этого добавим правило и для неё:\n.last { margin-right: 0; }\r\nНаши контейнеры содержат колонки, колонки это плавающие блоки, поэтому их приходится чистить. Чтобы избежать лишних .clearfix в разметке можно применить это правило и для контейнеров:\n.clearfix:after, .container:after{\r\ncontent: \".\";\r\ndisplay: block;\r\nheight: 0;\r\nclear: both;\r\nvisibility: hidden;\r\n}\n\r\n.clearfix, .container { display: inline-block; }\n\r\n/* Hides from IE-mac \\*/\r\n* html .clearfix, * html .container {height: 1%;}\r\n.clearfix, .container {display: block;}\r\n/* End hide from IE-mac */\r\nТеперь можно приступить к нашим колонкам. Колонки могут быть шириной в две три и так далее. Для этого мы можем применить к ним следующие правила:\n.span-1 { width: 50px; }\r\n.span-2 { width: 110px; }\r\n.span-3 { width: 170px; }\r\n.span-4 { width: 230px; }\r\n.span-5 { width: 290px; }\r\n.span-6 { width: 350px; }\r\n.span-7 { width: 410px; }\r\n.span-8 { width: 470px; }\r\n.span-9 { width: 530px; }\r\n.span-10 { width: 590px; }\r\n.span-11 { width: 650px; }\r\n.span-12 { width: 710px; }\r\n.span-13 { width: 770px; }\r\n.span-14 { width: 830px; }\r\n.span-15 { width: 890px; }\r\n.span-16 { width: 950px; margin-right: 0; }\n\r\nВ принципе это всё что нужно для реализаций Сетки, можно ещё добавить обёртку и класс для просмотра Сетки с макетом. Создадим main.css и добавим в него:\n.wrapper {\r\nmargin: 0 auto;\r\nwidth: 990px;\r\n}\r\n.overlay {\r\nbackground: transparent url(overlay.png) repeat-y scroll top left;\r\n}\r\nВот как может выглядеть вёрстка:\n<div class=\"wrapper overlay\">\r\n\t<div class=\"container\">\r\n\t\t<div class=\"column\"></div>\r\n\t\t<div class=\"column span-4\"></div>\r\n\t\t<div class=\"column span-11 last\"></div>\r\n\t</div>\r\n</div>\r\n\n\r\nЯ думаю для начала этого достаточно. \r\nМой пример можно посмотреть здесь или скачать здесь.\n\r\nВот парочка замечательных ресурсов о Сетке:\r\nСтраничка Марка Балтона и его Five Simple Steps to designing grid systems.\r\nСтраничка Коя Вина и его Grid Computing… and Design, а так же Grids Are Good.\r\nСайт посвящённый вёрстке с Сеткой Design By Grid. "
]