[
   "NTT Data покупает Dell Services за $3,05 млрд",
   "\n\r\nСегодня подразделение NTT Data японской телекоммуникационной компании NTT Group сообщило о покупке одного компьютерного подразделения Dell под названием Dell Services, ранее Perot Systems, за $3,05 млрд. За счёт сделки NTT Data планирует увеличить своё присутствие на североамериканском рынке, на котором Dell Services достаточно востребована в финансовой, промышленной, здравоохранительной и государственной сферах. Помимо этого объединение компаний обеспечит NTT Data большим портфолио профильных решений для бизнеса и за счёт большого опыта Dell Services позволит расширить список потенциальных клиентов.\n\r\nДля NTT Data это поглощение — крупнейшее за все время существования компании, а после завершения сделки с Dell Services объединённую компанию возглавит текущий CEO Джон МакКейн. Тем не менее, сумма сделки оказалась ниже, чем предполагали аналитики в последние месяцы, но никакой информации о причинах этого пока нет. По информации знакомых со сделкой источников, глава Dell Services Суреш Васвани покинет компанию после завершения сделки, но до этого момента продолжит работать в паре с Майклом Деллом.\n\r\nДля Dell продажа Dell Services станет одним из цикла общих продаж в рамках поглощения и приватизации компании EMC за $67 млрд. Об этой сделке впервые стало известно в октябре прошлого года и ещё тогда CEO Dell Майкл Делл пообещал быстро компенсировать часть потраченных средств за счёт продажи существующих подразделений. В основе Dell Services лежит компания Perot Systems, которую Dell поглотила в 2009 году за $3,9 млрд — с учётом этого сделка для компании в долгосрочной перспективе принесла только убытки.\n\r\nПосле продажи Dell Services следующей на очереди может стать Quest Software, поглощённую Dell в 2012 году за $2,4 млрд. По состоянию на текущий момент стоимость Quest Software составляет примерно $10 млрд — именно эту сумму рассчитывает получить Dell после продажи.\n\r\nВ рамках распродажи подразделений Dell обратилась к ряду IT-консалтинговых фирм, среди которых Tata Consultancy Services, Genpact, Atos и ряд других. "
]