[
   "Toyota использует big data, чтобы избежать ускорения, когда водитель перепутал педали",
   "\n\r\nToyota Motor Corp разработала новую систему аварийной безопасности. При помощи больших данных она позволяет предотвратить ошибку при нажатии водителем педали акселератора вместо педали тормоза. \n\r\nВ качестве big data послужила информация, которую собрали со всех авто Toyota, подключенных к интернету. Ее использовали для того, чтобы исключить случаи, когда водители действительно преднамеренно ускоряли движение. В итоге компания выявила те ситуации, когда акселератор работал неправильно, и смогла задать функцию для контроля ускорения даже при отсутствии препятствий. В Toyota утверждают, что система предотвратит любое случайное или неправильное использование педалей. Она автоматически подавляет ускорение и применяет тормоза.\n\r\nКак показали исследования, водители давят на педали газа и тормоза по‑разному. Алгоритм же определяет, какую именно педаль хотел нажать водитель. Если нажатие производится так, словно водитель хочет притормозить, то ускорение отменяется, даже если был нажат газ. \n\r\nПоводом для внедрения разработки стало то, что большой процент пожилых водителей в Японии попадают в аварию, когда принимают акселератор за тормоз. Всего в 2018 году по вине водителей в возрасте 75 лет и старше в стране произошло около 15 % всех аварий со смертельным исходом.\n\r\nНовую функцию анонсировали в автомобилях Toyota в Японии этим летом. Компания заявила, что намерена поделиться своей системой и с другими автопроизводителями.\n\r\nВ январе на выставке CES 2020 Toyota объявила о планах построить прототип «города будущего» под названием Woven City у подножия горы Фудзи в Японии. Woven City будет представлять собой обособленную экосистему, работающую на водородном топливе, сообщается в пресс-релизе на сайте компании. На площадке будут разрабатываться и тестироваться продукты в таких сферах, как робототехника, «умный дом», искусственный интеллект и другие. См. также: «Владельцы Tesla пожаловались на самопроизвольное увеличение скорости авто. Компания все опровергает» "
]