[
   "X5 Data Driven Meetup #2",
   "X5 запускает первый в этом году митап и сразу по АБ-тестированию. 27 января в 18:00 приходите на онлайн #Х5meetup по data-driven подходу в наших проектах. Обещаем — всё только самое интересное и эксклюзивное от главных спецов Big Data X5. С соблюдением дистанции, но с широким виртуальным охватом спикеры Х5 не только поговорят о последних разработках Х5, но и ответят на ваши вопросы.Регистрация.ПрограммаСтанислав Морозов откроет митап с темой «AБ-тестирование в офлайн ритейле. Особенности дизайна эксперимента».Поговорим о дизайне офлайн АБ-тестов, их специфике. Разберём 5 примеров-ошибок из реальной практики, которые можно допустить при дизайне экспериментов. Определим, в чём была проблема в каждом из примеров и какими методами можно минимизировать вероятность повторного возникновения данных ошибок в будущем. Под конец ответим на вопрос, как лучше выстраивать дизайн экспериментов и как это реализовано у нас.Алексей Кучаев расскажет про «AБ-тесты на скоррелированных объектах».Раскроем методы по улучшению свойств механизма АБ-тестирования в ритейле. В том числе, метод кластеризации, который позволил нивелировать влияние сезонного фактора, а также заметно снизить кросс-корреляцию в данных. Рассмотрим метод оценки, который позволил провести расчёт эффекта на пилотной группе по отношению ко всей торговой сети, а также учесть имеющиеся различия в тренде. Реализованные методы позволили заметно повысить чувствительность механизма и при этом сохранить его устойчивость на приемлемом уровне.  Ерохин Артем раскроет тему «Как перестать беспокоиться и полюбить метаанализ».  Из этого доклада вы узнаете, что такое метаанализ, зачем он нужен и как обычно используется. Рассмотрим основные подходы, плюсы и минусы, некоторые инструменты, применяемые в процессе метаанализа. Закончим экспериментом, в котором опробуем изученные инструменты и убедимся в их полезности.  А подытожит мероприятие Ваагн Минасян с темой «Doubly Robust Difference-in-Differences Estimators: обзор способа оценки эффекта».В докладе рассмотрим и обсудим статью Doubly Robust Difference-in-Differences Estimators (Pedro H.C. Sant’Anna, Jun Zhao, 2020). В этой статье выводятся оценки с двойной надежностью (Double Robust, DR) для среднего эффекта воздействия на целевую группу в условиях Difference-in-Differences и предлагаются оценки, которые состоятельны, если выполняется хотя бы одно из двух условий: или параметрическая модель показателя склонности (Propensity Score Model) верно специфицирована, или параметрическая модель регрессии переменной исхода (Outcome Regression) для контрольной группы верно специфицирована.В статье приводятся 2 оценки — для панельных данных и для повторяющихся кроссекционных данных. Мы обсудим случай панельных данных.Встречаемся в 18.00, а разойдемся ближе к 21.00.Смотрите программу и регистрируйтесь.Трансляция пройдет на YouTube и Facebook X5 Tech. "
]