[
   "«Ростелеком» и поисковик «Спутник» внедряют Big Data в платном ТВ",
   "«Ростелеком» открыл технологический центр в области обработки больших данных для прогнозирования оттока клиентов, расширения тарифной линейки и оптимизации услуг компании. Оператор в 2015 году планировал инвестировать в направление Big Data до 800 миллионов рублей, пишет «Коммерсант».\n\r\n«Ростелеком» работает над проектом совместно с созданной ей поисковой системой «Спутник», запущенной 22 мая 2014 года. Пилотные проекты по использованию технологии прошли в Сибири. Компании построили эффективные модели предсказания спроса на базе более 60 млрд записей в логах активности абонентов и наложили результат на географическую карту, чтобы получить наглядный инструмент для мониторинга абонентской базы, рассказывает директор по развитию «Спутника» Михаил Козлов. Была опробована модель формирования персонализированных предложений клиентам на базе данных платежей, потребляемого трафика, перехода по тарифам и услугам. Для каждого конкретного абонента благодаря технологии можно подготовить страницу с предложением услуг, рекомендациями по способам оплаты и расширению возможностей тарифа.\n\r\nЗадача «Спутника» в рамках этого проекта — интегрировать в бизнес-процессы «Ростелекома» сторонние и собственные решения для работы с большими данными, агрегировать информацию и создавать инструменты и интерфейсы на базе анализа. \n\r\n«Ростелеком» сообщил об успехах по повышению ARPU (среднемесячной выручки на абонента). Технологический центр помог собрать и обработать данные о видеопросмотрах, в результате чего ARPU вырос у участников целевых кампаний «видео по запросу», число покупателей фильмов увеличилось на 20%. \n\r\nДля усиления позиций «Ростелеком» купит 75% российской компании «Айкумен Ибс» за $8 миллионов. Старший вице-президент «Ростелекома» Мария Флорентьева рассказала, что разработчик «позволит реализовать ряд синергетических эффектов с основным бизнесом компании, в том числе за счет использования технологий Big Data для повышения операционной эффективности, мониторинга качества оказываемых услуг, сегментации клиентской базы, персонификации предложений и многого другого».\n\r\nРанее «ВымпелКом» (бренд «Билайн») и «Яндекс» начали стратегическое сотрудничество в области Big Data: отделение Yandex Data Factory разработает сервисы по прогнозу оттока клиентов «Билайн», по повышению работы специалистов по продажам в колл-центрах и по оптимизации затрат на рекламу. "
]