[
   "Верстка рассылок — что мы имеем?",
   "Доброго дня.\n\nИзображение честно позаимствовано с Dribbble.com\n\r\nПрошло немногим менее два года с момента публикации моего первого топика по теме. Что за это время произошло? Mail.ru, Rambler, Yahoo и Яндекс дружно перелопатили свои почтовые интерфейсы, и как следствие — парсеры писем, что доставило приятных эмоций, т.к. было исправлено много противных багов. Gmail стал поддерживать фоновые изображения. Ну а благодаря развитию рынка мобильных платформ к нам на помощь приходят media queries.\n\r\nСмысл поста — подытожить методику верстки писем под сегодняшние реалии, при этом не забывая про ископаемые клиенты.\n\r\nИ да, в посте картинок почти нет. За картинками прошу в обзоры css3 фич.\n\r\nНа данный момент занимаюсь версткой писем, скорей как хобби, поэтому времени на тестирование opera mail, sparrow и прочих «вроде как популярных» клиентов не было. Речь пойдет о следующих:\n\r\n — Все версии MS Outlook\r\n — Mail.ru\r\n — Rambler почта (в новом интерфейсе не исключены баги)\r\n — Яндекс почта\r\n — Gmail\r\n — Yahoo!\r\n — Thunderbird начиная с версии 2.0\r\n — Hotmail\r\n — Windows Live Mail\r\n — Apple Mail начиная с третьей версии\r\n — AOL Mail\r\n — Lotus Notes 8-8.5.\r\n — theBat! дотошно не тестировал, но и нареканий особенно не было\n\n\nWrapper(обертка письма)\n<table width=\"600\" align=\"center\" bgcolor=\"#eeeeee\" cellpadding=\"0\" cellspacing=\"0\" style=\"border-collapse:collapse;\">\n<tr>\n<td>\n// письмо\n</td>\n</tr>\n</table>\r\nПри задании фиксированной ширины для таблицы используем атрибут align для необходимого выравнивания. Никаких margin: auto; не пройдет.\n\r\nДалее задание цвета. Цветовой фон указываем через атрибут bgcolor и в полном шестнадцатиричном формате, не обрезая его до трех символов после решетки. Можно, конечно, задать цвет и с помощью атрибута style, но зачем же отсекать совсем уж древнеюзерские клиенты.\n\r\nНа графический фон я по прежнему настоятельно рекомендую забить. Ведь всегда можно нарисовать макет письма так, чтобы выполнить красивые элементы вставкой тега img в соответствующую ячейку таблицы.\n\r\nКоллапс лечит пробелы между ячейками в Outlook Express, поэтому указываем это значение для всех таблиц в верстке.\n\nОтступы\r\nТак как хедерные стили по прежнему высекаются многими почтовиками мы используем только инлайновые. Но и тут не все так просто. Про padding и margin забываем.\n\nCellspacing\r\nРаботает крайне коряво в яндекс почте и thunderbird. Другие клиенты даже проверять не стал. Всегда задаем этому атрибуту значение равное нулю. \n\nCellpadding\r\nВот он — лучший друг верстальщика. Работает как часы везде! \n\nРаспорки\r\nЕсли сellpadding'a не хватает для реализации и таблица более сложна, на помощь приходят распорки. Для этого берем прозрачную гифку 10 на 10 пикселей. Хотя если вас волнуют старые версии theBat!, то цвет распорки должен совпадать с цветом фона ее размещения, потому что theBat! умеет закрашивать прозрачные пиксели черным цветом.\n\r\nБытует легенда, что спам фильтры плохо реагируют на однопиксельные изображения, поэтому я суеверно остановился на размере 10х10. Для вставленных распорок нужно указывать пустой атрибут alt, иначе в маленькой непрогруженной картинке будет светиться имя файла, что может порушить верстку.\n\r\nПриведу пример рабочего кода с распорками и без.\n\n<table cellpadding=\"10\" cellspacing=\"0\" style=\"border-collapse:collapse; border:#cc 1px solid;\">\n<tr>\n<td width=\"100\" height=\"100\">Картинка</td>\n<td width=\"100\" height=\"100\">Картинка</td>\n<td width=\"100\" height=\"100\">Картинка</td>\n</tr>\n<tr>\n<td width=\"100\" height=\"100\">Картинка</td>\n<td width=\"100\" height=\"100\">Картинка</td>\n<td width=\"100\" height=\"100\">Картинка</td>\n</tr>\n<tr>\n<td width=\"100\" height=\"100\">Картинка</td>\n<td width=\"100\" height=\"100\">Картинка</td>\n<td width=\"100\" height=\"100\">Картинка</td>\n</tr>\n</table>\r\nВ этом случае мы получаем зазор в 20px между картинками и в 10px между крайними изображениями и внешними стенками таблицы.\n\n\n\r\nНо что, если нам необходим отступ в 10px как между ячейками, так и на границах? Cellspacing в классическом HTML справляется с этой задачей, но не тут то было. Я не буду бить пяткой в грудь, доказывая, что конкретно в этом случае будут баги, но в подобных они наблюдались и поэтому я предлагаю следующее решение.\n\n<table cellpadding=\"10\" cellspacing=\"0\" style=\"border-collapse:collapse; border:#cccccc 1px solid;\">\n<tr>\n<td width=\"10\" height=\"10\"><img src=\"blank.gif\" width=\"10\" height=\"10\" style=\"display:block;\" alt=\"\"></td>\n<td width=\"100\" height=\"100\">Картинка</td>\n<td></td>\n<td width=\"100\" height=\"100\">Картинка</td>\n<td></td>\n<td width=\"100\" height=\"100\">Картинка</td>\n<td></td>\n</tr>\n<tr>\n<td></td>\n<td width=\"100\" height=\"100\">Картинка</td>\n<td></td>\n<td width=\"100\" height=\"100\">Картинка</td>\n<td></td>\n<td width=\"100\" height=\"100\">Картинка</td>\n<td></td>\n</tr>\n<tr>\n<td></td>\n<td width=\"100\" height=\"100\">Картинка</td>\n<td></td>\n<td width=\"100\" height=\"100\">Картинка</td>\n<td></td>\n<td width=\"100\" height=\"100\">Картинка</td>\n<td width=\"10\" height=\"10\"><img src=\"blank.gif\" width=\"10\" height=\"10\" style=\"display:block;\" alt=\"\"></td>\n</tr>\n</table>\n\nИзображения\r\nКартинки в письма вставляются двумя способами: пересылка вместе с письмом во вложении либо картинки лежать где то на удаленном сервере, а в верстке просто указывается путь к ним. Разница в том, что на сколько мне известно, приаттаченные картинки прогружаются в клиенте автоматически, даже если были отключены в настройках. Могу ошибаться. Если это так, то это дурной фон, я считаю. Это как минимум неприятно, когда происходит не по твоему(со стороны получателя), ну и трафик.\r\nЕсли же картинки лежат где-то далеко и у пользователя в настройках они отключены, нужно следовать нескольким простым советам: \n\r\n — Если картинка несет смысловую нагрузку(например это логотип или важное изображение), то ему надо задать ширину через атрибут width, высоту соответственно через height, title — на ваше усмотрение, alt — для того, чтобы дать описание непрогруженному изображению, и заинтересовать пользователя прогрузить ее.\n\r\n — Если же картинка смысла не несет, а является украшением(тень, ленточка), то ничего вышеуказанного просто не задаем. Пользователь не увидит ее пока не включит все изображения в письме. Применимо при условии, что отсутствие размеров не порушит верстку. Иначе размеры стоит указать.\n\r\nЕсть еще один момент. Если картинка располагается внутри ячейки таблицы, то у нее может появиться нижний отступ в несколько пикселей. Лечится двумя способами:\n\r\n — обернуть изображение в блок \r\n — установить атрибут style для картинки со значением display:block;\n\r\nЭтот костыль делает изображение блочным элементом. Можно расценить как минус. Но в моей практике это боком не вставало. Иногда этот отступ не мешает. \n\r\nЧисто теоретически блок-обертку для картинки можно заменить на span с нулевым line-height, но это еще не тестировалось.\n\nФорматирование\r\nКак я уже писал, использование тегов абзаца — не лучшее решение для точного отображения во всех клиентах. Хотя можно использовать, если пара лишних отступов не критична. Некоторые старые клиенты выставляют дефолтные отступы для абзацей по своему, а margin и padding режут. Именно поэтому ниже привожу два варианта реализации абзацей.\n\nАбзацы с четким интервалом в пикселях\n<table cellpadding=\"0\" cellspacing=\"0\" style=\"border-collapse:collapse;\">\n<tr>\n<td>Текст абзаца</td>\n</tr>\n<tr>\n<td height=\"20\"><img src=\"blank.gif\" width=\"20\" height=\"20\" alt=\"\" style=\"display:block;\"></td>\n</tr>\n<tr>\n<td>Текст абзаца</td>\n</tr>\n<td height=\"20\"><img src=\"blank.gif\" width=\"20\" height=\"20\" alt=\"\" style=\"display:block;\"></td>\n</tr>\n<tr>\n<td>Текст абзаца</td>\n</tr>\n</table>\nАбзацы с интервалом в line-height\n<span style=\"line-height:1.5em;\">\nТекст абзаца\n<br><br>\nТекст абзаца\n<br><br>\nТекст абзаца\n</span>\r\nСвойство line-height сработает не во всех клиентах, но в этом нет ничего страшного. Полуторный интервал выглядит очень хорошо для текста и адекватно воспринимается «нормальными» почтовиками. Ну а если какой либо клиент вырежет это свойство, то ничего. Вот вам причины выбрать тот или иной способ. Количество кода или одинаковое отображение.\n\nШрифт, размер и цвет\r\nРаньше я использовал чистую html конструкцию с тегом font и атрибутами face, color и size. Это работает. Но отказался по следующей причине. Отправка писем в системе рассылки использовала редактор tinyMCE для исходного кода письма. Этот пресловутый редактор перебивал все font на span с кривыми стилями.\n\r\nТак я пришел к тому, что нужно использовать span вместо font, и задавать инлайновые css стили через атрибут style.\n\r\nВсе прекрасно кроме одного мизерного НО. Древнющие клиенты, а так же настраиваемые на отключение css, не видели всей нашей красоты. Да и черт с ними. Если человеку не нужно оформление, незачем его навязывать. \n\r\nТут, собственно все. Напомню лишь об указании полного шестнадцатиричного формата цвета для задания в css. Хотя можно обойтись и его прямым названием, например black.\n\nСсылки\r\nКратко и просто. \n\r\n — Задаем атрибут target со значением _blank для всех ссылок кроме mailto:(для них не критично).\r\n — Обнуляем border для изображений-ссылок\r\n — Указываем important! цвет для ссылок во избежание смены цвета на hover и active(этим грешит Яндекс почта, по крайней мере)\n\nМобильные платформы\r\nДа, использовать media_queries можно, и даже нужно! Как правило это используется для жесткого задания ширины обертки нашего письма. Ведь с резиновыми макетами все достаточно плохо, т.к. max-width, например работает далеко не везде. Многие мобильные почтовые клиенты исправно поддерживают media_queries, поэтому смело экспериментируйте.\n\nЧто почитать\r\nЕсли кто пропустил, привожу ссылки на предыдущие публикации по теме.\n\r\n — Верстка почтовых рассылок\r\n — Юзабилити почтовых рассылок\r\n — Верстка почтовых рассылок: взгляд изнутри\r\n — Верстка почтовых рассылок: разбор полетов\r\n — Костыли при верстке рассылок\r\n — Почтовые рассылки — немного о глупом\r\n — Почтовые рассылки: Долой костыли!\r\n — Почтовые рассылки: письменная кухня \r\n — FAQ по верстке рассылок \r\n — Красивый и эффективный email маркетинг \r\n — Верстка HTML писем: думай как баг  "
]