[
   "Верстка e-mail рассылок — «подводные камни». Часть вторая",
   "\r\nЗдравствуйте, уважаемые хабравчане!\r\nБуквально пару дней назад мы опубликовали первую часть топика, посвященного верстке e-mail рассылок, а конкретнее — использованию изображений. Вторая часть посвящена ещё четырем «подводным камням» верстки, которые нам удалось обнаружить.\n\nВторой камень — «Якоря»\r\nЕсли рассылка большого объема на несколько страниц, появляется необходимость навигации внутри рассылки. Как известно, для такой навигации на html-странице используются «якоря».В нужном месте прописываем  — ставим якорь, ставим ссылку на этот «якорь»: .\r\nРассмотрим пересылку письма через Outlook Express, Windows Live Mail и Outlook 2007.\n\nOutlook Express\nВ онлайн-сервисах якоря не работают: \ngmail.com — в принципе отключает переключение по «ссылкам-якорям»;\nmail.ru – по якорям переходы на страницу с ошибкой (адрес ссылки преобразуется к win.mail.ru/cgi-bin/#anchor);\nyandex.ru – по якорям переходы на несуществующие страницы (адрес ссылки преобразуется к mail.yandex.ru/neo2/#anchor, перебрасывает на страницу mail.yandex.ru/neo2/#404).\n\nВ Outlook 2007 переходы также не работают.\nВ TheBat! переходы работают.\n\nWindows Live Mail, Outlook 2007\nВ онлайн-сервисах mail.ru и yandex.ru якоря не работают (переходы аналогично Outlook Express);\nВ сервисе gmail.com переходы работают;\nВ Outlook 2007 переходы работают;\nВ !TheBat переходы работают.\n\nСводная таблица\r\nДобиться корректной работы якорей во всех почтовых сервисах нам не удалось. Возможно, решение проблемы есть — будем благодарны, если кто-то подскажет. В остальном для якорей в качестве программ пересылки писем лучше использовать Windows Live Mail или Outlook 2007.\n\n\n\nТретий камень — Границы и выравнивание в таблицах\r\nИногда в рассылке необходимо поставить разделитель — горизонтальную или вертикальную линию. Поскольку рассылки верстаются с помощью таблиц, то и разделителями, как правило, служат границы ячеек. Однако есть особенность распознавания таких границ в зависимости от того, с помощью какой почтовой программы делается пересылка, и через какую программу просматривается полученное письмо.\n\nРассмотрим ситуацию: у таблицы задается только нижняя горизонтальная граница.\n\nПрописываем это так:\n\r\n<table cellspacing=\"0\" cellpadding=\"0\" border=\"0\" width=\"210\" style=\"width: 210px; border-width:0 0 1px 0; border-style: solid; border-color: #e2e2e2;\">\r\n\r\nПересылаем через Outlook Express, Windows Live Mail и Outlook 2007.\n\r\nРезультат получаем в TheBat!:\n\nВ письме из Outlook Express граница выглядит нормально — видна только нижняя граница;\nВ письме из Windows Live Mail границы у таблицы сверху и снизу отображаются не совсем корректно;\nВ письме из Outlook 2007 внутри таблицы отображаются все границы, что некорректно.\n\n\n\r\nВ онлайн-сервисах проблема с границами видна только в письме из Outlook 2007 — у таблицы прорисовывается контур полностью, а не только нижняя граница.\n\r\nПри пересылке через Outlook 2007 в сочетании с получением через TheBat! работает принцип: если у таблицы прописана хотя бы одна граница, то отображаться будут все границы, включая внутренние. При получении через онлайн-сервисы ситуация аналогична в yandex.ru. В gmail.com и в mail.ru ситуация похожая, только внутренние границы не отображаются.\n\r\nЧто касается выравнивания в таблицах — есть одна особенность при получении писем в программе TheBat!.. Если в начале у таблицы стоит выравнивание align=«center», то ВСЁ внутри вложенных таблиц будет по центру. Чтобы этого избежать — нужно у любой вложенной таблицы прописывать align=«left».\n\nСводная таблица\n\n\nЧетвертый камень — Отступы\r\nПри пересылке через Windows Live или Outlook Express отступы отображаются корректно в различных почтовых программах и сервисах. При пересылке через Outlook 2007 возникает следующая проблема:\r\nOutlook 2007 содержимое любой ячейки в таблице (а рассылка верстается таблицами) оборачивает в <p class=\"MsoNormal\" style=\"\"></p> При получении письма в почтовом сервисе yandex.ru наблюдается увеличение всех отступов в письме. Объясняется это просто: в скомпилированном стиле у <p class=\"MsoNormal\" style=\"\"> проставляются margin-top: 15px и margin-bottom: 15px. При верстке это нужно учитывать.\n\n\n\nСводная таблица\n\n\nПятый камень — Стиль текста и ссылок\r\nКак правило, корпоративные рассылки оформляются в соответствии с фирменным стилем, что подразумевает использование определенных шрифтов и цветов в том числе у текста и у ссылок. И здесь мы обнаружили 2 проблемы:\n\n1. «Поломка» шрифта\r\nПри пересылке через Outlook Express или Windows Live и получении писем в yandex.ru шрифт текста «ломается» в случае, если для форматирования текста используется тег font и в ячейке таблицы перед текстом есть другая таблица.\n\nТо есть при использовании конструкция вида:\n<td><font color=\"#525252\" size=\"2\" face=\"Arial\">\r\n<table><tr><td><font color=\"#525252\" size=\"4\" face=\"Arial\">текст1</font></td></tr></table>\r\nтекст2\r\n</font></td>\n\r\nШрифт блока «текст2» заменяется на некий стандартный. Если посмотреть получившийся код, можно увидеть:\n<td><font color=\"#525252\" size=\"2\" face=\"Arial\"></font>\r\n<table><tr><td><font color=\"#525252\" size=\"4\" face=\"Arial\">текст1</font></td></tr></table>\r\nтекст2\r\n</td>\n\r\nФактически закрывающий тег font «переносится» над таблицей.\n\n\n\nРешение проблемы: использовать тег span и прописывать цвет, размер и гарнитуру шрифта через атрибут style. В статьях Верстка почтовых рассылок: взгляд изнутри и  Верстка почтовых рассылок уже сказано об этом. Так что «поломка» шрифта при наличии вложенных таблиц — это ещё один аргумент в пользу span.\n\n2. Форматирование ссылок\r\nЦвет и шрифт текста ссылки принудительно поменять можно (прописав стили у ссылки и font внутри ссылки, либо обернув ссылку в span, что правильнее), подчеркивание — увы, не всегда. Внешний вид рассылки от этого портится. Прикручивание своих стилей было замечено при пересылке через Outlook 2007 и получении в gmail.com, mail.ru, yandex.ru (ниже примеры с подчеркиванием, которого по стилю быть не должно):\n\n\n\nСводная таблица\n\n\n\nРезюме\r\nВерстка рассылок — задача не самая простая. Вполне возможно, что есть и другие «камни», на которые мы просто не натолкнулись. Будем рады, если вы поделитесь какими-то проблемами и решениями. Чем больше информации, тем меньше ошибок в будущем ;)\n\r\nИ на последок, мы сделали общую сводную таблицу по найденным «подводным камням». Посмотреть её вы можете здесь. "
]