[
   "Вот ваш мозг на Питоне: исследователи расшифровали нейро-механику программирования",
   "\n\nКак активизируются области мозга во время программирования, логических рассуждений и при использования языка. Иллюстрация Университета Джона Хопкинса.\n\r\nИсследователи из Университета Джона Хопкинса составили карту мозговой активности опытных компьютерных программистов, пока те ломали голову над кодом. В результате стала очевидной нейронная механика, лежащая в основе этого все более востребованного навыка.\n\r\nИсследователи давно подозревали, что мозг справляется с программированием аналогично тому, как решает математические задачи или даже разбирается с языком. Однако новая научная работа продемонстрировала, что у опытных кодеров большая часть мозговой активности приходится на область, связанную с логическими рассуждениями, хотя и сконцентрирована в левом полушарии, отвечающем за языковые способности.\n\r\n«Люди учатся программированию по-разному: от чтения самоучителей до формальных курсов. Удивительно, что мы обнаруживаем такую ​​последовательную модель активации мозга у людей, которые программируют, — сказала автор исследования Юнь-Фей Лю, аспирантка лаборатории нейропластичности университета. — Это особенно удивительно, потому что мы знаем, что решающий период для овладения языком обычно заканчивается в раннем подростковом возрасте. А многие люди учатся программировать уже взрослыми».\n\r\nРезультаты исследования опубликованы в журнале eLife.\n\r\nУченые давно разобрались, что происходит в мозгу, когда человек читает, играет на музыкальном инструменте или занимается математикой. Но, хотя мы все больше полагаемся на технологии, при этом почти ничего не знаем о нейронных механизмах компьютерного программирования.\n\r\n«Люди хотят знать, что делает человека хорошим программистом, — отметила Лю. — Если мы знаем, какие нейросистемы активируются, когда кто-то пишет код, то можем найти лучший способ обучения программистов».\n\r\nПо словам Лю, многие люди предполагают, что у технарей математический склад ума и что область мозга для программирования будет совпадать с той, которая решает математические задачи. Другие считают, что языки программирования не зря называются языками. Следовательно, нейронный механизм, лежащий в основе программирования, будет использоваться совместно с обработкой языка. Или это могут быть части мозга, используемые для логических рассуждений, ответственные за способ решения проблем, известный как «исполнительный контроль».\n\r\nЧтобы разобраться в этом, Лю собрала 15 опытных программистов, в совершенстве владеющих языком Python. Каждый из подопытных лег в сканер фМРТ, чтобы измерить активность мозга в процессе программирования.\n\r\nКаждый раз загоралась одна и та же область мозга: та, что отвечает за логические рассуждения. Хотя логические рассуждения не привязаны к конкретному полушарию мозга, при кодировании в значительной степени отдавалось предпочтение левой половине, которая предпочтительна для языка.\n\r\nТеперь лаборатория надеется определить, легче ли в юности учиться программированию, как и изучать язык.\n\r\n«Это правда, взрослые могут научиться программировать. Но, может быть, дети справляются лучше? Или у программирования нет критического периода обучения, что делает навык особенным, — говорит со-автор исследования Марина Бедны, доцент кафедры психологии и мозговых наук. — Возможно, наша система образования работает неверно, и мы должны учить детей программировать в средней школе, иначе они упускают возможность стать лучшими специалистами».\n\n\n\n "
]