[
   "Выбираем фотокамеру",
   "Часть 1.“Ноги-крылья… Главное – хвост!”Многие не без основания  скажут, что лучшая камера – это та, которая находится у вас в руках в  момент съемки, и будут правы. Мы снимаем тем, что у нас есть. Главный  вопрос: какими характеристиками обладает эта камера, для чего они нужны, эти самые характеристики, и, что немаловажно, как используются и используются ли вообще? В нынешней ситуации у большинства людей всегда “под рукой” находитсятолько смартфон. Им и снимают. И снимают порой очень неплохие кадры ивидео-ролики. Правда, многие фотографы считают камеру смартфона совсемнесерьезной и даже не пытаются разобраться, чем же они на самом деле ониобладают. А зря! Камеры большинства современных смартфонов обладаюттакими характеристиками и функциями, которые даже и “не снились” дорогимпрофессиональным фотокамерам лет 10-15 назад.Что самое важное в вашей (будущей) фотокамере? Большая матрица?Высокие значения светочувствительности (измеряемое по стандарту ISO)?Высокая степень автоматизации и развитый “интеллект”?Неприхотливость, защищенность и долговечность?Небольшая цена?Кто-то скажет, что для каждого это что-то свое и… будет неправ, потому что конечная цель у любого (даже профессионального!) фотографа совсем не та же, что у товарища Сухова в известном фильме \"про баланс белого в пустыне\" – помучиться, а совсем  даже другая – получить хороший кадр максимально быстро и просто. Если это не ваша цель, значит вы не фотограф, а нечто иное, просто имеющее некое отношение к фотографии…Сразу хочется отметить, что любитель – от профессионала на работе – принципиально отличается только тем, что профессионал заранее четко знает, что, как и в каких условиях он будет снимать, а также, какой именно результат он должен получить на выходе. В соответствии с этим продумываются место и время съемки, подбираются свет, камеры, объективы и прочее фотооборудование. Этап подготовки при профессиональной фотосъемке может значительно превышать время самой съемки. Например, для получения одного единственного кадра может быть необходима недельная (а то и больше) подготовка.Любитель, как правило, лишен возможности предугадать заранее, что именно ему удастся снять, следовательно, заблаговременно запастись именно тем набором фототехники, который позволит наилучшим образом снять всё то, что может “подвернуться под глаз” – практически невозможно. Поэтому любителю  лучше рассчитывать на универсальное оборудование с широкими диапазонами  всех настроек. То же самое касается и фотографов-путешественников:– Классный пейзаж? – Снимаем!– Люди на улице? – Обязательно!– Бабочка села? – Без макро – никуда!– А селфи себя любимого на фоне экзотики? – Само-собой!Вот и тащат некоторые фототуристы на себе, как верблюды, пять-десять кило мега-оптики и супер-камер – и в  горы, и в самолеты и куда придется… Тяжело, а ничего не поделаешь: “Фото-тревел”.....!!!Конечно же, это неразумно. Но другого пути они не видят, хотя он, как обычно, - прямо у них перед носом, но то ли сила привычки, то ли извечный фотоснобизм не дают им увидеть простую истину: всё то же самое можно снять с гораздо меньшими затратами средств, сил и времени. Поэтому, первый шаг в поиске своей фотокамеры каждый должен начинать с досконального изучения того, чем он уже располагает, и попыток выжать из этого максимум. А уже затем, когда возможностей камеры вашего смартфона действительно перестанет хватать для выросших фотографических запросов вас как фотографа, можно начинать поиск следующей, более серьезной камеры. Ведь снимает не камера, а фотограф, и если он ленив, бездарен и глуп, даже самый дорогой Hasselblad не поможет снять ему хоть сколько-нибудь приличный кадр.О зеркалках“Я так долго тебя искал в королевстве кривых зеркал…”Рассмотрим вопрос, что  же такое зеркалка, и какие у нее на самом деле плюсы и минусы? На самом деле для фотолюбителя у зеркалки – одни минусы, ну, кроме дурацких понтов,  разумеется. Другое дело – для профессионального фотографа, которому важны те нюансы, о которых любитель даже и не подозревает. Для него серьезная зеркалка или беззеркалка со сменной оптикой – единственная  возможность достичь того результата, который требуется заказчику. Но  даже для серьезного профессионала зеркалка сейчас – больше дань традициям или привычке, нежели что-то действительно необходимое: беззеркалки сейчас доросли, а где-то и переросли уровень зеркалок.Кстати, все разговоры о плюсах зекралок применимы только к действительно серьезным (и, как  следствие, – дорогим) профессиональным камерам, а не к тому дешевому барахлу, которое каждому любителю-новичку пытаются  втюхать ушлые продавцы фотомагазинов. Потому что большинство недорогих  зеркалок по удобству и конечному результату ничем не отличаются от  хороших (или не очень) компактных фотокамер с несменной оптикой, а  некоторые и от смартфонов уже отстают…А то, что у зеркалки есть  возможность менять объективы (кстати, абсолютное большинство покупателей зеркалок никогда в жизни не снимает тот дешевый объективчик, который установлен на камеру производителем “по умолчанию”) и где-то внутри зачем-то какое-то \"зеркало\" – фактически это те же понты и ничего больше. Ведь оценивается-то всегда результат  – снятые фотографии, а не то, чем и как оно снято. Хотя, встречаются в сети любители публиковать к каждому кадру перечень моделей всего своего фотооборудования с полным списком его настроек, зачастую тупо скопированных из EXIF данных кадра...Итак, зеркало. Зеркало в фотокамере необходимо для работы видоискателя - и только-то! В самой фотосъемке (процессе экспонирования светочувствительного элемента) - оно не участвует. Никак. Вообще! Во времена плёночной фотографии появление зеркала в камерах было актуально. Очень. Сейчас - когда плёнку заменила электронная цифровая матрица - зеркало стало пережитком: его с успехом заменяют электронные же светодиодные дисплеи: что на задней стороне камеры, что в видоискателях. И делают они это гораздо эффективнее, позволяя совмещать с простым изображением кадра (как в зеркалках) массу дополнительной информации.Я специально не хочу здесь объяснять все принципы и особенности устройства и работы зеркальных фотокамер. В конце концов, тот, кому это действительно необходимо - должен разобраться в этом сам, а тот, кому разбираться в этом не нужно - пусть просто поймёт, что зеркальные фотокамеры, так же как и плёночные - это определённый этап в истории фотографии, который уже заканчивается.Итак, зеркалка – это просто маркетинговая ловушка для простаков, которая не дает ничего для конечного результата – никак не улучшает качество фотографии, а вот цену камеры, к сожалению, меняет существенно. Поэтому, прежде чем покупать себе зеркалку посмотрите для начала характеристики и возможности компактных фотокамер. Вы удивитесь, узнав, что компактные камеры гораздо меньших  размеров, веса и ценового диапазона могут обладать гораздо большими возможностями и лучшими характеристиками, чем пресловутые зеркалки. Кстати, вопреки расхожему мнению, многие современные смартфоны способны снимать фотографии и видео, по качеству не уступающие многим “компактам” и “зеркалкам”. Обратите внимание на витрины “профессиональных” магазинов фототехники: они буквально завалены дорогими зеркалками! И это - именно потому что многие профессионалы уже осознали в полной мере  бесперспективность зеркалок и при возможности отказываются от них,  переходя на беззеркальные камеры. Кстати, все фотокомиссионки тоже завалены именно зеркалками…Чем ещё \"хороша\" зеркалка? Еще она  “хороша” тем, что вас везде будет сопровождать щелканье затвора. Особенно классно это выглядит при съёмке концертов: тишина, все слушают, не то что чихнуть, шевельнуться боятся, и тут вы(!): шумно встаете,  бодро топаете по проходу, вскидываете камеру и затвором эдак – “щелк!  щелк!” – заглушая и выступающих и вообще всё. А если сверху еще вспышку, нацеленную по-модному, “в небо”, прикрутить – вообще шоу получится! И, как вы думаете, что запомнится зрителям больше всего? Правильно, ваше “выступление”. Будут потом рассказывать: “ходил там один козел с  зеркалкой, объективом махал, да затвором щелкал… ” Класс! Зато вы себя сможете почувствовать “на коне” – впечатление произвели, а  уж что там получилось в результате получилось – это не столь важно, не для этого вы, в самом деле, свою зеркалку покупали…Это конечно, скорее шутка, однако, до сих пор ещё встречаются люди, не желающие (или не способные) не мешать другим при съемке: не выключающие звуки и вспышки в камерах своих мобильников, тянущие \"к небу\" руки с планшетами (а чего стесняться-то? - я же снимаю, и ничего, что я для 50 человек закрыл артистов на сцене), щелкающие своими зеркалками...Вот и получается, что от зеркалки в современном фотомире – толк есть только для профессионалов (да и то - не для всех), а для всех прочих фотолюбителей (не путайте  фотолюбителей с любителями понтов!) – одни неудобства. Так что, стоит  начать с того, что уже есть у вас под рукой и постараться выжать из него  все, что можно, и только потом, если вам “не хватит” – начинать искать  что-то более серьезное. И это “серьезное” стоит искать – не в сегменте  уходящих с рыночной “сцены” зеркалок.Во второй части статьи мы поговорим о важных свойствах и функциях современных фотокамер, основываясь на знании которых, можно сделать для себя действительно осмысленный выбор фотокамеры. ",
   "  Только зарегистрированные пользователи могут участвовать в опросе. Войдите, пожалуйста. А чем предпочитаете снимать вы? \n            18.67%\n           Чем придётся \n            14\n           \n            28%\n           Смартфоном \n            21\n           \n            36%\n           Любимой зеркалкой \n            27\n           \n            8%\n           Я профи и каждый раз выбираю технику для съёмки \n            6\n           \n            9.33%\n           Вообще не снимаю \n            7\n            \n       Проголосовали 75 пользователей. \n\n       Воздержались 15 пользователей. \n    "
]