[
   "Инструкция для тех, кто решил что уже пора",
   "Истории по эмиграции часто строят по принципу инструкции, \"идешь в это окошко, отдаешь такие документы\" или как истории успеха типа \"я попробовал и вам советую\". Я попробую отойти на шаг назад и обрисовать роадмап движения к тому, чтобы вообще задумываться о поиске работы в развитых странах.Начнем с плохих новостей. Да, на свете есть страны, в которых обсуждается тема \"Зайцы охренели до такой степени, что жрут корм, оставленный для птиц\" и все ждут выступление президента по этому поводу, потому что это самая серьезная проблема в стране. Но если мысль понаехать туда у тебя появилась только на прошлой неделе — это значит ты не занимался подготовкой предыдущие два года и, сори, тебе нужно заниматься подготовкой следующие два года. Может показаться что два года — это слишком и \"мне то нужно завтра, какие два года\". Но тут история такая: к началу текущей спецоперации ты уже не успел. У тебя есть шанс успеть к началу следующей. Воспользуешься ты им или нет - зависит только от тебя.Опять же, я понимаю, что кто-то закончил языковую школу и при выступлении британской королевы подмечает стилистические ошибки ее английского, а кто-то консультировал Оракл при разработке HashMap и для них переезд — это вопрос желания, а не возможности. Но я говорю о неком \"среднестатистическом случае\", когда инглиш не флюент, а за плечами нет 10 лет опыта в аду.В целом, до того, как начинать читать статьи \"какие документы нужны для переезда в Швейцарию\" у тебя, будущий ауслэндер, должны присутствовать четыре ключевых фактора успеха:языкхард скиллысофт скиллыподготовка к конкретному интервью Обо всем по порядкуЯзыкТы наверно уже загуглил ближайшие школы английского. Не торопись. Сейчас меня закидают помидорами, но на английском свет клином не сошелся. Т.е. какой-нибудь А2 у тебя, конечно, должен быть, чтобы \"читать профессиональную литературу со словарем\", но, прежде чем тянуть его дальше - стоит подумать. Чем поможет английский в эмиграции? Он поможет получить доступ к рынку труда в таких странах как:СШАКанадаАвстралияНовая ЗеландияВеликобританияИрландия(дополняйте если кого-то забыл)Также, английский откроет тебе доступ, условно, к 5% рынка труда таких стран как:ГерманияАвстрияШвецияФинляндияДанияНорвегияну и дальше весь Евросоюз по списку.И если одна из стран первого списка для тебя - предел мечтаний, пропусти все что будет дальше и иди доучивать английский. Если работа для тебя на первом месте в ворк-лайф бэланс — это хорошие страны.Если ты всю жизнь мечтал жить в Финляндии или Дании, но не уверен, что на том \"узком\" рынке тебе найдется место и хочешь подстраховаться - тоже учи английский.Но если ты любишь пиво с сосисками не имеешь каких-то жестких предпочтений по целевой стране - тебе стоит присмотреться к Dach region. Это просто гигантский рынок труда, но на подавляющее большинство ИТ-вакансий в Германии рассматриваются только кандидаты с В2 немецким и выше. Т.е. внутри Германии есть два почти не пересекающихся рынка труда: для инглиш-спикинг девелоперов и для дойчер энтвиклеров. При чем последний раз в десять больше. Но мало того, что это большой рынок, на нем еще и предложение гораздо скромнее: если ты пытаешься устроиться в Германию разрабом с английским - ты конкурируешь с индусами, китайцами, ну и т.п., т.е. предложение на рынке весьма впечатляющее, а сам рынок не очень большой. Но если ты, дорогой друг, вместо инглиша освоишь дойч - ты получишь доступ ко второй части рынка труда, при этом китайцев там не будет, а рекрутеры будут за тобой носиться ничуть не меньше, чем на российском рынке.Про немецкий язык не мало страшилок, мол он сложный, падежи и все такое. Ну да, падежи, но есть и плюс: в немецком гораздо больше общей лексики с русским, чем в английском. Несколько преувеличивая, можно сказать, что половину слов даже учить не надо. Что значит Krawatte на немецком? Правильно, галстук. (шучу, этот \"ложный друг переводчика\" - исключение, в подавляющем большинстве случаев так не происходит). А сложность правил, на мой взгляд, компенсируется наличием для большинства из них аналогов в славянских языках, плюс, кажется, для разрабов разбираться в принципах гораздо ближе, чем просто зубрить бесчисленную лексику.В общем я не на чем не настаиваю, но подумай на счет немецкого. Может быть, если тебе не светит переезд в ближайшие полгода - стоит учить именно немецкий. Это займет чуть больше времени, но обещает неплохие результаты.Как бы там ни было, условно, уровни английского и немецкого А1 и А2 берутся при нормальном усердии по полгода за каждый, В1 и В2 - по году за каждый (если упороться - наверно можно и быстрее, но можно потерять мотивацию, а если растягивать - с мотивацией будет проще, но до начала следующей спецоперации можно не успеть)Также, бытует мнение что учить язык сложно. Твои ощущения от изучения иностранного языка скорее всего основаны на советской методике 70-летней давности. Так вот, они там на западе все эти 70 лет не только гамбургеры с кока-колой ели, но и новые методики обучения изобретали. Все что тебе нужно сделать, дорогой друг — это притащить свою задницу на занятия. Все. Ничего не надо учить, зубрить неправильные глаголы как в школе и т.д. и т.п. Современные методики построены таким хитрым образом, что оно как-то само запоминается. Главное не нарваться на препода а-ля \"я всю жизнь работала смотрителем эскалатора, но в юности прожила 5 лет в ГДР, пока мой муж служил в западной группе войск и сейчас буду тебя учить\". Кстати, если ты решишь учить немецкий - всячески рекомендую курс Lagune. Можешь прям преподов и искать по этому принципу: \"по какой методике занимаетесь?\" если слышишь в ответ что-то типа \"курс Лагуна института Гёте\" — значит хороший учитель, можно брать. (это не означает что другие методики плохие, это означает что по этой методике у меня есть данные)И еще одно: я могу тут долго распинаться про то откуда у этого совета ноги растут и почему онлайн занятия не работают, но ходи на офлайн занятия в группах. Как минимум на уровнях В* это сильно лучше, чем онлайн.Собесы, кстати, само по себе хорошая языковая практика. Если иметь один-два в неделю — это хорошее дополнение к двум урокам и двум домашкам. Но это можно практиковать при уровне владения В1 и выше.Необходимый уровень владения, не поражает воображение. Я, прежде чем получил свой офер с релокацией, имел твердый (в три часа ночи разбуди - сдам) В1 или такой не очень уверенный В2 инглиш.Самое важное в изучении языка - не ждать что он выучится за полгода. Не рассматривай это как \"работу на результат\", рассматривай язык как стиль жизни. На работу ты каждый день ходишь? Вот и языковые курсы должны стать чем-то естественным, что делается постоянно. Регулярность — это то что приведет тебя к успеху.Хард скиллыТут много не скажешь, т.к. языки и технологии у всех разные, но в целом я бы сделал следующие обобщения (которые естественно являются компиляцией моего собственного опыта и могут нести отпечаток наблюдателя):В резюме должно быть нарисовано минимум 5 лет по той области/языку, по которым ты пытаешься устроиться. Натягивай всеми возможными способами, на до мной как будто стеклянный потолок разбился, когда общий java стаж перевалил планку в 5 лет (хотя вместе с 1Сным опытом было 10+ лет), до этого прям не понимал почему на первом-втором интервью идут отказыЕсли на работе не пинать, а работать хотя бы половину времени - необходимые для прохождения тех.интервью скиллы сами собой наработаются года за 3-4. Кстати, само по себе прохождение тех.интервью улучшает скилл прохождения тех.интервью. Отсюда, как и в предыдущем пункте, следует совет не опускать руки после трех отказов и превратить практику тех.интервью из логики \"работа на результат\" в логику \"еженедельная практика\".Они долгие. В Мск, если задаться целью и не сильно привередничать по з/п, можно наверно от первого собеса до первого рабочего дня за неделю уложиться. Там так не бывает (если, конечно, ты не Google Fellow). От момента первого письма типа \"привет, нашел вакансию, вот мое резюме\" до первого собеса может легко пройти пара недель. Собесов штук 5 — это в целом норма. По две недели между ними. Посчитал?Требования по вакансиям, как правило описываются плюс-минус как в СНГ, но на тех.собесах активно налегают на фундаментальные вопросы (типа там копания в джава мэмори модел и как конкретно работает volatile) и вообще никак на фрэймворки. В большинстве случаем, тому, что написано в резюме про фреймворки буквально верят на слово. Работал с AWS? Работал! Все, вопросов нет, переходим к следующей теме. (но только не стоит уж совсем придумывать, т.к. \"в большинстве случаев\" — не значит во всех)Ну и заключительное, не думай, что боги горшки обжигают. Скиллов на уровне синьера, который в душе считает себя мидлом, но никому не рассказывает - вполне достаточно чтобы как минимум не быть отсеянным на первых этапах. А там и сам будешь понимать что к чему.Софт скиллыЯ бы сказал, что это самое сложное, как ни странно. Софт скиллы для нас — это не разговаривать матом на собесе. Для них — это чуть ли не важнее чем хард скиллы.С одной стороны, тут велико влияние случая, потому что тут важно чтобы случилось именно совпадение тебя с командой, а не наличие каких-то конкретных критериев. Замкнутые, не общительные люди там тоже есть, и они вполне себе работают тим лидами и ищут себе таких же замкнутых и необщительных разрабов в команду. Излучать позитив на собесе с такими лидами — это прямая дорога получить отказ по софт скиллам.Но все же, если целиться примерно в \"норму\" - я посоветовал бы учиться улыбаться. На первых порах, улыбаться час — это просто физически больно, мышцы лица не привыкли это делать. Я не шучу сейчас. Конечно, не стоит сидеть с голливудской улыбкой весь час, но я бы сказал, что 80% времени должна быть сдержанная улыбка (а-ля приветливое лицо), еще 10% - улыбка до ушей, еще 10% - выражение \"как обычно\" (естественно, проценты приведены просто для ориентира)Есть у софт-скиллов и формальная сторона. Иногда, не часто, но иногда, они проводят так называемое behavioral interview. Это может быть отдельное интервью или некоторые вопросы на интервью с менеджером. Задают вопросы типа \"Что вы будете делать если заметите, что у вашего коллеги производительность упала вдвое?\". Перед этим вам расскажут что на эти вопросы нет правильных ответов и вы должны отвечать что думаете и не пытаться выдать правильный ответ, но я на 90% уверен, что ответы просто буквально сверяются с табличкой правильных ответов как на тех.интервью. Не стоит наверно говорить, что ответ \"Чо я стукач чтоли?!\" не то, что от вас ожидают услышать. Стоит посмотреть пару видосов на эту тему и понять общую логику того, как надо отвечать.Подготовка к конкретному интервьюЭтот параграф опять будет состоять из советов, которые раньше где-то были, но я забивал на это, жалею и хочу донести важность этого момента: будь готов к интервью. Выдели 15-20 минут как следует прочитать вакансию, посмотри на сайт компании. Если это новая локация - выдели еще полчаса на то, чтобы узнать о локации, оценить рынок труда и недвижимости, климат и систему школьного образования (если это важно). Сформируй какие-то вопросы. Возможно, это будут вопросы, ответы на которые можно найти в интернете, но это должны быть вопросы показывающие, что ты:а) в темеб) заинтересованУсловно, \"расскажите мне насколько холодно в Швеции зимой\" - вопрос на вылет. Но \"Сильно ли климат Гётеборга отличается от климата Копенгагена\" - показывает что ты понимаешь географию региона, интересуешься нюансами областей и в реальности рассматриваешь для себя этот регион. Также, кстати, могут спросить почему ты хочешь жить в Швеции - надо бы ответить, что-нибудь типа того как ты впечатлен культурой северной Европы, экономическим лидерством Швеции в ней и вообще Frozen - любимый мультик твоей дочери. Ответ \"да мне уже все равно куда\" - на вылет.Еще стоит внимательно относиться к нетехническим деталям в вакансии (и этот совет я много раз читал на Хабре и много раз на него плевал, о чем сейчас очень жалею): если они разрабатывают систему для склада - обязательно найди в своем резюме то место работы где ты разрабатывал алгоритм дефрагментации склада и когда тебя попросят рассказать о своем опыте, начни со слов \"Прежде всего я хочу сказать что уже имел аналогичный опыт, меня очень заинтересовала специфика складской работы и я хотел бы работать с новыми задачами в этой сфере\". Да, мы так не говорим. Да, по-русски \"Прежде всего я бы хотел сказать...\" звучит чуть ли не как выступление на XX пленуме ЦК КПСС, но для них — это не перебор и не попытка понравиться, а прям нормальная практика. Прими это, не ходи в их собеседования со своими представлениями о прекрасном.Как-то раз я был настолько \"хорошо\" готов к интервью, что даже не удосужился узнать валюту в которой живет страна и на вопрос об ожидаемой зарплате в Швеции сказал что-то типа \"ХХ тысяч Евро в год\". А в Швеции мало того, что никакое не Евро, так еще и принято оперировать суммами в месяц. Стоит ли говорить, куда меня послали?..БонусВ качестве бонуса будет еще один совет, которые не подходит ни к одному из предыдущих пунктов и курьезные случаи с интервью.Совет: не обходи стороной рекрутинговые агентства. Вероятно, у тебя может быть сформировано мнение что сторонний рекрутер - это человек, который мешает добиваться тех результатов, которых легко можно добиться без него. Как минимум на западном рынке это не так. Я не знаю как они это делают, но я не раз наблюдал, как с помощью рекрутера я пролезал на тех.интервью на ту вакансию, на которую безрезультатно отправлял резюме напрямую. Если с тобой хочет работать частный рекрутер или агентство - скажи ему спасибо и делай все что в твоих силах чтобы его не разочаровать.Ну на десерт курьезные случаи с интервью:Как-то раз меня уже почти брали в один из крупнейших европейских интернет-магазинов, но чувствовалось, что есть какие-то сомнения. Развеять их решили 4-х (четырех) часовым интервью. Это была такая карусель менеджеров разных направлений которые сменяя друг друга по кругу дрючили меня всем начиная от архитектуры, заканчивая теми самыми behavioral questions. Не взяли. Хотя я уже всерьез \"сидел на чемоданах\" (Еще раз в качестве финального этапа попросили подготовить презентацию/рассказ о любой технологии на мой выбор. Я им рассказывал про 1С. Это был рискованный шаг, но я исходил из того, что у них нет того негатива к 1С, который есть в СНГ и из того что эту штуку то они точно не видели. Это, кстати, сработало, им она понравилась, сказали похожа на MS Access. (специально для них, я включил английский интерфейс у 1Са, чего раньше никогда не делал. Часто приходится слышать, что когда делали 1С - они бейсик перевели переводчиком на русский. Так вот у меня такое ощущение, что когда делали английскую версию - они вместо того, чтобы взять оригинал, еще раз прогнали его через переводчик в обратную сторону)Еще одна контора, крупнейший автопроизводитель, отличилась адекватностью. Попросили контакты людей, которые могут дать обратную связь о работе со мной: одного менеджера и одного коллеги. С коллегой проблем не возникло, а менеджера пришлось просить с текущего места, т.к. никакие другие не были в состоянии говорить по-английски. Ну т.е. представляете, да? Я подхожу к своему начальнику, говорю, мол, начальник, я тут пытаюсь свалить и из конторы, и из страны, помоги пожалуйста. В итоге не позвонили ни одному ни другому, а мне ответили, что решили продолжать с другими кандидатами. Кстати, это был единственный раз, когда кто-либо попробовал получить референс кол.P.S. Перечитав весь этот текст, я боюсь, что насыпал такую кучу сложностей, что после этого никто не захочет даже начинать. Не бойся. Один год и сто собеседований назад я ничего этого не знал и даже толком не верил, что у меня получится. У меня нет каких-то суперталантов или сверх способностей. Я просто раз в неделю брал ЛинкедИн и рассылал резюме. Да, подготовиться было бы неплохо, но на самом деле есть только три вещи которые нужно делать чтобы достичь успеха — это пытаться, пытаться и еще раз пытаться. Периодически рассылать резюме, каждый день поддерживать коммуникацию, встречаться, общаться, просить обратную связь, исправлять свои косяки и опять по кругу. Это не получится за месяц, но рано или поздно ты научишься как надо и у тебя выйдет тот самый успешный Application. Не опускай руки. Сейчас это важно, как никогда. "
]