[
   "Как изменить мир, управляя данными. Традиционные хранилища, Data Lake или Data Mesh: в чем разница?",
   "МЕРОПРИЯТИЕ ПЕРЕНОСИТСЯ С 2 МАРТА 2022 ГОДА НА БОЛЕЕ ПОЗДНИЙ СРОК. О ТОЧНОЙ ДАТЕ ПРОВЕДЕНИЯ МЕРОПРИЯТИЯ БУДЕТ ОБЪЯВЛЕНО ДОПОЛНИТЕЛЬНО.__________________________________Кто владеет информацией — тот владеет миром. Понимая это, прогрессивные компании одержимы идеей монетизации больших данных, искусственного интеллекта и машинного обучения. Извлекать максимальную выгоду им помогает правильный процесс сбора, хранения и использования данных, высокая скорость формирования отчетов для поддержки принятия решений.Все это обеспечивает «традиционный» подход, который попробовали и внедрили почти все. Набили шишки, выявили недостатки. В мире за последние несколько лет появились новые концепции: Lake House, Data Lake, Data Mesh. Что же выбрать, чтобы поймать тренды и ускорить рост бизнеса? Стоит ли нырять в омут с головой и внедрять их в своей компании? В формате круглого стола на эти вопросы ответят эксперты Oracle и «Инфосистемы Джет». Они также объяснят, как работают разные подходы, какие у них возможности и ограничения.В программе:Что такое Data Mesh и почему он становится популярным?Почему современные озера данных являются предшественниками перехода платформ данных к концепции Data Mesh?Какие проблемы решают концепции Data Lake и Data Mesh, их основные возможности и ограничения.Отличия Data Mesh от предыдущих поколений платформ хранения данных.Какие новые возможности предоставляет концепция Data Mesh?Кому будет интересно мероприятие?Вебинар будет полезен представителям компаний, претерпевающих цифровую трансформацию и принимающим решения на основе данных:Директорам по данным (СDO)Директорам по инновациям (CIO/CINO), директорам по цифровой трансформации (CDTO)Директорам по информационным технологиям (CIO), директорам по цифровым технологиям (CDO)Корпоративным архитекторамМодератор:Александр Непомнящий, менеджер по работе с партнерами, ОracleСпикеры:Дмитрий Кулагин, директор центра управления данными, «Инфосистемы Джет»Андрей Пивоваров, руководитель отдела технологической архитектуры, OracleДарья Алешкова, менеджер по развитию бизнеса, OracleСергей Томин, ведущий консультант по продуктам интеграции данных, OracleРегистрация по ссылке "
]