[
   "Как мы запускали 1С-Битрикс в Windows Azure",
   "Чаще всего мы, рассматривая платформу «1С-Битрикс» как профессиональную систему управления веб-проектами, в качестве критерия выбора определяем для себя несколько критических опций. Одни из таких — надежный и масштабируемый хостинг.\n\r\nМы рассмотрим возможность хостинга платформы «1С-Битрикс» на базе Microsoft Windows Azure. Сразу надо отметить, что вопросы архитектуры для высоконагруженных проектов в данной статье не рассматриваются. \n\r\nПубликация пригодится тем, кто хочет попробовать Windows Azure для тестирования работы платформы «1С-Битрикс» в целях разработки, предоставления сервиса или переноса существующих ресурсов. \n\r\nСегодня большинство сервис-провайдеров предлагает множество услуг, в том числе хостинг «1С-Битрикс»: виртуальный (shared) хостинг, VPS, виртуальные машины.\n\r\nВозможность «хостить» платформу «1С-Битрикс» на виртуальных машинах Windows Azure не меняет концепцию размещения, но арендующий может масштабировать данную систему как по горизонтали (геораспределенная архитектура), так и по вертикали (выделение ресурсов виртуальной машины, приложению**). Рассмотрим пошагово эти возможности.\n\nШаг 1. Изучение\n\r\n1. Для начала изучите виртуальные машины и другие службы инфраструктуры на платформе Windows Azure (WA). Вам потребуется учетная запись. Приступите к регистрации здесь (при первой вам предоставляется пробный лимит на 6,6 тысяч руб. сроком на один месяц***). Интерфейс консоли управления Azure доступен и на русском. \n \n\r\n2. На имеющихся ресурсах Windows Azure потребуется развернуть «1С-Битрикс». Для этого можно пойти двумя путями:\n\r\na. развернуть чистый образ с предварительно установленной ОС (по выбору — Windows, Unix), а также назначить виртуальной машине соответствующий ресурс в виде ОЗУ, ЦП, хранилища, параметров масштабирования. Затем нужно установить необходимое ПО (см. здесь) и документацию, а также саму платформу. Обычно проблем это не составляет. В итоге мы получим полностью индивидуальную систему, которую сможем собственными руками настроить как угодно.\n\n \n\r\nb. можно воспользоваться готовым образом, сконфигурированным в формате MS Hyper-V (см. здесь). Данная ВМ специально сконфигурирована для быстрого исполнения программных продуктов «1С-Битрикс»: разворачивается за минуты и сразу же готова к работе! На виртуальную машину можно не только установить ознакомительные версии продуктов «1С-Битрикс», но и перенести свои уже готовые проекты. По данным «1С-Битрикс» платформа полностью готова к работе в продакшене — настроена на высокопроизводительную работу, безопасна. В итоге — экономия времени и денег. \n\r\nВыберем для нашего эксперимента готовый образ «Виртуальная машина BitrixVM4.3_100_HyperV с объемом диска 100 Гб в формате MS HyperV (export)» и постараемся перенести его в Windows Azure для запуска своих проектов там.\n\r\n3. Итак, учетная запись WA у нас есть, BitrixVM4.3_100_HyperV скачан, приступаем к подготовке загрузки образа в Azure. \r\nЕсли Вам интересно создание собственного образа и загрузка его в облако, рекомендую статью.\n\nШаг 2. Подготовка. Создание учетной записи хранения в Windows Azure\n\r\n1. Войдите на Windows Azure Management Portal.\n\r\n2. В командой панели нажмите «создать».\n\r\n3. Службы данных хранилище -> нажмите «быстро создать». \n\n\n\r\n4. Заполните URL, расположение и раздел репликация. Кликните «создать ученую запись хранения».\n\n\n\r\nДля справки:\n\r\n — Учетная запись хранения предоставляет доступ к службам хранения Windows Azure. Она представляет собой самый высокий уровень пространства имен для всех компонентов службы хранения Windows Azure: BLOB-объектов, служб очередей и служб таблиц.\n\r\n — URL – поддомен для учетной записи хранения. Имя должно содержать от 3 до 24 латинских букв и цифр. В будущем это будет имя вашего хоста.\n\r\n — Расположение – размещение ваших ресурсов в ЦОД конкретной зоны.\n\r\n — Репликация – выбор необходимой для вас защиты данных за счет хранения копии в локальном хранилище (или в любом другом месте).\n\r\n5. В итоге мы получаем «ученую запись хранения», которая пригодится позже.\n\n\n\nШаг 3. Подключение к Windows Azure для загрузки образа\n\r\nПрежде чем подключиться к «облаку», необходимо создать защищенное подключение между вашим компьютером и WA с действующей подпиской.\n\r\n1. Загрузите и установите Windows Azure SDK, убедитесь, что Windows Azure PowerShell был установлен.\n\r\n2. Запустите на своем ПК Windows Azure PowerShell и введите Get-AzurePublishSettingsFile. Откроется браузер и загрузится .publishsettings файл, содержащий необходимые данные о вашей подписке Windows Azure. Сохраните его.\n\r\n3. В окне WA PowerShell введите: Import-AzurePublishSettingsFile .\r\n — полный путь где лежит ваш .publishsettings файл.\n\nШаг 4. Загрузка VHD образа\n\r\nЗагружая ваш образ с «1С-Битрикс» следует использовать URL, полученный при создании учетной записи хранения.\n\r\n1. Запускаем Windows Azure PowerShell и вводим команду:\nAdd-AzureVhd — LocalFilePath X:\\VM\\BitrixVM4.3_100.vhd — Destination mrlemeshko.blob.core.windows.net.\n\r\n2. Жмем «Enter» и видим следующее: осуществляется проверка контрольной суммы образа, после чего происходит выгрузка на хранилище в Azure. (Заметка: в конце URL я добавил информацию о том, что нужно создать новый vhd в Azure /root/storage.vhd).\n\n\n\nШаг 5. Создание вашего образа с «1С-Битрикс»\n\r\n1. На портале в разделе «Виртуальные машины» перейдите в меню «Образы» и щелкните «создать».\n\r\n2. Выберите «создать из образа», который вы только что загрузили.\n\n\n\r\n3. Поставьте галочку и кликните «ОК».\n\r\nПосле создания образа вы можете использовать вашу виртуальную машину с «1С-Битрикс» по усмотрению.\n\r\nМою тестовую виртуальную машину «1С-Битрикс» в Widows Azure можно посмотреть ЗДЕСЬ.\n\r\nЦель, которую мы с Вами поставили вначале статьи — возможность хостинга платформы «1С-Битрикс» на базе Microsoft Windows Azure — достигнута. Данный материал, конечно, не step-by-step и, возможно, на пути загрузки образа в «облако» у вас возникнут проблемы, поэтому рекомендую изучить ссылки ниже или обратиться ко мне в комментариях, в том числе в FB.\n\r\nБлагодарю за интерес, проявленный к статье.\r\nМаксим Лемешко, \r\ncпециалист департамента облачных технологий компании Softline \n\r\nПримечания:\r\n * — масштабирование за счет использования нескольких экземпляров виртуальных машин, а также использования групп доступности.\r\n** — 8 ЦП по 1,6 ГГц, 56 ГБ ОЗУ, 2040 ГБ в хранилище на одну виртуальную машину. В скором времени клиенты Windows Azure смогут получить в свое распоряжение две новые конфигурации экземпляров и виртуальных машин: 8 ядер с 60 Гб памяти и 16 ядер со 120 Гб памяти.\r\n*** — чтобы избежать неконтролируемых расходов, закажите в своем банке услугу виртуальной карты и проведите регистрацию вашей учетной записи с привязкой к карте. При регистрации с нее спишут 1$. \r\nКод платежа ******** IE MSFT ONLINE…\n\r\nСсылки.\r\n1. msdn.microsoft.com/ru-ru/library/windowsazure/dd163896.aspx\r\n2. technet.microsoft.com/ru-ru/cloud/dn248258.aspx\r\n3. www.cloudtec.ch/blog/tech/upload-vhd-to-azure.html\r\n4. www.mctrewards.ru/vhd.htm\r\n5. www.windowsazure.com/en-us/documentation/articles/virtual-machines-create-upload-vhd-windows-server/?fb=ru-ru\r\n6. ru.intel.com/business/community/?automodule=blog&blogid=43308&showentry=4527\r\n7. www.gotdotnet.ru/blogs/cloudtech "
]