[
   "Как я заработал 1 миллион рублей в Marketplace 1С-Битрикс",
   "Прошедшая неделя была замечательна тем, что на мой счет в Marketplace 1С-Битрикс упал миллионный рубль! Таким образом, я заработал на тиражировании своих решений 1 000 000 рублей всего чуть больше чем за 1 год.\n\n\n\r\nЯ очень рад этому факту и решил поделиться этим своим успехом с профессиональным сообществом в данной статье. И я хочу привлечь внимание отцов к этому новому замечательному направлению.\n\r\nВ статье я дам максимум личного опыта и рекомендаций + немного истории развития направления.\n\nКак все заварилось\n\r\nЕще недавно, я в основном занимался продажей своих часов по аутсорсингу столичным студиям и разработкой сайтов на заказ. Но, оба направления имели ряд существенных для меня минусов:\n\r\nЗанимаясь аутсорсингом, даже если ваш левел растет и растет стоимость часа, рано или поздно вы приходите к тому, что после сдачи очередного проекта у вас ничего не остается – нет никаких активов кроме опыта. Кроме того, в нашем деле нужно постоянно учиться, а времени на это катастрофически не хватает – Заказчики мало желают оплачивать нашу прокачку. Деньги поступают только когда вы кодите, а когда вы не кодите – деньги соответственно не поступают. А прежде чем кодить нужно уметь свой час дорого продать. Ну и тысячи других проблем, о которых вы знаете. Привлечение наемной рабочей силы мало их решает + добавляет новые. Например, работник при всем желании не выработает более чем 132 часов в месяц, есть ограничения по стоимости часа – то есть всегда есть определенный потолок в доходах. А с уходом работника вы теряете все его знания и опыт, утрачиваете важные компетенции – что и является по сути единственным активом компании. Отцы, не хочу никого убеждать, но мое мнение аутсорсинг – не самый лучший бизнес…\n\r\nС разработкой сайтов – все еще хуже. Рынок перенасыщен. Демпинг огромный. Каждый новый проект приходится начинать все с начала. Опять консалтинг, опять объясняете, что логотип лучше нарисовать слева (я утрирую) и тд Развиваете какой-нибудь интернет-проект годами, и вот только-только вылечиваете почти всех тараканов в голове заказчика и доводите сайт до приличного уровня когда наконец можно начать делать что-то действительно интересное и нетривиальное и тут бац – бизнес у заказчика не пошел, или бизнес пошёл, но заказчик достиг зоны своего комфорта и развиваться дальше не хочет, или на реализацию ваших фич пока нет бюджета. Делаете шаг назад и начинаете все сначала – новый заказчик, опять хочет логотип справа итд итп День сурка… Понятно, что все это не столько проблемы сколько задачи, которые решаются и многие отлично и с удовольствием работают на этом рынке, и все же…\n\r\nПо этим причинам я постоянно думал о каком-то тиражировании своего опыта, может быть создании собственного проекта. Желательно без оффлайновых отделов продаж и маркетинга. Оглянувшись вокруг, мы видим, что основных тренда для реализации подобного сегодня два – это Marketplace (AppStore, GooglePlay итп) и SaaS. И если второе требует серьезных вложений и супер-идеи, то первое реализуется достаточно легко и с минимумом затрат. Ведь, очень многое берет на себя Большой брат — Вендор: создает всю инфраструктуру и экосистему, придумывает общие для всех правила игры, занимается маркетингом, разрабатывает фреймворк, а нам остается только генерировать идеи и воплощать их в жизнь. \n\r\nЕще 3 года назад я начал продавать первые свои поделки-компоненты прямо на форуме битрикса. И я помню, что меня тут же закидали помидорами… Возник целый спор о допустимости продажи своих решений собратьям разработчикам, о вопросах качества, о безопасности, а так же – «а зачем это все надо?» Но, я проявил настойчивость и создал отдельную группу в блогах. Я назвал ее – “Рынок” и начал выкладывать там свои разработки, а также предоставил такую возможность другим разработчикам.\n\r\nПостепенно количество решений в группе перевалило за несколько десятков. Стали появляться отдельные сайты с коллекциями модулей. Потребность и инициатива были замечены и 1С-Битрикс создал на своем сайте отдельный раздел, в котором можно было выложить свой модуль. Продажа и отгрузка производились партнером-разработчиком в ручном режиме.\n\r\nАвтоматизированный процессинговый центр приема платежей был запущен позже, всего год назад – в августе 2011г. С того же дня на сайте ведется статистика продаж, скриншот из которой я и опубликовал в начале статьи.\n\nОсновные плюсы, которые я вижу в Маркетплейс\n\r\n1. Возможность самореализации. Вы делаете то, что вам хочется, и сами решаете как. При этом, если вы сделали что-то по душе то, велика вероятность того что еще кому-то (из более чем 50000 владельцев сайтов на CMS 1С-Битрикс) это понравится.\r\n2. Пассивный доход. Вы можете приостановить производство на какое-то время: спокойно изучить новую технологию, сменить разработчиков, да в тот же отпуск сходить. Даже если вы на какое-то время сделаете это – продажи все равно будут продолжаться. И это даёт определенное спокойствие и уверенность в завтрашнем дне.\r\n3. Накопление активов. Работники приходят и уходят, а модули у вас остаются, продаются, их количество и оборот с продаж растут.\r\n4. Продажа товара, а не услуг. Об этом можно говорить очень долго. Разница колоссальная!\r\nНапример, вы не так зависимы от конкретного клиента когда их не десятки, а тысячи…\r\n5. Маркетинговая и технологическая поддержка Большого брата. Например, в 20:00 по Красноярску я сижу в клубе и потягиваю коктейль, а в этот самый момент в Москве проходит семинар, на котором, в том числе, рекламируют мои модули. Ну разве это не здорово?\r\n6. Опыт разработки, продвижения и продаж собственного ПО. Это уникальная возможность попробовать при минимуме затрат. Грех не воспользоваться!\r\n7. Профессиональный рост разработчиков. Производя собственные модули разработчикам приходится разрабатывать архитектуру программы, писать собственные классы, запросы к БД и прочее, чем занимаются взрослые программисты. Рост идет значительно более интенсивно чем при простом натягивании шаблонов дизайна на CMS.\n\r\nСобственно опыт…\n\nОдин из первых разработанных мною модулей – Киоск\n\n\r\nК нам в региональное интернет-агентство “Енисайт” часто обращались заказчики, которые хотели интернет-магазин, но для которых стоимость редакции Малый бизнес (24900р.) была слишком велика, а ее функционал избыточен. Они не собирались открывать эльдорадо.ру, они хотели просто попробовать что это такое он-лайн торговля. Одному такому клиенту я за вечер написал простейшую он-лайн корзину. И я увидел, что в линейке редакций 1С-Битрикс остро не хватает вот такой редакции — и-м для начинающих. Потратив еще один вечер и упаковав решение в готовый модуль, я начал продавать, его в тогда еще группе “Рынок”. Цену назначил такую, чтобы даже учитывая партнерскую скидку на Малый бизнес, цена на Киоск + редакция Старт оставалась заманчивой.\r\nМодуль купили более чем 100 раз, а я заработал более 300 000 рублей…\r\nВот за это, кстати, я и люблю Маркетплейс – в нем есть элемент удачи. Азарт как в казино. Модуль может не продастся ни разу, он может продаться всего несколько раз, едва окупив свою разработку, а может фортануть и модуль продастся сотни раз! Сразу этого никто никогда не знает! \n\r\nК сожалению, модуль Киоск, сейчас, уже так не качает – появилось много клонов и подражателей… Хотя я его и прилично наворотил его с тех пор… Наверное после этой статьи появится еще парочка клонов – вот так подражатели, в следующий раз будите знать как копировать за мной!\n\r\nИ сразу несколько рекомендаций:\r\n1. Если у вас веб-студия, то обратная связь от ваших клиентов – это ваш самый ценный актив. Вендор видя продажи через партнерскую сеть, часто такой обратной связи не имеет. Это вы находитесь на передовой, на линии фронта и это вы лучше всех знаете ЧТО нужно заказчикам.\r\n2. Можно запросто тиражировать свои решения выполненные для конкретного заказчика. В данном случае вы даже ничем не рискуете, так как разработка модуля уже оплачена вашим заказчиком. Вы можете просто получить дополнительный доход с его последующей продажи, как бонус. \r\n3. Расширить функциональность начальных редакций — отличная идея. Но, учитывайте, что чем сложнее функционал тем больше нагрузка на вашу техническую поддержку. \n\nВторой модуль, о котором я хочу рассказать – Ресайзер\n\n\r\nУжасно, но в 1С-Битрикс ранее не было штатного механизма автоматического ресайза фотографий для свойства типа «Файл», с помощью которого реализовался например функционал дополнительных фотографий на детальной странице товара. Из проекта в проект разработчики таскали за собой свои «костыли» и я с 2005 года устал просить на форумах добавить эту возможность в коробку стандартно. Просил, просил… а потом просить надоело, и я потратил пару-тройку дней уже штатного программиста на то чтобы запаковать свои «костыли» в модуль и выставить его на продажу.\r\nЦену сделал такой, что бы было выгоднее купить модуль, чем оплачивать фрилансеру 2-4 часа за внедрение какого-нибудь fancybox.\r\nМодуль продался более 300 раз, а я заработал более 200 000 рублей.\r\nПозже многое по ресайзу появилось в Битрикс из коробки и появляется до сих пор… Смешно, но теперь я уже против того что бы этот функционал развивался в 1С-Битрикс штатно и больше об этом их на форумах не прошу…\n\r\nРекомендация:\r\n1. Если вы видите, что в 1С-Битрикс чего-то не хватает, не спешите критиковать систему и требовать этот функционал на форумах. Сделайте модуль и выложите его на продажу – вполне возможно, что вам удастся неплохо заработать на этом.\r\n2. Будьте готовы к тому, что рано или поздно этот функционал все таки будет реализован в коробке. По этому «вкладываться» нужно осторожно.\r\n3. Принимайте активное участие в жизни блогосферы платформы, очень много отличных идей и потребностей клиентов можно почерпнуть именно из клиентских и гостевых форумов, а так же блогах прямо на сайте 1С-Битрикс. И конечно самый ценный ресурс это – idea.1c-bitrix.ru \n\nТретий модуль, о котором я хочу рассказать – Мигратор\n\n\r\nЯ целенаправленно изучал модули других CMS и искал что-нибудь такое, чего в 1С-Битрикс пока еще нет. Задача я вам скажу довольно сложная – ведь в Битрикс есть уже почти все. И все же я нашёл пару-тройку таких идей… Одна из них вылилась в разработку модуля Мигратор. Модуль бесплатный и является локомотивом продажи наших услуг по переводу сайта с других движков включая самописные на платформу 1С-Битрикс. Наше агентство оказала очень много подобных услуг и является в этом вопросе экспертом.\n\r\nРекомендация:\r\n1. Зарабатывать можно и на бесплатных модулях.\n\nГде еще взять идеи для модулей?\r\nНастоящая золотая жила сегодня, это типовые решения. Бизнес-логика очень простая. Например, можно за пол года сделать сайт на заказ за 300000 рублей как хочет Заказчик. А можно сделать это же сайт, но как хотите его сделать вы, затем выложить его в MP за 30000р. и продать в течении полугода 10 раз. А потом еще 10 раз… и еще 10 раз…\r\nИ тут еще не паханное поле, например:\r\nтиповой городской портал (на начало 2009 года в России насчитывалось 1099 городов и 1318 поселков городского типа),\r\nтиповой сайт телерадиокомпании,\r\nтиповой новостной сайт,\r\nтиповой аукцион,\r\nтиповой сайт продажи купонов,\r\nтиповой сайт доски объявлений,\r\nпортал по продаже/аренде недвижимости,\r\nтиповой сайт знакомств,\r\nтиповая соцсеть,\r\nтиповой сайт газеты/журнала,\r\nтиповой сайт блоговой-системы,\r\nтиповой сайт фотогалереи, фото-стока,\r\nтиповой развлекательный портал,\r\nтиповой файлообменный сервис,\r\nтиповой торент-портал,\r\nтиповой видео-сервис,\r\nтиповой видео-чат,\r\nтиповой портал по трудоустройству,\r\nтиповой сайт афиши,\r\nтиповая электронная библиотека,\r\nтиповой сайт по продаже подержанных автомобилей\r\nитд итп\r\nничего же совсем еще нет, по большому счету, кроме и-м`ов… Если у вас уже есть наработки в какой-то тематике – приходите с ними в Marketplace и сделайте свой миллион!\n\r\nВот такой мой опыт…\r\nПонятно, что всех нюансов я сейчас не рассказываю, а дьявол именно в мелочах… Хотите знать больше – читайте мой блог на сайте 1С-Битрикс в разделе разработчиков.\n\r\nВ общем Маркетплейс сегодня – это отличное новое направление для веб-студий.\r\nРазрабатывать модули весело и интересно! Сообщество принимает активное участие в развитии экосистемы. Все решения предварительно обсуждаются коллективно и благодаря этому в Маркетаплейс 1С-Битрикс присутствует дух свободы!\n\r\nPS: Кстати, набираем молодых бойцов в команду Енисайт! "
]