[
   "Как E Ink Corporation разработала полноцветную электронную бумагу",
   "Путь к созданию цветной электронной бумаги занял два десятилетия\n\n\r\nШёл октябрь 2008 года, и скоро должен был наступить сезон предпраздничных покупок. Опра Уинфри выпустила ожидаемый многими фанатами «список желаний», в разделе «гаджеты» которого на первом месте красовался Amazon Kindle.\n\r\nИменно тогда концепция электронной бумаги вышла в народ.\n\r\nОднако этот чёрно-белый отражающий дисплей, который казался всё время включённым, изобрели задолго до того, как его прославила электронная книга Amazon Kindle. Его история началась за десять лет до этого, в 1997 году, в лаборатории MIT Media Lab. Там его создали двое студентов, Дж. Д. Альберт и Баррет Комиски, которых на это вдохновил профессор Джозеф Джейкобсон.\n\r\nС самого начала электронная бумага казалась чем-то волшебным. Глаза от неё меньше уставали, под открытым небом и даже на ярком солнце она читалась гораздо легче по сравнению с другими гаджетами, дисплеи которых становились нечитаемыми. Её можно было не подзаряжать неделями, в то время как другие гаджеты не могли прожить без зарядки более одного дня (а некоторые и по сей день не могут). Но её ограничения тоже были очевидными – изображения составлялись всего из двух цветов. В мире, где монохромных дисплеев не видели уже давно – телевидение перешло на цвет ещё в 1960-х, компьютерные мониторы в 1980-х – монохромный дисплей был явно чем-то устаревшим.\n\r\nПоэтому с момента разработки первого такого экрана, основы технологии изготовления которого известны, и тем более с появления Kindle встал вопрос: когда мы сможем увидеть эти волшебные дисплеи в чётком ярком цвете? И люди, конечно, пытались. Исследователи годами стремились к созданию цветной электронной бумаги – как инженеры компании E Ink, так и учёные мировых университетов, частных лабораторий и стартапов. Некоторые из ранних продуктов нашли себя в виде ценников для магазинов и табло в общественных местах. Однако в этих ранних прототипах к чёрному и белому добавлялся обычно только один цвет – жёлтый или красный – и этот вариант никак нельзя было назвать полноцветным дисплеем. И даже спустя десятилетие после выхода первого Kindle и два десятилетия после изобретения, полноцветная электронная бумага всё никак не выйдет на потребительский рынок.\n\r\nПочему электронной бумаге потребовалось так много времени для перехода от чёрно-белого до цветного состояния? За все эти годы исследователи испытали несколько подходов к решению этого вопроса. Кто-то обращался к технологиям традиционных дисплеев, другие пытались развивать уникальную схему оригинальной электронной бумаги. Qualcomm потратила миллиарды долларов на развитие идеи, вдохновлённой строением крыльев бабочки. Путь к успешной реализации идеи цветной электронной бумаги – это классическая, хоть и извилистая история технологического триумфа. И мы, технические директора E Ink, расскажем вам, почему с этим вроде бы простым вызовом мы смогли справиться только два года назад.\n\n\nУ дисплеев Triton и Kaleido от E Ink цветные фильтры превращали свет, отражённый от белых частиц, в красный, зелёный и синий субпиксели. Однако подобный подход уменьшал разрешение и яркость, ограничивая популярность технологии первого поколения.\n\r\nСегодня потребители уже могут подержать в руках полноцветную ePaper E Ink – в виде электронных книг, смартфонов, устройств для записи. Их производит полдесятка компаний. Сюда входят Guoyue Smartbook V5 Color, HiSense A5C Color Smartphone, Onyx Boox Poke 2 Color и PocketBook Color. Анонсирован только один новый продукт с таким экраном — DES (Display Electronic Slurry) китайской компании Dalian Good Display. На сегодня ещё ни одного устройства DES не было отправлено покупателям, хотя несколько журналистов уже получили пробные экземпляры, и запустилась пара кампаний на Kickstarter с продуктами, поддерживающими эту технологию.\n\r\nТрудности реализации цветного дисплея связаны с самой природой данной технологии. Чёрно-белые электронные чернила – это простая связка химии, физики и электроники, которая работает почти так же, как обычные чернила на бумаге. Вариант дисплея от E Ink сделан из микрокапсул с отрицательно заряженными чёрными частицами и положительно заряженными белыми, плавающими в прозрачной жидкости. Аналогичные пигменты используются в современной печати. Ширина каждой микрокапсулы сравнима с толщиной человеческого волоса.\n\r\nЧтобы изготовить наш экран, сначала мы производим партию таких электронных чернил, а потом покрываем ими пластиковую подложку толщиной от 25 до 100 мкм – в зависимости от типа конечного продукта. Затем мы режем рулоны плёнки на нужные размеры и добавляем тонкоплёночные транзисторы, чтобы создать электроды под и над слоем электронных чернил, зажатом между защитными листами. Также по необходимости добавляются сенсорный экран или подсветка.\n\r\nДля формирования изображения устройство с электронными чернилами подаёт разное напряжение на верхний и нижний электроды, что создаёт внутри электрическое поле. Сверх напряжение близко к нулю, а снизу меняется между значениями -15, 0 и 15. Каждый раз, когда надо поменять изображение, на нижний электрод подаётся последовательность из различных напряжений, перемещающая частицы из первоначального положения в другое – так, чтобы показать правильный цвет для нужной картинки. На обновление обычно уходит менее секунды.\n\r\nКогда белые частицы поднимаются к верхней поверхности дисплея, создаётся впечатление «бумаги». Чёрные, поднимаясь, создают иллюзию «чернил». При этом частицам не обязательно находиться в самом верху или в самом низу. Когда мы перестаём подавать на них электрическое поле, частицы замирают на месте. Мы можем создать смесь из чёрных и белых частиц в верхней части экрана, что будет давать эффект оттенков серого.\n\n\nAdvanced Color ePaper (ACEP) от E Ink использует четыре вида пигментных частиц разных размеров и с разным зарядом. Применяя переменные электрические поля, система перемещает частицы на разные места в каждой из трапециевидных микрочашек, и создаёт нужные цвета.\n\r\nПО, определяющее время включения и необходимое напряжение, получилось сложным. Выбор параметров зависит от того, в каком состоянии был каждый из пикселей до этого. Если, к примеру, чёрный пиксель предыдущего изображения останется чёрным в следующем, в это место напряжение подавать не нужно. Переходы между изображениями также приходится тщательно обрабатывать. Нужно, чтобы изображения не задерживались на экране, но и не менялись слишком резко, вызывая мигание. Это лишь малая часть факторов, рассматриваемых при создании алгоритма, т.н. волновой формы, используемой для настройки набора напряжений. Их разработка это и наука и искусство одновременно.\n\r\nПоявление разных цветов заметно усложняет волновые формы. Выбор между чёрным и белым цветами – простая дихотомия, учитывая, что электрическое поле создаёт либо положительные, либо отрицательные заряды. Подобный подход не справится с полноцветной цифровой бумагой. Нам требовалось что-то совершенно новое.\n\r\nИзучать варианты мы стали в начале 2000-х. Один из первых наших коммерческих продуктов, запущенный в 2010-м, использовал цветовые фильтры – сетку из квадратов, напечатанных на стеклянном слое, накладываемом на стандартный чёрно-белый экран. Применяя напряжение для перемещения белых частиц на поверхность в нужном месте, мы добивались того, чтобы отражённый от них свет шёл к наблюдателю через красный, зелёный или синий фильтр. Подход был очевидным – все видимые человеком цвета можно создать из комбинации красного, зелёного и синего цветов. Поэтому большинство современных дисплеев, типа LCD и OLED, используют RGB-эмиттеры или цветовые фильтры.\n\r\nМы назвали наш продукт E Ink Triton. И хотя с поддержкой этой технологии вышел цифровой учебник, главный выученный нами урок заключался в том, что она не подходит для потребительского рынка. Разрешение экрана было слишком маленьким, а цвета – слишком тусклые для людей, привыкших к экранам высокого разрешения на планшетах и к бумажным журналам.\n\r\nПроблемы с яркостью возникли потому, что, в отличие от LCD с фоновой подсветкой и OLED с испускающими свет диодами, дисплеи от E Ink работают только с отражённым светом. Свет от стороннего источника проходит через прозрачное покрытие, встречается с чернильным слоем и отражается обратно, попадая в глаза пользователя. Это прекрасно работает на улице, поскольку яркий свет только усиливает изображение. Также эти дисплеи комфортны для глаз – они не излучают свет в глаза пользователя. Но при такой системе каждый слой между чернилами и глазами поглощает или рассеивает часть света. И оказалось, что если добавить слой светофильтров, итоговая яркость значительно упадёт.\n\n\nУ цветного дисплея Kaleido E Ink была подсветка, а цветные фильтры были расположены в виде последовательностей коротких отрезков с тем, чтобы увеличить яркость, насыщенность цветов и контраст изображения.\n\r\nКроме того, при использовании цветного фильтра для разделения монохромных пикселей на цветные пиксели трёх видов падало разрешение. Изначально разрешение дисплея составляло 300 пикселей на дюйм; добавляя трёхцветный фильтр, мы получаем уже 100 пикселей на дюйм. Для 32-дюймового дисплея, используемого в качестве информационного табло, это не такая уж большая проблема – можно сделать пиксели побольше, а крупным буквам большое разрешение не нужно. Но для мелкого шрифта и штриховых рисунков на носимых устройствах это стало очевидной проблемой.\n\r\nПока одни исследователи в нашей лаборатории разрабатывали этот дисплей с фильтрами, другие занимались альтернативным подходом – мультипигментом, не использовавшим фильтров. Однако этот вариант требует более сложной химии и механики дисплея.\n\r\nМультипигментная электронная бумага фундаментально схожа с монохромными предшественниками. Однако вместо двух типов частиц в ней используется три или четыре – в зависимости от цветов, выбранных для конкретной задачи.\n\r\nНужно было добиться того, чтобы эти частицы по-разному реагировали на электрические поля, а не просто притягивались или отталкивались. Чтобы эти частицы было проще сортировать, мы проделали над ними несколько манипуляций. Мы сделали их разного размера – чем больше частица, тем она в среднем медленнее двигается. Мы придали частицам разные заряды; заряд – величина больше аналоговая, чем цифровая. Можно быть очень сильно положительно заряженным, немного положительно заряженным, сильно отрицательно или немного отрицательно заряженным. И между этими вариантами есть множество градаций.\n\r\nПосле разделения частиц нужно адаптировать к этому волновые формы. Вместо того, чтобы просто отправлять одни частицы наверх, а вторые – вниз, мы одновременно и тянем, и толкаем частицы для формирования изображения. Мы, допустим, можем вывести частицы одного цвета наверх, а потом немного подтянуть вниз, чтобы они смешались с другими частицами и дали определённый оттенок. К примеру, голубой и жёлтый цвета дают зелёный, а белые частицы обеспечивают для них отражающий фон. Чем ближе частицы к поверхности, тем выше насыщенность цвета.\n\r\nТакже мы поменяли форму контейнера со сферической на трапециевидную, что облегчило нам задачу управления вертикальным расположением частиц. Мы назвали такие контейнеры микрочашками.\n\r\nДля системы из частиц трёх цветов, которая сейчас продаётся под маркой E Ink Spectra и используется в основном для электронных ценников, в каждую из чашек мы поместили чёрные, белые частицы, и ещё один цвет – красный, чёрный, белый или жёлтый. В 2021 году мы добавили в эту систему ещё один цвет – новое поколение дисплеев использует чёрные, белые, красные и жёлтые частицы. Система отлично справляется с созданием насыщенных цветных изображений высокого контраста, однако из этих четырёх цветов не получится собрать полноцветные изображения. Впервые мы запустили эту технологию в 2013 году для розничных магазинов. Разные компании производят такие ценники миллионами экземпляров и поставляют их по всему миру в такие розничные сети, как Best Buy, Macy’s и Walmart. С тех пор на рынок вышли похожие китайские дисплеи от компании DKE Co.\n\r\nДля нашей реально полноцветной системы, которую мы назвали Advanced Color ePaper (ACeP), мы тоже используем четыре вида частиц. Мы отказались от чёрного цвета, и полагаемся на белые частицы – бумагу –, а также голубые, фиолетовые и жёлтые (CMY, цвета, используемые в струйных принтерах). Располагая частицы на разной высоте, мы можем создавать до 50 000 различных оттенков. В итоге дисплей способен выдавать картинку, сравнимую с печатными газетами или даже акварелями.\n\n\nPocketBook Inkpad 3 Pro, представленный в 2021 году, использует дисплей E Ink Kaleido Plus второго поколения\n\r\nE Ink выпустила ACeP под маркой E Ink Gallery в 2016. Он опять-таки не годился для пользовательских устройств – из-за малой скорости обновления. Кроме того, поскольку у дисплея не было фоновой подсветки, пользователям, привыкшим к ярким экранам смартфонов и планшетов, его цвета казались слишком приглушёнными. Пока что по большей части эта технология используется в качестве рекламных экранов в странах Азии.\n\r\nНаш отдел исследований и разработки, понимая, что мы всё ещё не дотягиваем до требований рынка к цветным дисплеям, вернулись к системе Triton, использовавшей цветовые фильтры, чтобы бросить на неё свежий взгляд. Что в этом проекте работало хорошо, а что – не очень? Возможно ли как-то модифицировать проект, чтобы выпустить, наконец, цветную читалку, которую потребитель захочет купить?\n\r\nМы понимали, что фильтры приглушают цвета. Мы были уверены, что сможем уменьшить потерю цветов, приблизив фильтры к электронным чернилам.\n\r\nМы также хотели увеличить разрешение дисплеев, для чего нужно было создать цветовой фильтр более высокого разрешения. Чтобы приблизиться к тому разрешению, к которому потребитель уже привык, нужно было ставить целью разместить не менее 200 пикселей на квадратном дюйме. Это почти в два раза больше, чем у дисплеев Triton первого поколения.\n\r\nМожет показаться, что эта задача была более лёгкой, чем разработка чернил с разным уровнем электрического заряда, которую мы провели при создании ACeP. Но в итоге пришлось изобретать новую технологию печати цветных фильтров на стеклянной подложке.\n\r\nПредыдущие фильтры мы делали, печатая на стекле полупрозрачными чернилами красного, зелёного и синего цветов. Однако это стекло представляло собой дополнительный слой. Поэтому мы решили печатать фильтр прямо на пластиковой плёнке, удерживающей верхний электрод, поставив этот этап ближе к концу производственного цикла экранов. В результате фильтры оказываются максимально близко к электронным чернилам. Это также позволяет нам увеличить разрешение, поскольку при такой технологии выровнять фильтры и пиксели дисплея можно гораздо точнее, чем при использовании отдельной поверхности.\n\n\n\n\nПолки магазинов с электронными ценниками на основе технологии E Ink Spectra – первого трёхцветного дисплея от E Ink\n\r\nПодходящий принтер мы нашли у немецкой компании Plastic Logic, партнёрами которой мы были с самых первых дней существования. Однако их принтер был предназначен для использования в исследовательской лаборатории, а не на масштабном производстве. Принципы его действия необходимо было адаптировать для машины иного типа, способной работать на производстве.\n\r\nТакже нам нужно было придумать новые шаблоны цветовых фильтров – то есть, итоговую форму и расположение красного, синего и зелёного цветов. Работая над дисплеем Triton, мы обнаружили, что печать фильтров в виде простых квадратиков – не лучший вариант, поскольку во время переходов между изображениями их узор виден невооружённым глазом. Поэтому мы отправились на поиски наилучшего узора. Мы прошли множество этапов, учитывая угол падения света на дисплей, поскольку от этого может меняться цветовое восприятие. Мы рассмотрели решётку, прямые линии, длинные линии, иные варианты узоров – и остановились на коротких линиях.\n\r\nПоскольку наш дисплей отражающий, то чем больше света на него падает, тем он будет ярче. Команда решила добавить подсветку дисплея, которой не было у Triton, приложив все усилия, чтобы лучи света падали на слой чернил под углом, обеспечивающим максимальное отражение. Подсветка, конечно, увеличивает энергопотребление, но в данном случае это того стоит.\n\r\nВ итоге у новой технологии E Ink Kaleido цвета получились более насыщенными, а контраст – более высоким, чем у E Ink Triton. И вот, наконец, полноцветный дисплей на основе электронных чернил был готов к использованию в потребительской электронике.\n\r\nПервая официальная партия дисплеев Kaleido вышла из производственного цеха в конце 2019 года. Вскоре мы начали отгружать дисплеи нашим партнёрам, и теперь уже можно видеть нашу технологию в таких выпушенных в 2020 году продуктах, как Hisense A5C, iFlytek Book C1 и PocketBook Color. В начале 2021 года мы запустили поставки второго поколения этого дисплея, Kaleido Plus. Продукты с ним выпустили такие компании, как Onyx и PocketBook. Другие компании вскоре планируют присоединиться к этим. В новом продукте увеличена насыщенность цветов благодаря слегка изменённому узору фильтра и световым направляющим для подсветки.\n\n\nПри производстве электронных чернил микрокапсулы наносят на пластиковую плёнку. Плёнку затем высушивают, проверяют, перезакатывают и отправляют на дальнейшую обработку.\n\r\nУ нас ещё есть, над чем работать. Световая эффективность – процент приходящего света, отражающийся и попадающий в глаза пользователя – уже неплохой, но его ещё можно увеличить. Мы продолжаем работать над плёнками, чтобы уменьшить его потери.\n\r\nМы увеличиваем разрешение не только улучшая узор печати, но и уплотняя электронные контуры, находящиеся под слоем электронных чернил, которые используют разные уровни напряжения для управления цветными заряженными частицами.\n\r\nМы продолжаем работу и над мультипигментной технологией электронных чернил без фильтра. Вскоре мы планируем выпустить новое поколение таких дисплеев, пригодных для использования в качестве уличных табло. Цвета в них будут ярче, а скорость обновления изображений – выше. Когда-нибудь, возможно, мы сможем использовать такие дисплеи и в потребительских устройствах.\n\r\nКогда в начале 2000-х исследователи из E Ink отправились на разработку технологии цветных электронных чернил, они считали, что для достижения отличных результатов им хватит несколько лет – учитывая весь предыдущий опыт компании в этой области. Ведь на разработку чёрно-белой технологии электронных чернил ушло всего 10 лет – от концепции до коммерческой реализации. Но дорога к полноцветным экранам оказалась куда как более длинной. Но, как и Дороти из «Волшебника из страны ОЗ», мы всё же сумели перепрыгнуть радугу. "
]