[
   "Как айтишнику получить визу зарубеж на основании удаленной работы в 2022 году",
   "В течение всего прошлого года я искал информацию о разных визах для цифровых кочевников. Пандемия бушевала, страны закрывались для туризма, но как на дрожжах появлялись визы для удаленщиков. Хотелось на всякий случай иметь интересные варианты под рукой, поэтому я сохранял наиболее привлекательные программы в отдельный список вместе со всеми требованиями. Кажется сейчас самый подходящий момент, чтобы поделиться этой подборкой. Ниже представлены требования к оформлению виз для цифровых кочевников в разных странах и ссылками на подачу заявлений.ЭстонияПочему Эстония вообще может быть интересна? Вроде бы и Европа, а вроде бы и ничего особенного в плане туризма. Например, первый же загугленный список # вещей, которые нужно сделать в Эстонии, выглядит уж очень притянутым за уши.Тем не менее Эстония одна из передовых стран в ЕС в плане цифровизации общества. У них уже давно все бюрократические вопросы решаются онлайн, а проголосовать за президента можно, не выходя из дома.И тут для номада Эстония предоставляет две опции:1. Если хочешь пожить в Эстонии, потусить там годик-два, потратить свои кровные — велком в программу Digital Nomad Visa.По требованиям нужно лишь иметь работу вне Эстонии, правда заработок должен быть около 3500€ до вычета налогов. Также оплатить сборы 80-100€, пройти интервью и в течение 30 дней получить ответ.Надо понимать, что эта виза не вид на жительство, а лишь право на временное (продолжительное) пребывание в Эстонии — то есть по ЕС не поездить.2. Если в целом Эстония тебе не сдалась, но тебя привлекает открытие бизнеса в ЕС онлайн, без всякой бумажной волокиты, то тебе нужна E-Residency.Став е-резидентом Эстонии, ты как бы становишься резидентом их онлайн пространства. Ты можешь открыть компанию, банковский счет, проводить платежи, декларировать налоги и пр., не находясь физически в Эстонии.Чтобы податься на E-residency нужныПаспортМотивационное письмоПара фотокКарта Visa или MastercardОплата взноса в размере 100-120€.Это всё конечно круто, но в плане перемещений этот статус не добавляет никаких бонусов — ты даже не можешь заехать в Эстонию с этой карточкой. Но открыть компанию в ЕС, сидя на горшке, звучит заманчиво! Дальше только остается понять — зачем.МексикаИтак, Мексика и диджитал номады. Мексике ведь тоже нужно как-то привлекать деньги в страну, тем более оттуда все уезжают на заработки в Америку.Но если вы работаете удаленно, зарабатываете не менее 1700$ или имеете на счету больше 27000$, то вам открывается возможность получить Temporary Resident Visa и ловить латинский вайб 4 года подряд!Да, россияне могут приезжать в Мексику по турвизе (или оформив электронное разрешение) на полгода и продлевать пребывание, делая визаран. И это логично: сначала приехать на разведку, сильно не заморачиваясь с документами, осмотреться и принять решение.А вот когда у вас появится желание обосноваться в Мексике надолго (например, чтобы сделать её своей базой и постепенно исследовать всю Латинскую Америку), то скорее всего вам захочется открыть счет в местном банке и купить машину. И вот здесь вам понадобится Temporary Resident Visa, которая открывает эти возможности и дает право жить в Мексике до 4х лет.Для начала записываетесь на интервью в посольство Мексики, например, в Москве и приносите документы:Заполненную формуПаспортФотоСтраховкаДоказательство наличия средств к существованиюЗатем платите сбор в размере 44$ и вам ставят визу в паспорт.И это еще не всё. Эта виза даёт только право один раз въехать в Мексику. После въезда вам нужно прийти в иммиграционный офис, показать все необходимые документы, пройти интервью и уже тогда получить карточку резидента.БарбадосКогда-нибудь слышали про Барбадос? Какой-то пиратский остров на Карибах, бывшая британская колония? Сейчас это независимое государство и чтобы понять как выглядит Барбадос, стоит просто представить рекламу Баунти и вот оно.Барбадос в 2020 году организовал свою программу привлечения номадов. Она конечно недешевая, 3000$ на семью, но и в целом жизнь там дорогая: ближайший ориентир это британские цены. Поэтому надо сразу рассчитывать свои силы и понимать потянешь ли такое приключение, чтобы не жить в палатке.Но заплатив эту сумму и предоставив всего лишь паспорт и несколько фото, через неделю ты получаешь визу на 12 месяцев. Больше информации на официальном сайте программы.КюрасаоЕсть такой маленький остров в Карибском бассейне, называется Кюрасао. Он входит в состав Королевства Нидерландов, но является самоуправляемым государством. Кстати ликер Блю Кюрасао как раз делается из цитрусового фрукта, который растёт на острове.Но тут не про коктейли. Кюрасао попадает в мой список nomad-friendly стран т.к. имеет специальную программу для цифровых кочевников @HOME in Curaçao!По требованиям всё очень легко:ЗаявлениеСборы 294$Копия паспортаПруфы удаленной работыМедстраховкаКак я понял, нет строгих требованиях по сумме дохода, а время обработки заявки всего 2 недели.Программа даёт право находиться на острове в течение 6 месяцев с возможностью продления на такой же срок. В это время можно спокойно выезжать и заезжать обратно.На сайте обещают, что на острове проведена инфраструктура по европейским стандартам, при этом Кюрасао обладает белоснежными пляжами, теплым морем и морскими черепахами.БермудыБермудские острова имеют программу для удаленных работников Work From Bermuda Certificate, которая подойдет любому, кто сможет обеспечить себе жизнь на этих островах.Чем там заняться подробнейше описано в их \"Приключенческом альманахе\". В целом, типичные активности для курортного островка, но на Бермудах. Бермудская столица Гамильтон выглядит довольно большим и оживленным городом — судя по картинкам там не придется скучать по цивилизации. Также есть старый город с британской колониальной архитектурой.Что по требованиям:Заполнить формуОплатить сбор около 260$Отсутствие судимостейСтраховкаРабочий контракт или регистрация бизнеса за пределами БермудКругленькая сумма на счету или кругленький ежемесячный доход. Предположительно это около 30000$ или 5000$, соответственно.Для вдохновения можно полазать по их рекламному сайту, а подать заявку можно здесь. Обработка заявки занимает 5 рабочих дней, а полученный сертификат позволяет жить на Бермудах целый год. В определенных случаях его можно даже продлить.ХорватияС 1-го января 2021 года Хорватия запустила программу ВНЖ для цифровых кочевников. Хоть многие СМИ и называют по новомодному Digital Nomad Visa, по факту это получение временной резиденции в Европе с очень приятными условиями и короткими сроками ожидания.Про что вообще Хорватия? Кристально чистое море, красивые городишки, приятные образованные люди, интересное расположение на Балканах между Австрией на севере и Грецией на юге.Виза выдается сроком на 12 месяцев, подать на новую можно только через 6 месяцев после окончания предыдущей. Еще можно взять с собой семью, надо только приложить дополнительные документы о родстве. И еще одна плюшка заключается в том, что номадам не нужно будет платить подоходный налог в Хорватии за этот год.Подать заявление на визу можно 3 способами:обратиться в ближайшее консульство Хорватии в Россииесли вы уже в Хорватии, то сходить в полицейский участокподать заявление онлайнЧто потребуется, чтобы получить заветную карточку резидента:заполненное заявлениепруфы, что вы работаете не на Хорватиюкопия паспортасвидетельство о несудимостистраховка на время пребыванияпоказать ежемесячный доход 2700$ или банковский счет с 32000$адрес в Хорватии (можно временный в отеле)свидетельство о браке для супруга или о рождении для детейПосле того как вы подали заявление, вас уведомляют об одобрении или отказе ВНЖ. Бывалые пишут, что это занимает около месяца, но факторов много. Если вас одобрили, то затем летите в Хорватию, там идете в полицию, регистрируетесь и через 3 недели забираете карточку.Инфа о визе на официальном сайте МВД Хорватии или можно сразу подать заявку здесь.МальтаЧтобы хоть как-то приблизится как зарплатной вилке российского удаленщика, появился мальтийский Nomad Residence Permit, который позволяет пребывать на Мальте до 365 дней и свободно перемещаться по шенгену.Требуемый месячный доход равен 2700$, но проверяется он с помощью выписки из банка за последние 3 месяца. К тому же в требованиях они сами указывают на то, что источниками дохода могут быть дивиденды, проценты с инвестиций, доход со сдачи недвижимости, активы и etc. Последние два пункта особенно дают понять, что в принципе неважно откуда у вас деньги — главное чтоб могли показать.По остальным требованиям стандартно:Работа/бизнес за пределами МальтыСопроводительное письмоПаспортСтраховкаДоговор арендыПройти бэкграунд чекОплатить 300€ (+300€ за супруга)Подождать до 30 днейЗаявка подается по email, ответ также получаете онлайн. После одобрения вам даётся национальная виза на полгода. По прилете на Мальту, вы можете прийти в Residency Malta Agency офис для завершения процесса получения Nomad Residence Permit. А можете не приходить, если вам хватает полугода и не нужен остальной шенген. А если и года мало, то можно продлить.Общая инфа и видео можно глянуть здесь. FAQ можно найти здесь, а чек-лист по документам и сама форма заявки — здесь.АлбанияТеплая страна с Адриатическим и Ионическим морями, живописными горами, озерами и низкими ценами. Рядом Черногория, Хорватия и Греция — может оказаться неплохой базой на Балканах. Кажется это привлекательнее чем Сочи и уж точно дешевле (можно снять апартаменты с 2мя спальнями за 200€). Говорят лучше ехать на юг, там сервис лучше, пляжи чище, вода лазурная, и при этом цены адекватные.У Албании есть виза для цифровых кочевников - она же виза для пенсионеров. Это резидентская виза, даёт право жить в стране до 1 года с возможностью продления сначала на 2, потом до 5 лет. Узнать подробнее и оформить можно в ближайшем албанском посольстве.Что по требованиям:Доход (или пенсия) за пределами Албании (9800€ в год)Счёт в банкеКонтракт на жильеСтраховкаСправка о несудимостиАлбания носит официальный статус страны-кандидата на вступление в ЕС. При этом уже сейчас для Албании действует безвизовый режим для туристических целей.МаврикийГод назад к программе предоставления визы для цифровых кочевников присоединилась Республика Маврикий. В отличие от Карибских островов, Маврикий находится в одном часовом поясе с Москвой и сравнительно доступнее по ценам. Узнать, что есть привлекательного на Маврикии можно на сайте Mauritius Now (там даже можно посмотреть на остров в прямом в эфире по камерам).Для посещения Маврикия россиянам виза не нужна, если срок пребывания не больше 60 дней, — вы отделаетесь только легкими штампами в паспорте при въезде и выезде. Но для тех, кто влюбится в остров и решит задержаться, правительство ввело Premium visa для номадов (и, конечно же, пенсионеров) со сроком пребывания до 1 года с возможностью продления. А самое приятное, что есть список стран, которые могут податься на эту визу, и в этом списке есть Россия.Итак, какие требования:Доход должен быть вне МаврикияПаспортБилеты туда-обратноФотоEmail-адресСтраховкаРезервация жильяСвидетельство о браке (если едете с супругом)Доказательство наличия 1500$/1300€ в месяц, либо выпиской из банка, либо рабочим контрактомЗаявка подается онлайн, обрабатывается в течение 2 дней, а ответ придет по email и больше ничего не нужно делать, кроме как проверять почту и собирать чемоданы. Оформление данной визы - бесплатно. Кстати можно приехать по турвизе, а затем податься на эту визу, если приспичит остаться на подольше.Заполнить онлайн форму можно сразу по ссылке. Еще есть требования по въезду, которые касаются коронавирусных мер безопасности, про них читаем здесь.НорвегияНорвежская программа для цифровых кочевников отличилась и запустила сайт, который они сделали для популяризации удаленщиков в их регионе. Однако это одна из самых сложных виз в получении в плане требований. Требования не столько сложные, сколько специфичные — не каждый номад попадет под них.Итак, у вас есть возможность получить визу на 2 года (с продлением до 6 лет) как самозанятый, оформленный за пределами Норвегии, если:У вас есть высшее образование или специальная квалификация, полученная входе долгой и упорной работыУ вас ИП, а не ОООУ вас есть контракт на жилье в НорвегииВы зарабатываете не меньше, чем 35719€ в год, до вычета налоговУ вас должен быть норвежский клиент — настоящий бизнес с юридическим адресомВы готовы отдать 600€ за визуИтого, главный камень преткновения — это норвежский клиент: он либо у вас есть, либо нет. Если вас все равно заинтересовало, то можно почитать подробнее на официальном иммиграционном сайте Норвегии.На этой странице можно найти другие варианты иммиграции в Норвегию для россиян. Например, там есть специальная программа для жителей Баренцева региона.А еще в норвежском королевстве есть архипелаг, называемый Свальбард, который имеет безвизовый режим с более чем 40 странами, включая Россию. Граждане этих стран могут свободно приезжать на острова архипелага, жить там и работать. Официальная информация — здесь.БразилияБуквально на днях Бразилия тоже присоединилась к тренду неудержимого появления виз для удаленных работников. Конечно, для россиян есть безвизовый въезд на 90 дней, но что если захочется остаться дольше? Теперь есть опция в виде ВНЖ для цифровых кочевников на 1 год с возможностью продления до 2-х лет.Чтобы получить данную визу нужно будет прийти в посольство Бразилии и подать следующие документы:Заполненное заявление (скачать здесь в конце страницы)Доказательство статуса удаленного работника: контракт с компанией вне Бразилии или документы о владении компаниейМесячная зарплата 1500$ или счет в банке на сумму 18000$ПаспортСтраховкаЧек об оплате пошлиныБилет до БразилииСправка о несудимостиОбработка заявления должна занять не более 3-4 недель.ВенгрияСовсем недавно Венгрия тоже запустила визу для цифровых кочевников, называемую White Card. На удивление требования в ней прописаны очень чётко, можно сразу определить попадаешь ли ты под них. Данная виза позволяет жить в стране до 1 года (с продлением до 2х), путешествовать по Шенгену и работать удаленно из Венгрии \"с использованием передовых цифровых технологий\".Что нужно сделать пошагово, чтобы получить венгерскую визу White Card:1. Собрать необходимые документы:Заполненное заявлениеТрудовой договор с компанией вне Венгрии ИЛИ доказательства владения компаниейМесячная зарплата не меньше 2000€Любое другое доказательство стабильности дохода: налоговая декларация, банковская выпискаКонтракт аренды жильяСтраховка2 фотографииОплатить пошлину 110€2. Подать все документы и заявление в посольство Венгрии на родине. Для стран с безвизом в Венгрию можно подать документы онлайн (подробнее).3. Дождаться одобрения документов в течение 30 дней и получить въездную визу.4. Въехать в Венгрию в течение 30 дней действия въездной визы и прийти в местный иммиграционный офис со всеми документами для получения White Card.ПортугалияВ последнее время много разговоров про португальскую визу D7. С недавних пор виза D7 сейчас рассматривается и как виза для цифровых кочевников. \"Так называемые «digital nomads»\" — как гласит официальный документ консульства.Итак, как удаленному работнику получить португальскую визу D7.1. Записаться на приём для подачи документов на резидентскую визу D7:Для начала нужно зарегистрироваться на сайте консульстваЗаполнить анкету латинскими буквами, не используя символыВ пункте \"Консульское учреждение\" выбрать строку \"Консульский отдел посольства Португалии в Москве\"Выбрать дату2. Собрать комплект документов для визы D7:Распечатанная копия анкеты с сайта консульстваДве цветные фотографии 3,5х4,5 на белом фоне: одна наклеенная на анкету, вторая отдельно с написанными серией и номером загранпаспорта (слитно) на обратной стороне фотографииКсерокопия всех страниц загранпаспорта, включая пустыеДокументальное подтверждение того, что последние 12 месяцев у вас был регулярный и легальный доход не менее 705€ в месяц. А так же доказательство того, что этот доход останется с вами по приезде на территорию Португалии, т.е. является удаленным. Документ должен быть переведен на португальский язык и заверенВыписка со счета в португальском банке с суммой не менее 8460€Португальский номер налогоплательщика — без него вам не откроют счет в банкеКонтракт на жилье сроком не менее чем на 1 год или документ о владении недвижимостью в Португалии. Поговаривают, что сервисы онлайн бронирования типа AirBnB или Flatio не прокатываютРаспечатанное и подписанное согласие на обработку данныхСправка о несудимости, выданная за последние 3 месяца, с апостилем и заверенным переводом на португальский языкМедстраховкаБронь авиабилета в Португалию. Дату вылета лучше брать не раннее, чем через 60 дней после подачи документовЕсли подаете на всю семью, то потребуются апостилированные и переведенные соответствующие документы: свидетельство о браке и/или о рождении ребенка. Также придется показать дополнительный доход: +50% на второго взрослого и +30% на каждого ребенка3. Лично подать документы на визу D7 в консульстве в Москве, находящемся по адресу Ботанический Переулок, дом 1. Оплатить консульский сбор 90€.4. Дождаться рассмотрения документов сроком до 60 рабочих дней и получить обратно загранпаспорт с вклеенной визой сроком на 120 дней. Отслеживать статус можно в личном кабинете на том же сайте5. Прилететь с этой визой в Португалию и записаться на интервью в SEF по телефону, в случае если при выдаче визы в консульстве вам сразу не сказали дату и место.6. Пройти интервью в офисе SEF. На всякий случай взять с собой оригиналы всех возможных документов.7. Дождаться писем с карточками резидентов на адрес, который вы предоставили при подаче документовРекомендации и обновленный список документов от посольства Португалии в Москве можно скачать здесь.Про Португалию и необычные способы эмиграции я пишу в своем канале Пароль от вайфая. Подписывайтесь на канал, если понравилась статья и в целом интересна тема географической независимости и эмиграции.  "
]