[
   "Костыли при верстке рассылок",
   "Привет, %username%!\n\r\nЯ рад, что мои предыдушие топики о верстке рассылок оказались тебе полезны. Если я прав, то хотел бы рассказать еще и о костылях при верстке, которые были выявлены мною при сотрудничестве с коллегами из Unisender. Так же я позволю себе пару раз повториться, по той простой причине, что этот топик будет являть собой шпаргалку для костыльмейкера верстки рассылок. Велкам под кат.\n\r\nКак уже стало принятым в топиках о рассылках, привожу библиографию для тех, кто что-либо пропустил:\n\nВерстка почтовых рассылок\nС версткой почтовых рассылок все не так уж плохо\nВерстка почтовых рассылок: взгляд изнутри\nВерстка почтовых рассылок: разбор полетов\nВерстка e-mail рассылок — «подводные камни». Часть первая. Картинки\nВерстка e-mail рассылок — «подводные камни». Часть вторая\n\nGmail\r\nКак уже писалось ранее, парсер Gmail имеет свойство подчеркивать изображения-ссылки. Лечится просто, отменой декорирования ссылки:\n\n<a href=\"ссылка\" style=\"text-decoration:none;\" target=\"_blank\"><img src=\"путь_к_картинке\" border=\"0\" width=\"ширина\" height=\"высота\" alt=\"описание\"/></a>\n\nПочта Mail.ru\r\nОчень странный баг, но он имеет место быть. Заключается он в дублировании тегов BR в блоке по такому вот принципу. Если мы имеем конструкцию:\n<span style=\"font-family:Arial; font-size:12px; color:#666666;\">Lorem[br/]ipsum[br/]dolor[br/]sit amet</span>\r\nто парсер это интерпретирует так:\n<span style=\"font-family:Arial; font-size:12px; color:#666666;\">Lorem[br/]ipsum[br/]dolor[br/]sit amet[br/][br/][br/]</span>\r\nну а лечить это мы будем так:\n\n<div><span style=\"font-family:Arial; font-size:12px; color:#666666;\">Lorem</span></div>\n<div><span style=\"font-family:Arial; font-size:12px; color:#666666;\">ipsum</span></div>\n<div><span style=\"font-family:Arial; font-size:12px; color:#666666;\">dolor</span></div>\n<div><span style=\"font-family:Arial; font-size:12px; color:#666666;\">sit amet</span></div>\n\r\nи в этом случае дубляжа не произойдет, а перенос строк мы осуществляем за счет помещения каждой строки в отдельный блок.\n\r\nПримечание: в кодах заменил скобки у тегов BR, потому что хабрапарсер съедает эти теги.\n\nYahoo Mail\r\nЭтот почтовик еще более загадочен, чем mail.ru. Парсер по неизвестному принципу выбирает некоторые ссылки в письме и преобразует их из:\n<a href=\"ссылка\" target=\"_blank\" style=\"font-family:Arial; font-size:12px; color:#666666;\">текст</a>\r\nвот в такую вещь:\n<a href=\"ссылка\" target=\"_blank\" style=\"font-family:Arial; font-size:12px; color:#666666;\"><span class=\"yshortcuts\">текст</span></a>\r\nчто приводит к тому, что ссылка оформляется не инлайновыми слитями, а стилями класса yshortcuts тега span. Рещение просто — можно нарушить правило вынесения стилей в head. В заголовке документа объявляем класс yshortcuts, и дублируем стили ссылки туда. Для особо невниматеьных повторюсь — класс присваевается тегу span, а не самой ссылке.\n\nЯндекс почта\r\nПроблема заключается в том, что все ссылки при наведении становятся красными. Наверное — фирменный стиль Яндекса. Стили в head не решают проблему. Костыля не нашел, но буду признателен тому, кто поделится решением.\n\r\nИ в комментах пользователь note показывает действительно рабочее решение проблемы.\n\nOutlook Express\r\nОб этом я так же писал, но повторюсь, что нужно коллапсировать таблицы для избавления отступов между ячейками, что может неблагоприятно сказаться на внешнем виде письма при обилии цветов или графики. Конструкция проста:\n\n<table style=\"border-collapse:collapse;\">...</table>\n\nThe Bat!\r\nСам лично не сталкивался, но до меня часто доходила информация, что старые версии Bat'a не хавают прозрачные .gif файлы. А точнее, просто, закрашивают прозрачные пиксели черным цветом. Как решение проблемы — использование гифов с заменением прозрачных пикселей цветом фона. Тоже самое касается однопиксельной .gif распорки — делаем ее не прозрачной, а цветом фона того места, где она вставляется в документ.\n\nВне формата\r\nЕсли не указывать ширину и высоту изображений, то пользователь не увидит alt'ов на незагруженных картинках. К тому же соблюдение установленных размеров картинок не ломает верстку при отключении изображений.\n\nИтог\r\nС одной стороны, костыли порой бесят, но с другой, их не так уж и много, и соблюсти при верстке рассылки все вышеуказанное не составит огромного труда. Спасибо за внимание, и удачи в работе! "
]