[
   "Краткий обзор Казахстана и личные воспоминания",
   "Поскольку сейчас у многих стоит вопрос - а куда бы отправиться? -  я могу немного рассказать о Казахстане, в котором мне довелось пожить и поработать. Заранее прошу простить, если я где-то буду субъективным, но что поделать - это не сухой обзор, но еще и личный опыт. Также, что-то могло устареть. А лететь или не лететь - решать вам (наземные погранпереходы закрыты из-за ковида, если у вас нет уважительной причины).Республика Казахстан. Физическая карта.Ремарка: да, эта статья написана под впечатлением от https://habr.com/ru/post/654579/ , которая нифига не раскрывает, ни что такое Казахстан, ни как там живётся или работается.Давайте начнём с обзора, что вообще такое Казахстан?Казахстан (Республика Казахстан, РК) - молодое государство (с 1991 г.), расположенное от долины реки Волга на Западе и до Иртыша на Востоке, 3000 километров. С Севера на Юг - от Западно-Сибирской равнины и до верхнего течения Сырдарьи на границе с Узбекистаном на Юге, 1900 километров. Несмотря на то, что размер страны несопоставим с Россией, многообразия климата здесь хватает. Если Север ничем, практически, не отличается от соседних Челябинска и Омска (с Запада на Восток возрастает количество солнечных дней), то Юг - это настоящая Азия, безо всяких скидок - пески, верблюды, и испепеляющая жара не хуже той, что можно ощущать в степях Волгоградской области. За исключением того, что зимы, как таковой, нет :) На Востоке и Юго-Востоке страну обрамляют горы - Алтай (внезапно, поделен между 4 государствами), и Иртыш втекает из Китая между Алтаем и Тарбагатаем. Южнее - Семиреченское Алатау. Между Алатау и Тяньшанем находится Семиречье (Алматинская область), а сам город Алматы стоит у подножья Тянь-Шаня.Любая страна - это не только горы и поля, это народЖители Казахстана это казахстанцы. Пожалуйста, запомните - прилагательное от Казахстана - \"казахстанский\" (в отношении имен существительных). И казахстанцев без малого 19 миллионов человек. Этнический состав населения Казахстана примерно такой: 69% - казахов, 18% русских, 3% узбеков, 1,5% украинцев, 1% татар, и менее малочисленные национальности, которых в Казахстане много. Очень. Среди моих знакомых и коллег были немцы, татары, корейцы, армяне. Соседка по площадке - полька. А меня там поймут? Да :)Большинство населения - 95% - может понимать и говорить по-русски. Читать и писать по-русски может 87%. Здесь необходимо сделать оговорку, что опрос имел бинарную природу, поэтому \"уровень\" владения русского языка между жителем аула в Южно-Казахстанской области и жителем столицы будет отличаться. Иногда - в разы. Единственный государственный язык - казахский язык. За русским языком зафиксирован статус языка межнационального общения, также, он может применяться в деловой сфере, коммерческой сфере, в государственной сфере - для запросов и ответов на них. Договора обычно дублируют на двух языках.Казахский язык - довольно простой и довольно логичный, минимальный минимум вы освоите за пару месяцев - устный счёт (бир, еки, уш), вопросы \"есть ли?\" ($thing бар ма?), ответы да (йа), нет (джок), спасибо (рахмет), привет (салам(ты)  или салимет сизбе (Вы))-пока(сау бол (ты), или сау болыныз (Вы)). Это нужно будет нечасто, но иногда попадаются люди, которые русский понимают плохо - в таком случае, минимальный разгорник на 100 слов вас сильно выручит. Вывески, согласно закону, должны дублироваться на оба языка, но это происходит не везде, но если что - магазин это дукен, еда это азык-тулик. Если вы когда-либо учили татарский, башкирский, турецкий, азербайджанский, или хотя бы просто знакомы с этими языками - то вам будет сильно проще. Казахский алфавит был на базе кириллицы, сейчас идёт планомерный переход на латиницу. Честно говоря, кириллица мне нравилась больше - её банально удобнее было читать, даже с учётом наличия специальных букв. Теперь же есть весьма странные сочетания, которые надо будет запоминать - это головняк. В Казахстане, как правило, нет проблем если вы не понимаете казахский. Наибольшая сложность непонимания казахского была (есть?) у тех казахов, которые свой родной язык не знали или знали плохо. Как мне рассказывали, много лет казахи ставили в укор другим казахам, что те говорят по-русски. Я даже запомнил, как назывался тот лозунг - \"Казах казахпен казакша сойлесу керек\" - \"Казах с казахом должен говорить по-казахски\". На русских этот лозунг, понятно, не распространяется. Но бывает, конечно, что кто-то занимается хейтингом и разводом на скандалы в сфере обслуживания, сценарий выглядит следующим образом: человека, работающего в сфере обслуживания, спрашивают что-то на казахском, а тот либо отвечает, что не понял, либо даже если понял, то всё равно отвечает по-русски - ну, потому что так удобнее. После этого начинается скандал, с криками и обвинениями, снятием на камеру и тому подобном. Очень неприятно, но переезжающим айтишникам это не грозит, да и случается такое редко.Религия и всё такоеНесмотря на то, что Казахстан - светское государство, большинство населения - мусульмане. Хоть и очень, так скажем, либеральные. Тем не менее, муэдзин (зазыватель на утреннюю молитву) вполне может стать вашим будильником, если вы поселитесь немного неудачно, и вот этот момент есть смысл проверить заранее. Любые спиртные напитки продаются в любых магазинах, свинина также продаётся и покупается свободно. Но есть нюанс: нахождение в состоянии алкогольного опьянения даже средней степени на улице несёт угрозу задержания, существенного штрафа, вытрезвителя (их открывали, закрывали, вновь открывали, что сейчас - не знаю). В разных регионах страны \"терпимость\" к пьяным отличается - где-то абсолютно спокойно можно быть \"на рогах\" и идти по синусоиде, а где-то лишь за слабый запах изо рта грозит всё вышеперечисленное. Кстати, о полиции - полиция в Казахстане универсальная - не делится на ГИБДД и \"пешую\". Любой полицейский может оформить штраф за любое нарушение - независимо от того, есть у него жезл или нет. Раньше легко было отделаться небольшой взяткой, сейчас это является уголовным преступлением как для взяткодателя, так и для берущего взятку. Крайне не рекомендую. А вот \"план\" по палкам у них есть. Так что держитесь за свои \"права\" крепче. Единственное, что допускается - можно так или иначе упросить выписать протокол по более \"щадящей\" статье. Опять же - никаких взяток. В машинах полиции всё пишется, не вздумайте. Также есть штрафы за мелкое хулиганство, к которому приравнивается выброс мусора в неположенных местах. Бычок или чек мимо урны вполне весомое основание для штрафа в ~4 тысячи рублей (5 минимальных расчетных показателей, МРП). Поэтому на улицах в центре городов, где много камер и полиции, обычно довольно чисто.Что такое государство? Государство - это сервисы.В Казахстане есть аналог МФЦ - ЦОН (центр обслуживания населения). В них можно решить большинство задач - справки, выписки, регистрационный учёт (для граждан). Также есть и электронные госуслуги - \"электронное правительство для граждан\". Что \"на земле\", что \"в цифре\" - госуслуги доступны на казахском и русском языках. Граждане получают ЭЦП (электронно-цифровую подпись) и с её помощью могут делать большое количество значимых операций с государственными органами. ЭЦП выдаются в ЦОНах, и, внезапно, в налоговой (и это разные ЭЦП). Бесплатно. Программное обеспечение для нормального функционирования этой инфраструктуры так же предоставляется бесплатно. Оно глючное и работало только с WIndows. И да, нужно устанавливать корневой сертификат господина майора (мырза майор).Государство - это социальная инфраструктура.В Казахстане много русскоязычных или смешанных государственных школ. Есть как общеобразовательные школы, так и школы с уклоном в разные предметы. Есть школы с конкурсным отбором - гимназии (районные), городские (приписанные к городу, а не к конкретному району), областные школы с уклоном в те или иные науки. По умолчанию туда берут детей, у родителей которых есть \"ВНЖ\", но также могут взять детей временно проживающих в РК, если родитель(или родители) являются трудовыми мигрантами. Подробнее здесь и здесь.В Казахстане есть медицина, но, к сожалению, плохого качества. Граждане и резиденты страны имеют аналог программы ОМС - ОСМС (обязательное социальное медицинское страхование), с очередями к узким специалистам и на обследования. Платно - хоть в тот же день. Детали закона \"Об обязательном социальном медицинском страховании\" можно прочесть здесь.  Иностранцам \"по умолчанию\" нужен ДМС (и не только он), а общие требования изложены в Законе \"О миграции населения\"(https://adilet.zan.kz/rus/docs/Z1100000477 либо https://online.zakon.kz/Document/?doc_id=31038298). Однако, поскольку Казахстан и Россия являются членам ЕАЭС, то трудовые мигрантам \"включаются в систему\" ОСМС с момента заключения трудового договора, а право на лечение получают с момента первых платежей в фонд медицинского страхования. Все это происходит в рамках Договора о ЕАЭС, а именно, пунктам 4 и 5 \"Протокола об оказании медицинской помощи\" (приложение №30 к договору о ЕАЭС). К сожалению, я не был семейным, и потому не могу сказать, оказывается ли помощь бесплатно членам семей. Да, они также включаются в программу, но достаточно платежей работающего члена семьи - мне неизвестно. Если нет, то для оплаты взносов за семью следует исходить из расчёта 1 иждивенец - 1 МРП (минимальный расчётный показатель), на 2022 год его значение равно 3063 тенге, или ~750 рублей в месяц.За своих граждан Республики, а именно студентов, несовершеннолетних, пенсионеров - платит бюджет, остальные граждане либо платят через работодателя, либо напрямую.Города КазахстанаДавайте погорим о том, где, собственно, жить. Есть два варианта - вариант, в котором вы ищете местную работу, и тогда есть смысл ехать только в Астану (Нур-Султан) и Алматы (так правильно. Нельзя писать в Алмату. Это неграмотно. Алматы - не склоняется. Можно писать на устаревший манер, в Алма-Ату). Оба-два - города миллионники, но Алматы  почти в два раза больше. Если сравнивать агломерации - аналогично. Рядом с обоими городами находятся международные аэропорты. Если вы \"удаленщик\" на казахстанскую или иностранную компанию, то можете выбирать любой облцентр на Севере и Востоке страны: Костанай (рядом с Челябинском), Петропавловск (недалеко от Омска), Кокшетау (между Петропавловском и Астаной), Павлодар (выше Омска по течению Иртыша), Усть-Каменогорск. Павлодар и Усть-Каменогорск лично я не рекомендую по причине неблагоприятной экологии в этих городах. Честно - города-облцентры с населением 300 тысяч человек большинству россиян покажутся скучными, маленькими и неразвитыми в плане сервиса. Поэтому заострять на них внимание не буду, но если в комментариях попросят рассказать об Усть-Каменогорске - добавлю блок о нём. Кстати, о месте для жизни - здесь очень любят переименовывать всё подряд. Заснёте на одной улице, проснётесь на другой. Причем переименовывают, часто, даже абсолютно нейтральные названия. К примеру, личный случай - улицу Солнечную переименовали в Астана, причем решал это местный актив, а местных жителей, живущих на этой улице никто не спросил. Ну, такое :\\Административное деление страны и крупнейшие города регионовНур-Султан (Астана/Акмола/Акмолинск/Целиноград)Столица государства, трижды переименованная только за последние 30 лет. Я уже говорил, что здесь любят менять названия всех топонимов? В последний раз - в честь ныне здравствуюшего первого президента Республики - Нурсултана Абишевича Назарбаева (кстати, первый момент местной жизни - отчества местных иногда сложно выговорить. Но русским либо прощают  оговорки, либо разрешают обращаться по имени на Вы. По ситуации).Последнее переименование случилось пару лет назад, когда после 28 лет нахождения у власти в должности Пожизненного Президента, господин Назарбаев, сказал, что он устал, что он ухожук, и передал власть председателю сената (верхняя палата, аналог Совета Федерации) Касым-Жомарт Токаеву. После этого произошли выборы, на которых он же и победил с 70% голосов.Город расположен на равнине, в степи. Летом - жарко, зимой люто холодно. Круглый год ветер. Если ветра нет, то в холодное время образуется смог от автомобилей и частного сектора (в Казахстане очень плохо всё с газом, за пределами западных нефтегазоносных областей).И не забудьте про ветер. Даже если вы не интересуетесь ветром, ветер интересуется вами!Еще город делится на две части - правый и левый берег. Если на правом берегу застройка, в основном, советская, то левый берег - это застройка столицы, с 1998 года и по наши дни. Разнообразные башни, шатры, и прочие архитектурные изыски, сделанные архитекторами разных стран, которые очень красиво смотрятся с обзорной башни (Бай-Терек), но снизу это асфальт и плитка. И очень мало зелени. Качество всего новостроя, к сожалению, оставляет желать лучшего. Из плюсов могу отметить разве что наличие велодорожек. Здесь сосредоточены органы власти и бизнес.Поля плитки. Где-то сзади \"Ак Орда\" - президентский дворец. Слева от меня здание Парламента, справа - не влезло в кадр - здание Правительства Байтерек. Символ космической программы Казахстана. \"Богатый тополь\", если дословно.Относительно недалеко - по казахстанским и вообще сибирским меркам - расположен курорт Боровое - озеро в лесу, с небольшими лесистыми холмами по бокам. Можно доехать с ветерком по платной трассе Астана-Щучинск.АлматыКрасивый город, который был столицей КазССР и Республики Казахстан с 1929 по 1997 год, расположенный у подножья Тянь-Шаня. Если вы достаточно старый, то сможете угадать это здание со всех открыток:Да, горизонт заваленПро подножье гор - не шутка, и если вам повезет, то вид из окон у вас на работе или дома будет как у меня:Лучше гор могут быть только горы!Отличается мягкой и короткой зимой, жарким летом. К сожалению, город находится в котловине, и несмотря на то, что тяжелой промышленности в нём практически нет, жители города страдают от регулярного смога. Зимой из-за отопления предместий ситуация резко ухудшается.это многолетние наблюдения. последние 10 лет стало теплее в Марте (1,0С) и Ноябре (-0,7С)Если вы любите зимние виды спорта, то вам доступен знаменитый на весь СССР каток Медео (30 минут езды от центра города), а также горнолыжный курорт Шымбулак  (60 минут езды от центра города).Одним из центров досуга граждан является парк \"Коктобе\" - \"Зеленый Холм\".Вид с Коктобе на АлматыТакже, приятным местом проведения досуга является Главный ботанический сад г. Алматы. Я очень любил туда ходить, хоть большая часть парка и выглядит несколько заброшенной. Вход платный, но бюджет одинокого молодого человека это не напрягало.Чем дальше от входа, тем меньше людей.В городе есть одна ветка метро. Для оплаты проезда в общественном транспорте лучше пользоваться местной проездной картой - \"Онай\", разница в цене с наличными платежами - почти в два раза.  Недалеко от города есть Капчагайское водохранилище, а для тех, кто готов провести больше времени в дороге есть курорты Иссык-Куля (горного озера на территории Киргизии).Такси Из привычных агрегаторов есть Yandex, Uber, inDriver. В Алматы легко уехать из центра в каком-либо направлении просто \"проголосовав\" на дороге, и вас подберёт частник. Раньше поймать можно было даже автобус :) Есть и местные таксомоторные парки. Средняя цена за километр (в Алматы) - ~50 рублей.О еде. ЕдаАлматы, в плане культурного разнообразия, выглядит гораздо интереснее новой столицы. Особенно я замечал это в гастрономическом плане, а поесть я люблю. В то время как в Астане еда была представлена либо русской либо, реже, казахской кухней, а остальное подавалось как \"эксклюзив\" с соответствующими ценами, то в Алматы рады всем, а разнообразие шире. Кстати, о казахской кухне. Попрошу не кидаться в меня тяжелыми предметами, но она мне не понравилась. Наиболее часто встречаться вам будут следующие национальные яства:напиток, айран - по факту, тот же кефир, но чуточку по-другому приготовленныйнапиток, катык - что-то типа похожее на ряженку, но не сладкая, и на вкус напоминает топленое молоко.напиток, кумыс - кобылье молоко, которое забродило. В зависимости от выдержки может быть аналогом кваса (по градусам), так и как пиво - доходит до 5 оборотов.напиток, бозо (или бузо, буза) - насколько я понял, встречается только на Юге - ферментированный напиток из злаковых ( пшена, пшеницы, кукурузы, риса) и солода.закуска, курт - подсохший скатанный творог с солью. Используется как перекус. Редко предлагается в ресторанах, но часто продается на вынос в разных забегаловках.похлёбки, имеют разные названия, но, как правило, со словом коже (похлебка). К примеру, жети коже (похлебка из семи злаков). Очень на любителя. Супы с названием сорпа или шорпа, на мой взгляд, вкуснеебаурсаки, аналог пончиков - жарятся в масле, но, в отличие от пончиков, имеют форму шара.бешбармак - лапша с бараниной, но бывают и другие вариантыказы - колбаса из кониныкуырдак - жаркое  из субпродуктов с картофелемТак, в Алматы действует много турецких демократичных забегаловок, где, кстати, действительно обслуживают на турецком,  есть уйгурские кафе и пекарни, несколько китайских кафе и ресторанов, два или три корейских заведения (я уже говорил, что в Семиречье компактно проживают корейцы?), узбекские, кавказские и многие другие. Кстати, хычины - кавказские лепешки с начинкой - я впервые попробовал именно в Алматы, а не на Кавказе или в Москве.Интересная географияОдна из вещей, к которым нужно будет привыкнуть в Алматы - то, что город имеет уклон с Юга на Север, и верхней частью города называется южная, а нижней, соответственно, северная. Кстати, все билборды с картами и отметками \"вы здесь\" по этой же причине рисуются перевёрнутыми. Вот так можно ощутить интересный \"экспериенс\" с перевёрнутыми картами, не покидая Северного Полушария!Еще Алматы довольно зеленый город - в нём много деревьев, которые спасают от жары и дают тень. Но вид гор с шапками снега, когда внизу девушки ходят в блузках, а парни в рубашках, и на деревьях все еще (или уже) есть листва - это незабываемо. Что-то подобное можно испытать в Сочи, но там как-то иначе. Надо куда-то ехать, куда-то забираться, куда-то подыматься. А здесь не так.О менталитете, местных обычаях и тому подобном.ПраздникиДолжен отметить, что Казахстан - довольно интересная страна. Начнём с того, что Новый год здесь празднуют дважды, вполне официально. Первый раз - 31 декабря, по-казахски - Жана Жыл (Новый Год). Приходит под елку Аяз Ата (Дедушка Мороз). Второй раз - Наурыз. Наурыз - древний праздник зороастрийской культуры, отмечается 20-22 марта, в день весеннего равноденствия.Кроме двух новых годов(интересно, а так можно склонять?), в стране так же отмечаются православное Рождество и Курбан-Айт. Это выходные дни. 8 Марта также в почёте. Далее, 1 мая - День единства народа Казахстана. Еще праздничными днями являются День Победы 9 мая и День Батыра (местный аналог Дня Защитника Отечества), 7 мая. 6 июля отмечается день столицы (по совместительству - день рождения Первого Президента). 30 августа отмечается день Конституции РК. 1 декабря еще раз отмечается день Первого Президента (да, у него целых два праздника в году). Наконец, 16 декабря - День Независимости.Как видите - праздников в изобилии!Но особенно народ любит все весенние праздники, Новый Год. Потом Курбан-Айт и Рождество. Кто отмечает праздники в честь Президента я не знаю. Разве что в Астане дают по этому поводу красочный салют и проводят шоу.Семейные торжества, и вообще о семье...Казахи и другие восточные народы Казахстана отмечают их с размахом и большим количеством приглашенных гостей. Свадьба на 50 человек будет считаться неприлично маленькой, а еще она должна пройти в два разных дня дважды - в доме невесты (проводы) и в доме жениха (приём в семью). Из интересных моментов, которые довелось услышать, но сам не видел, так это праздник разрезания пут, когда маленькому ребенку завязывают ноги, а потом режут веревку, чтобы он официально пошёл. Кстати, ребенок-мальчик - \"бала\", девочка - \"кыз\", ну а просто уменьшительно-ласкательное со стороны взрослой родни - \"айналайын\" (жеребеночек).В Казахстане сильны традиционные ценности, которые, впрочем, потихоньку отступают под натиском современного мира. Но всё еще очень жесткое разделение домашних обязанностей встречается очень часто. Вплоть до того, что мужчины в семье не моют посуду - даже если на улице их жена ходит в брюках или в джинсах. Вот такой вот 21 век.О понтахКазах без понтов - беспонтовый казах(с). Так говорят сами казахи. Не могу сказать, что этим занимаются все, но многие точно пытаются пустить пыль. В основном, это выражается в покупке старых Land Cruiser, Prado, Pajero. Обязательно черного, или, реже, белого цветов.О работеРаботать в Казахстане принято не очень упорно. Можно сказать, что соблюдается тот самый work-life баланс. Пить чай (шай), разговоры вести. Авторитарный стиль управления преобладает. Есть люди, которые работают много, но их редко повышают и двигают по службе, потому что самое главное основание для получения хорошей должности, увы, кровное родство. То самое кумовство. Только если обычное кумовство ограничено, ну пусть максимум троюродной родней, то у казахов принято считать до 7 колена минимум, до 10-12 колена в нормальной ситуации, ну а \"белая кость\" считает своё происхождение чуть ли не от Чингизхана. Вторыми в этой очереди идут друзья-приятели (друг - дос), ну, а работящие \"лошадки\" - в конце очереди. Можете себе представить, каковы шансы получить хорошую работу с улицы или потом продвинуться в компании.Хорошо, предположим, вы решили, что вам всё это интересно и вы хотите попробовать на вкус жизнь в Казахстане. Где искать работу? hh.kz , выбираете регион \"Казахстан\" и LinkedIn. Где искать жильё? krisha.kz, olx.kz (много фейковых объявлений, чем-то похоже на российское Авито). Двушку снять будет стоить, грубо говоря, 180-250 тысяч тенге в месяц - что в Алматы, что в Астане. В Астане, будет немного дешевле (либо лучше квартира за те же деньги). Интернет-барахолка? olx.kz Сколько денег будет уходить на еду? Да примерно столько же, сколько и в России уходило. Что-то будет дешевле, что-то дороже.Хорошо, вы нашли вакансию, вроде бы нормальные деньги. Первое, что следует уточнить - грязными это или чистыми. Предположим, грязными вам предложили 1 000 000 тенге в месяц (оклад). Из них вычтут:10% ИПН (индивидуального подоходного налога, с первого дня)10% ОПВ (обязательные пенсионные взносы, для всех резидентов - вы станете им через 183 дня в 12 месячном периоде)3,5% СО (соцотчислений, на школы-больницы), за базу принимается ОКЛАД-ОПВ2% ООМС (отчисления в фонд обязательного медицинского страхования).Итого, грубо, на карточку вы получите 750 тысяч. На самом деле расчёт чуть сложнее, но порядок вы теперь представляете.Кроме того, ваш работодатель сверху заплатит СН (Соцналог), который считается как   (ОКЛАД-ОПВ) х 0,11 - СО. И еще 2% на ВОМС (в фонд обязательного медицинского страхования). Вы этого не увидите, но это также входит в ФОТ (фонд оплаты труда)Хорошо, предположим вы нашли работу, договорились... По приезду вам нужно будет сделать следующее (для граждан ЕАЭС):купить местную симку, желательно в офисе оператора (а не на рынках или вокзалах) и зарегистрировать ваш телефон в специальной базе (да, иначе телефон может \"окирпичиться\" и перестать работать в местных сетях). Впрочем, с регистрацией смартфона вы можете подождать - у вас будет несколько месяцев. Эта норма позаимствована у Турции :)получить разрешение на временное проживание (РВП), оно же является регистрацией иностранца. Это делается в органах МВД (возможно, что можно у представителя МВД в ЦОНе), либо через портал электронного правительства. Основанием для его получения будет трудовой договор. На регистрацию гражданам ЕАЭС даётся 30 дней, но я рекомендую не затягивать.оформить ИИН (индивидуальный идентификационный номер). Нечто среднее между ИНН и СНИЛСом. Присвается человеку один раз, и не меняется в дальнейшем.желательно получить ЭЦП (электронно-цифровую подпись) в ЦОНе.с ИИН и РВП вы сможете открыть счёт в местном банке. Банков довольно много. Too big to fail - Народный банк Казахстана (является, по факту, правопреемником Сбербанка в Республике после распада СССР). Удобный - Kaspi bank, но я не уверен, работает ли он с иностранцами. Есть Сбербанк Казахстана (дочка Сбербанка РФ).ИП или ТОО (аналог ООО) можно открыть только имея вид на жительство (ВНЖ).Вот-с. Должен отметить, что штрафы за нарушение миграционного законодательства в Республике велики (как, впрочем, почти все штрафы в стране), а еще можно загреметь на 15 суток ареста - и это вполне реальная возможность. Так что - проконсультируйтесь либо с сотрудником МВД, либо с юристом, либо почитайте сами всё на несколько раз :) Также, можете попробовать найти тематические темы на каком-либо из форумов - к примеру, vse.kz очень популярен и там можно найти подобные темы.К сожалению, согласно Казахстанскому законодательству, иностранцы не могут владеть землей и покупка домов поэтому им недоступна; однако иностранцы с ВНЖ могут покупать квартиры. После утраты ВНЖ иностранец (или выбывший из гражданства Республики человек) должен продать квартиру, но, на практике, я не видел санкций за это. Возможно, это поменялось, но в прошлый раз это было так.Казахстан - интересная страна, в которой сочетается и восточные традиции, и вполне себе европейский подход. Здесь интересно пожить и поработать, люди в этой стране гостеприимные и рады гостям, и хорошо относятся к разным народам. Я рад тому времени, которое провёл в Алматы, и тому, что посетил другие казахстанские города.Статья, может быть, получилось немного сумбурной, если где-то есть ошибки пишите в ЛС, если есть неточности - пишите в комментариях. "
]