[
   "Мини-ПК начала 2022 года, на которые стоит обратить внимание",
   "\r\nДесктопные ПК и ноутбуки подходят не всем, и не для любых целей. В некоторых случаях идеальный вариант — как раз миниатюрные персональные компьютеры, некоторые их которых можно носить в кармане. Причем среди подобных моделей встречаются вполне себе производительные устройства, которые позволяют запускать «тяжелые» приложения. Есть, конечно, и относительно маломощные девайсы, которые можно и нужно использовать в офисе для решения не самых сложных задач, на производстве и т.п. Вот о таких мини-ПК мы сегодня и поговорим. \n\nZotac ZBOX CI331\n\r\nЭто мини-ПК совсем уж небольшого размера, с пассивным охлаждением и процессором с низким энергопотреблением Celeron N5100, который базируется на архитектуре Jasper Lake. Идеальный вариант для работы с задачами, которые не требуют огромной производительности — для дома и офиса. Система поддерживает работу одновременно с тремя дисплеями, так что девайс можно использовать в качестве медиацентра. \n\r\nZBOX CI331 можно купить в версии без ОЗУ и SSD, а также уже укомплектованным. Поддерживает девайс вплоть до 16 ГБ DDR4-2933. Есть слот для жесткого диска или SSD. Кроме того, девайс оснащен Gigabit Ethernet, беспроводными модулями связи WiFi 5 и Bluetooth 5, плюс следующим набором портов и разъёмов:\n\n\n 1 x USB 3.0 Type-C (передняя панель)\n 1 x USB 3.0 Type-A (передняя панель)\n 2 x USB 3.1 Type-A (задняя панель)\n 1 x USB 2.0 Type-A (задняя панель)\n 1 x 3.5mm mic input\n 1 x 3.5mm audio output\n 1 x HDMI 2.0b (3840 x 2160 @ 60 Hz)\n 1 x DisplayPort 1.2 (4096 x 2160 @ 60 Hz)\n 1 x VGA (1920 x 1080 @ 60 Hz)\n\n\r\nРазмеры — 5.3″ x 5″ x 2.2″, так что устройство можно закрепить позади монитора и работать в тихой и уютной обстановке. \n\r\nСтоимость мини-ПК составляет $260. \n\nTopton M6\n\r\nЕще один мини-ПК небольшого размера. Размеры его корпуса сравнимы с размером обычного iPhone, который не Max и не Pro. Внутри — не особо прожорливый процессор Intel Celeron N5105 с четырьмя ядрами, поддержка вплоть до 16 ГБ памяти, плюс слот для PCIe NVMe.\n\r\nПродается девайс на Aliexpress, выбрать можно один из четырех вариантов — с Windows 10 Pro, Windows 11 Pro, Ubuntu или вообще без ОС. Базовая модель оснащена 8 ГБ LPDDR4-2933, но не имеет SSD, так что накопитель придется добавлять своими силами. \n\n\r\nРазмер корпуса — 150 x 80 x 19 мм, вес — 195 граммов\n\r\nНесмотря на размер, устройство оснащено активной системой охлаждения, хотя разработчики и постарались сделать его бесшумным. Еще есть беспроводный модуль связи с WiFi 6 и Bluetooth 5.2, плюс — вот такой набор портов и разъёмов: \n\n\n 1 x HDMI 2.0\n 1 x USB Type-C (full function)\n 1 x USB Type-C (power input)\n 3 x USB 3.1 Gen 2 Type-A\n 1 x 3.5mm audio\n 1 x 2.5 Gbps Ethernet\n\r\nДевайс поддерживает работу с двумя дисплеями 4K/60Hz благодаря наличию HDMI и USB-C портов. \n\r\nСтоимость базовой модели — $200. \n\nЕсли вы читаете наш блог, вас могут заинтересовать эти тексты: \n\r\n→ Как мы выбирали лучшие из новых видеокарт NVIDIA \r\n→ Зачем дата-центры устанавливают динамические источники бесперебойного питания \r\n→ Стоит ли создавать собственный корпус для сервера \n\nASRock NUC 1200 BOX\n\r\nНу а это уже тяжеловес в среде мини-ПК. Девайс оснащается процессорами Intel Core 12 поколения, вплоть до 28-Вт, 12-ядерного Intel Core i7-1260P Alder Lake-P. Корпус небольшой — всего 118 x 110 x 48 мм. Устройство поддерживает вплоть до 64 ГБ DDR4-3200. Плюс разработчики предусмотрели сразу два слота — M.2 для PCIe Gen 4 x4 SSD и 2,5-дюймовый слот для жесткого диска. \n\r\nНабор портов и разъёмов:\n\n\n 1 x HDMI 2.0b\n 1 x DisplayPort 1.4a\n 2 x USB 3.2 Gen 2 Type-C (w/DisplayPort 1.4a alt mode)\n 3 x USB 3.2 Gen 2 Type-A\n 2 x 2.5 Gbps Ethernet\n 1 x 3.5mm audio\n 1 x DC power input\n\n\r\nЕсть беспроводный модуль связи с WiFi 6E и Bluetooth 5.2. Можно выбрать модель с любым из ряда процессоров Intel Core i3-1220P, Core i5-1240P, Core i7-1260P. Насколько можно понять, устройство оснащено материнской платой из новой линейки ASRock NUC 1200. \n\r\nК сожалению, о стоимости устройства пока ничего не известно, но вряд ли этот мини-ПК будет недорогим. \n\nGMK NucBox2 Plus\n\r\nВ отличие от предыдущего устройства, этот мини-ПК можно назвать крепким середнячком. Он оснащен процессором Intel Core i5-8279U Coffee Lake. Внутри — 16 ГБ DDR4-3200 RAM, 512 ГБ PCIe NVMe SSD, плюс предустановленная Windows 11 Pro. Габариты — 125 x 112 x 50 мм. Девайс предлагает пользователю вот такой набор портов и разъёмов: \n\n\n 1 x Thunderbolt 4\n 4 x USB 3.2 Type-A\n 2 x HDMI 2.0\n 1 x Gigabit Ethernet\n 1 x 3.5 мм аудио\n 1 x DC \n\r\nМодуль беспроводной памяти — Intel AX201 с WIFI 6 и Bluetooth 5.2. Стоит также отметить, что устройство поддерживает не только Windows, но и Linux, а также другие операционные системы. \n\r\nА, ну да, и стоимость — $700.\n\nKingdel M6S\n\r\nЕще один мини-ПК с процессором N5105. Оснащен он 8 ГБ ОЗУ, работать может одновременно с двумя дисплеями с разрешением вплоть до 4К. В целом, тоже крепкий середнячок, который способен на выполнение широкого спектра задач как в офисе, так и в домашних условиях. Набор портов разъёмов стандартный: \n\n\n 2 x HDMI 2.0\n 1 x USB Type-C\n 3 x USB 3.0 Type-A\n 1 x Gigabit Ethernet\n 1 x 3.5mm аудио\n 1 x microSD card reader\n\r\nБеспроводный модуль связи поддерживает WiFi 5 и Bluetooth 4.2. ОЗУ — 8 ГБ Kingdel M6S максимум, проапгрейдить нельзя. SSD — M.2 2242 (апгрейдить можно). Вот стоимость устройств с разным набором характеристик: \n\n Kingdel M6S с 8 ГБ ОЗУ, 128 ГБ SSD за $273\n Kingdel M6S с 8 ГБ ОЗУ, 256 ГБ SSD за $317\n Kingdel M6S с 8 ГБ ОЗУ, 512 ГБ SSD за $334\n Kingdel M6S с 8 ГБ ОЗУ, 1 ГБ SSD за $450\n\r\nВес девайса — всего 125 гр, его можно установить на задней стенке монитора, так что мини-ПК не будет видно. Правда, слышно будет — система оснащена достаточно мощным кулером. \n\nDeskPi Lite\n\r\nНу и завершим подборку не совсем мини-ПК. DeskPi Lite представляет собой корпус для Raspberry Pi 4 Model B с расширением возможностей последнего. Дело в том, что в корпусе есть дополнительные платы расширения, которые подключаются к «малинке», после чего система превращается в мини-ПК с: \n\n\n2 x extra USB Type-A \n2 x micro HDMI, преобразованные в полноразмерные HDMI порты\nGPIO \n\r\nЕще есть светодиоды, которые отображают статус работы устройства, кнопка включения и слот для карт памяти. Ну а стоит все это счастье около $30. \n\n "
]