[
   "Нам нужен другой 1С-Битрикс, часть 2",
   "После публикации первой статьи в деле борьбы за права причастных к 1С-Битриксу появились соподвижники Dekmabot и Sergik_DS со статьями «Почему Битрикс — Битрикс» и «За что, Битрикс? Или сказочный мир 1С», чему я несказанно рад. Как там пишут в руководствах по зачинанию стартапов – найдите боль клиента и работайте направлении её ликвидации. 1С-Битрикс уже давно не стартап, но боли различного вида, характера и степени тяжести пока ещё почему-то с нами.\n\r\nВ принципе, любая админка с формами и полями ввода сама по себе вещь простая, но сделать её удобной могут не только лишь все. На комфортный регулярный ввод данных влияет много вещей – навигация между разделами, порядок полей в форме, интерактивные отклики на действия пользователя, виджеты ввода специальных форматов (например даты или времени), расположение и цвет кнопок и т.д.\n\r\nВ битриксовой админке на мой субъективный взгляд тема юзабилити до конца не проработана. Почему при добавлении товара первым номером идёт активность товара и даты начала-конца активности? Это параметры первой необходимости для нового товара? Раз товар добавляют впервые, само собой разумеется, что в подавляющем большинстве случаев это будет активный товар, значит галочку активности можно сдвинуть ниже по списку. В редактирование товара мы приходим из таблицы, где информация по активности уже есть, только значения да/нет в таблице плохо считываются, как по мне лучше поменять на задизайненные галочки. И даты активности в форме ввода товара стоит задвинуть ниже, кому надо, тот поставит. Первым номером должно идти поле ввода «Название товара» и на него сразу обязан вставать курсор мыши при добавлении нового товара. И в целом курсор в основное поле ввода надо автоматом ставить во всех формах 1С-Битрикса при создании чего-либо, будь то скидка или раздел. Далее базовая цена и валюта из вкладки Торговый каталог, единица измерения и доступное количество (для простого товара), и тут же, а не где-то там на другой вкладке – детальное описание и детальная картинка, а также описание для анонса. То есть сделать по принципу все самые важные и востребованные данные по товару в одном месте. Сейчас они раскиданы по 5-ти вкладкам, вы их по-программистски сгруппировали. А надо смотреть с позиций контент-менеджера, который всем этим счастьем пользуется, у него на вкладке «Товар» нет цельной картины. Возможно стоит для свойств товара в их параметры в инфоблоке добавить группы свойств для группировки на странице «Товар», сейчас они идут чохом в порядке сортировки и группировать их можно только на вкладках. Я на истину не претендую в данном вопросе, но парадокс состоит в том, что ни один из разработчиков админки 1С-Битрикса не добавил в ней сам и ручками хотя бы под сотню товаров. Вы скажете, что админку можно как угодно кастомизировать, на что я отвечу, что надо сразу делать максимально удобный интерфейс.\n\r\nВ скидках при выборе конкретных товаров вообще беда. Выбор товара в этой же форме не отменяется. Типа раз кликнул и промазал – делай скидку. Одни и те же товары могут попадать в скидку дублями – проверяйте пожалуйста товары на уникальность. При нажатии на ссылку «Выбрать» всё время срабатывает «Развернуть», потому что разворот торговых предложений настроен на одинарный клик по всей строке. И подсказка-hint нам нагло врёт, что на двойной. Сама ссылка «Выбрать» без отступов типа padding, то есть для её срабатывания надо прям чётко попадать мышкой в слово, чутка промажешь – будет выполнено «Развернуть». Это я в юности в игре «Сапёр» рекорды ставил, а обычные люди просто бьют своих ни в чём не повинных мышек. В списке выбора конкретных товаров для скидки надо помечать товары, которые подпадают под уже существующие скидки. Прям столбец с номерами правил корзины и подсказки-названия правил при наведении мыши напротив каждого товара. Чтобы пользователь не засуммировал скидки к уже существующим. А куда при пагинации окно ввода товара убегает? И хорошо так бежит, прямо вниз за границу экрана. При повторном заходе в выбор товаров для скидки подсвечивайте ранее выбранные товары.\n\r\nА кэш почему так долго чистится через админку? Я же не по FTP файлы удаляю, в самом-то деле, а прямо на сервере. Реорганизуйте его как-нибудь, пусть возможно будет мгновенно всё содержимое папок с кэшем грохать без ущерба для работы сайта. У меня нет столько времени ждать его сброса, чтобы увидеть наконец актуальные данные на сайте.\n\r\nПочему группа действий в скидках не работает? Типа сумма заказа больше 5 тыс. руб. – скидка 500 руб., больше 10 тыс. руб. – скидка 1 тыс. руб., больше 15 тыс. руб. – скидка 1500 руб. Как-то сложно это всё запрограммировать, фрактальная математика используется?\n\r\nКстати вот здесь на скриншоте не «Добавить действие», а «Добавить условие». Не надо путать причину и следствие, особенно не надо путать следствие.\n\n\n\r\nИ теперь прикладно-предметно. Свойства в GetList D7 – они когда? Почему добропорядочные программисты вынуждены использовать старые методы? Хорошая же штука, доведите её до логического завершения. Кастомизация Sale Order AJAX – все же вешаются и ботами почти уже качают – переделайте данный шаблон для людей, сейчас это ров с водой и кольями на пути к готовому интернет-магазину. Начните с полной и понятной документации к текущему шаблону Sale Order AJAX, с подробными примерами. А то вы как мой папа, он мне лет до 18-ти вещи приносил в безакцептном порядке, дескать на, сынок, носи на здоровье. А какие у меня там вкусы и желания, его не волновало. В общем подход в стиле «ешьте, что дают» – неправильный. Почему установщик bitrixsetup.php отваливается на середине установки с ошибкой синтаксиса массива на PHP старой версии 5.3 (которая например по умолчанию на РЕГ.РУ для новых сайтов), а не проверяет сам версию PHP на старте с выдачей соответствующего предупреждения? Ну или массивы там все переписать в старом синтаксисе, если хотите блюсти совместимость. Я знаю, что у вас где-то там на сайте написано про PHP минимум 7.1, вы установщик сделайте с учётом наличия начинающих осваивать 1С-Битрикс.\n\r\nА как вы реагируете на внешние вызовы. Вот я написал негативную статейку на Хабре, 20 тысяч её отсмотрело. Кто-то более, кто-то менее внимательно. И никто от вашей фирмы не отписался, как будто и нет вас в природе. Хабр — это же ваша поляна, здесь ваши программисты, на которых всё держится. На VC правда на аналогичную публикацию пришёл Юрий Волошин (руководитель отдела продукт-менеджемента 1С-Битрикс), пару комментариев написал в стиле «да всё у нас есть и работает», но потом соскочил с обсуждения. Я искренне надеюсь, что он пошёл ставить задачи по прочитанному отделу продукт-менеджемента. Однажды я на персональной страничке в Facebook описал, как МТС подключила мне какую-то фигню и украла деньги, и что я перешёл вместе с номером на Tele2. На Facebook у меня всего-навсего 42 друга, никто особо не читает мои измышления. Дак тут же прибежала менеджерка, давайте в личку, давайте в личку, всё обсудим, давайте в личку. Попробуйте на VC написать что-нибудь про банк Тинькова – мгновенно прискачет представитель – дайте ваши данные, мы будем разбираться. Это значит, что они в реальном времени мониторят и плотно сотрудничают с администрацией соцсетей и медиа-ресурсов. А вы чего не реагируете, думаете само рассосётся, как после сеансов Кашпировского?\n\r\nГде ваша техподдержка? Люди вам бесплатно несут информацию по улучшению продукта, находят баги, нате, правьте, совершенствуйтесь. Вот мой приятель нашёл косяк в работе вашей фичи – тегированного кэша. Который не пашет при многосайтовости и включённом memcached. Точнее пашет только для основного сайта, а все остальные обновляйтесь, как хотите. Написал он вам про ошибку в конце июня месяца, вы за неделю признали проблему и передали на разработку. Сейчас у нас пошёл ноябрь, и мне кажется уже пора обновить кэш у ваших разработчиков, а то они на старые и готовые задачи смотрят, а новых похоже не видят. Вы там в 1С-Битриксе я думаю догадываетесь, как называется состояние организма, когда в нём перестаёт работать очень важный орган.\n\r\nЯ понимаю, что вы там вдарились в разработку и продвижение Битрикс24, но, как говорится, вы ещё за то дело не отсидели. Что, кстати с взаимодействием между 1С-Битриксом и Битрикс24. Почему я должен закупать аж 2 сторонних модуля синхронизации свойств и статусов заказов? Вы же одна контора, вот и делайте смычку, наводите мосты между продуктами. Битрикс24 хотите же продвинуть, вот и подсаживайте граждан на неё опосредованно. А то недавно модули эти начали все скидки сбрасывать у заказов в 1С-Битриксе при смене статуса заказа в Битрикс24. Может это конечно новая стратегия монетизации клиентов такая.\n\r\nИтого. У вас есть 1С-Битрикс и ни в какой новый и беззаботный Битрикс24 вы от него не убежите в ближайшие лет 5, а то и 10. Поэтому надо сделать над собой усилие и допилить, стартовый перечень прилагается. Я по себе знаю, что когда сделал 95% задачи, то доделать как следует оставшиеся 5% весьма и весьма нелегко. Но надо, дорогие калининградские битриксоиды, надо.\n\r\nP.S. Специально поменял на полное название бренда, может Москва подтянется.\n\r\nP.P.S. И ещё. Без всех перечисленных мной в обоих статьях косяков вашей платформы жить можно, люди конечно страдают, ропщут, но как-то справляются. Но не устаю повторять, если вы сделаете оптимизацию размера картинок без потери качества на уровне платформы, с конвертацией в реальном времени и близкую по результату к tinyjpg.com – тогда бренд 1С-Битрикс и ваши фамилии отзовутся эхом в вечности. "
]