[
   "Наполнение битрикса через внутренние механизмы интеграции с 1С без 1С",
   "В данной статье мы расскажем вам о своем опыте интеграции с Битриксом и о некоторых особенностях этой системы с точки зрения интегратора. Наша компания занимается информационной поддержкой e-commerce каталогов, а по-простому мы наполняем интернет магазины и электронные каталоги автоматически, используя внутренние продукты. В наши обязанности входит наполнение интернет магазинов товарами, интеграция баз поставщиков с базами магазинов, анализ прайсов конкурентов, актуализация склада, цен и др.\n\r\n Следует также отметить, что у нас уже были клиенты, e-commerce приложения которых работали на базе Битрикс. Однако они почему-то всегда просили нас предоставлять данные в виде текстовых файлов разного формата. Мы так и делали и всех все устраивало. Однако все же возникал закономерный вопрос: Почему битрикс один, а форматы у всех разные?\n\r\nИ наконец, одному из наших заказчиков потребовалось организовать импорт данных напрямую в Битрикс. Мы скачали Демо-версию Битрикса для магазинов и выяснили, что в нем есть возможность импорта данных csv формате. А так как в этот формат мы уже давно и успешно используем, то и было решено воспользоваться им для решения нашей задачи. Оценив стоимость проекта и уточнив все детали с заказчиком, мы принялись за работу.\n\nПробуем CSV.\n\r\nНачав реально заливать данные было выяснено, что использовать csv формат не очень удобно, ввиду требования заказчика переносить и параметры товаров. csv отбросили потому, что импортировать товары с параметрами очень неудобно в этом режиме, битрикс требовал непонятные заголовки для csv файла, а они были более похожие на внутренние названия полей и разбираться с этим сразу не было желания и маловероятно, что этот бы способ принес требуемый результат. Т.е. если вам нужно сделать простой импорт где требуется перенести “Название товара”, “описание”, “цену” и “картинку” – то да – этот способ подойдет, но если что-то большее, то уже надо искать другой способ.\n\nБитрикс поддерживает следующие варианты импорта, это мы выяснили уже изучив систему более подробно:\r\n — Импорт через csv;\r\n — Импорт CommerceML;\r\n — Импорт XML;\r\n — Импорт через 1С.\n\r\nСразу скажу, что в конечном итоге выбрали импорту товаров в магазин через 1С, а вот почему – читайте ниже.\n\nИмпорт используя CommerceML.\n\r\nЭтот способ который изначально казался наиболее перспективным, в интернете много различных статей о том, что есть CommerceML формат и как классно, что он вот такой единый формат для e-commerce. Странно правда, что официальный сайт этого формата не открывался, но честно нашли и скачали xsd формат, нашли несколько примеров и начал анализировать. Первое что вызывает культурный шок – это русский язык в названиях тегов, но сделав ставку на локальность продуктов и доступность их для пользователей можно принять, что для русскоязычного населения и соответственно пользователей этот способ наиболее подходящий. Далее сделали руками несколько тестовых файлов и начали тестировать заливку. Она не работала как нам нужно было и не было понятно почему нельзя залить сразу цены и склад.\r\n Методом проб и ошибок подложили тестовый CommerceML файл в импорт XML и о чудо – что-то начало отображаться на сайте как нам хотелось, но все еще не удавалось отобразить цены – только номенклатура висела на сайте. Это подсовывание CommerceML файл в импорт XML работало, но чувствовалось что что-то не таки так не должно быть.\n\nМеханизмы 1С.\n\r\nПозже выяснилось, что есть способ которым пользуются чуть ли не все – а это выгрузка из 1С. Разобравшись, что выгрузка состоит из двух файлов import.xml и offers.xml и сделав примеры этих файлов начали опять тестировать их на реальном сайте битрикса поочередно подсовывая то в процедуру импорта CommerceML, то в процедуру импорт XML, а требуемый результат так и не получался. Где-то на форумах встретилась фраза о том, что процедура импорта CommerceML требует формат файла 1.х, а тот который мы генерировали – был версии 2.х, поэтому я начали разбираться, а как же импортироваться эти import.xml и offers.xml, которые были явно валидные, но почему-то все никак не хотели отображаться в магазине.\r\n Явно поняв, что следует научиться импортировать именно эти два файла и зная, что они генерируются из 1с, появилось понимание что необходима 1с чтобы их заимпортировать. 1С это умеет делать через веб. 1С получает в качестве параметра ссылку на веб обработчик (можно сказать сервис), в процессе импорта 1с передает файлы на сайт, а потом последовательно импортирует два файла. Я уже хотел писать программу эмуляции 1с, но вдруг наткнулся на интересное расширения для битрикса, которое эмулирует работу импорта из 1с прямо из битрикса! Бинго, теперь все сошлось.\r\n Далее будет описан процесс настройки процесса импорта из файлов import.xml и offers.xml без 1с в магазин под управлением битрикса, без использования 1с.\n\nВажные шаги процесса импорта в битрикс механизмом через 1С:\n\r\n1) Для того чтобы обойтись без 1С следует использовать великолепное расширение – bx_1c_import_lite.php (ссылка на него в конце статьи), его копируем в корень и далее открываем в браузере. Открыв эту ссылку мы получает возможность импорта файлов import.xml и offers.xml.\n\n\n\r\n2) Согласно документации файлы import.xml и offers.xml следует скопировать в папку uploads/1c_catalog, но на деле получилось, что нужно это два файла копировать в корневую папку 1c_catalog, предварительно ее создав.\n\r\n3) Далее следует дать пользователю (в нашем случае Администратору) возможность импорта (задаем права доступа) через интерфейс 1с, показано на следующей картинке.\n\n\n\r\n4) Следующая задача которую необходимо решить — отображения каталога, этот пункт в действительности мы сделали в самом начале наших исследований битрикса, но важен он именно здесь и сейчас. Для отображения каталога следует выбрать правильные компоненты отображения, общая идея настройки показана на следующем рисунке:\r\n т.е. надо открыть страницу catalog в визуальном редакторе, после этого поменять визуальный компонент этот страницы на “каталог” из доступных компонентов, на рисунке они справа. После этого перетащив компонент на страницу, двойным кликом по нему начать редактирования, задав последовательно все требуемые настройки.\n\r\n5) Свойства. В действительности на данном этапе нам требовалось засветить на сайте более одной тысячи свойств на карточках продуктов. А Светилось только Артикул и Цена, хотя в админке показывалось что на товаре свойства есть и свойства есть на инфоблоке каталога. Впоследствии выяснилось, что свойства в битриксе отображаются на странице товара только если им задан “Мнемонический код свойства”. Выставив парочку руками и убедившись в правильности выставления, мы произвели попытки найти как выставить эти свойства через файлы import.xml и offers.xml, но ничего подходящего не нашли, после чего был написан следующий скрипт который заполнял в странице браузера мнемонические коды автоматически (странно что в битриксе нет такой функциональности из коробки), \nвот код JavaScript:\n\nvar elems = document.getElementsByTagName(‘*’);\r\n var t = 0;\r\n for(var i=0; i<elems.length; i++)\r\n {\r\n var el = elems[i];\r\n if (el.type == ‘text’)\r\n {\r\n if (el.value == »)\r\n {\r\n el.value = ‘CATL_’ + t;\r\n t = t + 1;\r\n }\r\n }\r\n }\r\n alert(t);\n\r\nСобственно на этом весь процесс наполнения битрикса и заканчивается мы получили то, что требовалось, а именно, красивую карточку товара, с большой картинкой и правильной ценой, складом и красивым отображением свойств. Пример одной из карточек товара показан на следующем изображении:\n\n\n\r\nПолучив опыт первого знакомства с битриксом хочется поделиться своими впечатлениями о системе (с точки зрения интегратора и поставщика данных):\r\n 1) Битрикс имеет огромные возможности прямо из коробки;\r\n 2) Изначально Битрикс – это CMS общего назначения и для использования в качестве магазина следует делать косметические настройки после инсталляции;\r\n 3) Битрикс – это для бизнеса. Огромное число студий, которые работают с битриксом. У них всегда можно заказать разработку и консультации;\r\n 4) Поддержка формата CommerceML 2.0 используемый битриксом во время импорта через 1С – это лучший из тех с чем нам приходилось работать (а сегодня мы поддерживаем 17 cms), ну а сама реализация просто великолепна.\n\r\nВ конце мы получили счастливого заказчика с наполненным магазином и что важно — опыт работы с битриксом. Надеюсь статья будет полезной для всех интегрирующихся с битриксом, потому что описывает основные моменты, которые можно не заметить сразу при знакомстве с этим продуктом.\n\nИспользованные ссылки:\n\nhttp://habrahabr.ru/company/bitrix/blog/131344/\nhttp://dev.1c-bitrix.ru/community/webdev/group/78/blog/1654/\nhttp://catalogloader.com "
]