[
   "Некрополис в 3D",
   "Всем привет, это Денис Вебер.Какое-то время назад я создал в 3D один из городов из игры Герои 3. Этот проект так понравился читателям, что я решил продолжить серию и на этот раз смоделировал город Некрополис. Герои 3 - это тот тип игр, которые спустя время становятся только лучше. Игра, которой уже больше 20 лет и сейчас выглядит достойно и играется интереснее, чем многие современные. В 2014 году, в честь пятнадцатилетия проекта, разработчики обновили оригинальную игру, выпустив HD версию для Windows и версии для мобильных платформ и уже новое поколение смогло погрузиться в этот увлекательный фэнтезийный мир.Какое-то время назад мне пришла в голову идея посмотреть на то, как бы выглядел город из игры в 3D и я полностью повторил все здания в Оплоте. Вы можете найти статью про создание Оплота по ссылке.Тема с городом из Героев в 3D так понравилась читателям, что я решил продолжить серию и в этот раз принялся за создание не менее популярного и любимого многими Некрополиса.Как актёры в Голливудских фильмах готовятся к ролям, так и художники, аниматоры и другие люди творческих профессий перед началом работы черпают вдохновение в самых разных источниках.3D моделлеры здесь не исключение. Кому-то достаточно пересмотреть десятки картинок \"по теме\", а я просто запустил Герои 3 и несколько часов играл за нежить в Некрополисе (который переведя на русский можно назвать Некрополь).При строительстве зданий в городе на общем плане они перекрывают друг друга и по картинке, где изображены все постройки трудно разобрать некоторые детали, поэтому я заскринил все этапы строительства для каждого из зданий и начал со схематичного моделирования всего города.Идея была в том, чтобы разместить обычные геометрические 3д фигуры на местах, где должны находиться постройки, а потом смоделировать каждую из них и поставить на своё место. В итоге всё получилось не совсем так, как я планировал, но общее представление о расположение строений я получил.Как и в прошлый раз, я решил создавать модели зданий по порядку, так, как они отображаются в списке. И начал я с Капитолия. Он имеет несколько стадий постройки и в своей финальной версии ежедневно приносит в казну 4000 золотых монет.Здание вполне себе устрашающего вида по всей видимости должно показывать всю мощь города. Думаю, что его можно сравнить со зданием администрации, для которой кто-то из жителей пожертвовал свой огромный череп, украшающий фасад.Кстати, черепа и кости - отличительный знак убранства Некрополиса. Эти так называемые атрибуты можно встретить повсюду. Они украшают здания, разбросаны по земле и вообще где только возможно. Чуть позже я создам скелета целиком, но, а пока я начал с моделирования черепа. Я не силён в анатомии, поэтому пришлось постараться.Следующее здание на очереди - Замок. По мере совершенствования постройки, он повышает обороноспособность города и увеличивает недельный прирост юнитов. Думаю, что это самое крупное здание, в котором кроме больших площадок и ворот, есть целая система башен. На стенах замка висят фонари, которые в игре выключены, но я решил добавить немного разнообразия и зажёг их на финальном рендере, добавив нужного антуража.Таверна - место, где можно нанять новых героев. Прямо представляю как рыцари смерти, некроманты и скелеты с ужасными лицами сидят, весело общаются и пьют бок о бок в небольшом помещении с витражными окнами. С точки зрения моделирования со зданием не возникло особых проблем. В нём, как и в других постройках выдержан стиль ранних незапамятных времён.Судя по легенде, города Некрополиса вполне могли быть построены людьми. А уже нежить, когда оказалась на этих землях, оборудовала их под свои нужды. Поэтому этот гроб для кузницы, в своё время вполне мог быть добавлен просто для удобства вампиров. Кузница наверное самое жуткое на вид здание. По бокам расставлено подобие барбер поулов, которые вешают на здания парикмахерских, а из них прямо в гроб проведены трубки, видимо с кровью. Здесь можно купить палатку первой помощи. Ну что ж, всё сходится.Несмотря на отталкивающий вид всех существ Некрополиса, у них есть рынок в обычном понимании этого слова. На рынке можно продавать или обменивать ресурсы. Все фракции в игре живут, на самом деле, с настоящими рыночными отношениями. Рынок состоит из нескольких построек, небрежно разбросанных друг рядом с другом. Непонятно какая из них за что отвечает и я решил просто повторить все так, как они показаны в игре.Гильдия магов содержит в себе пять уровней и на каждом из них герой может изучать случайные заклинания. Если в Оплоте каждый уровень был похож на предыдущий и было достаточно просто скопировать созданную модельку, изменив для неё размер, то в Некрополисе каждый новый уровень отличается от предыдущего. Местные архитекторы постарались и добавили на каждый этаж окна разного размера и формы. Само здание стоит на величественном постаменте с забором и несколькими колоннами. По моему скромному мнению Гильдия магов самая красивая и самая величественная постройка в городе.Мне всегда казались чем-то незначительным постройки типа усилителя некромантии. Но если разбираться во всех тонкостях игры и следить за навыками и показателями существ, усилитель может помочь в определённых моментах. Если не вдаваться в подробности, эта постройка нужна для того, чтобы после боя восстановить часть погибших юнитов, обычно скелетов.С помощью верфи игрок может строить корабли. Замок в этом случае должен иметь выход к воде, что очень даже логично. Будем считать, что замок в моём проекте стоит точно на берегу рядом с водоёмом, да и с другой стороны - почему бы не показать все здания Некрополиса. Конечно называть эту постройку верфь не поворачивается язык. Это просто несколько старых, сколоченных наспех досок. В лучшем случае причал. Здесь некроманты себе польстили.Ещё одно здание, предназначение которого не сразу понятно - это Вуаль Тьмы. Она скрывает от противников город игрока и местность вокруг него. На самом деле такие, с первого взгляда, не самые нужные здания дают нехилое преимущество тем, кто играет за Некрополис. В финальном рендере я не стал создавать дым, идущий из трубы Вуали, потому что этот замок и скрывать то не от кого, но, в остальном, постарался повторить её точно также, как в игре.Я смоделировал почти половину построек и на очереди Проклятый храм. Мы с вами дошли до зданий, которые позволяют нанимать армию. В Проклятом храме, а потом и Улучшенном проклятом храме можно нанимать самых популярных на мой взгляд существ в игре: скелетов и скелетов-воинов. Здание с большим количеством колонн и покатой крышей из мрамора выглядит солидно.В улучшенной версии храма на входе стоят два скелета в полный рост. Как вы могли догадаться, познаний в анатомии со времён создания черепа у меня не прибавилось, поэтому пришлось импровизировать и создавать скелетов по референсам, пытаясь максимально к ним приблизиться. Совсем скоро вы узнаете удалось ли мне сделать что-то похожее на скелетов вообще.Зомби и живые мертвецы обитают на кладбище - это всем известный факт. Здесь всё просто: ограда, пару деревьев и пару 3D гробов. Можно было бы посадить на одну из веток, например, ворона-скелета, но это об этом просит моя больная фантазия и я оставлю такие идеи на потом.Стражей или их улучшенных версий - Призраков можно нанять в Пристанище душ. Это те самые существа, которые восстанавливают своё здоровье и питаются жизненными силами других живых существ, а улучшенная версия может ещё и поглощать магию противника. Не самое практичное для проживания здание, которое больше похоже на объект загробного искусства.Здание Поместье напомнило мне Усадьбу их Оплота. Есть вероятность, что их рисовал один и тот же художник. Добротная постройка в два этажа с гробами на крышах выглядит жутко и в то же время статно. В Усадьбе можно нанять Вампиров и Вампиров-лордов. Из всех небольших зданий в игре, это больше всего похоже на то, где вообще возможно жить.Я всегда представлял себе Мавзолей немного по-другому. Здесь же он выглядит максимально агрессивно. На постаменте постройка в виде пирамиды с окнами и решётками на них, вместо верха пирамиды на золотой подставке установлен большой череп. Даже описание Мавзолея звучит мрачно. В нём можно нанять Личей и их улучшенные версии. Хоть Личи и обладают достаточно низкими характеристиками, их плюс в атаке на расстоянии. Выпуская облако смерти, они могут задеть сразу несколько юнитов. Нужно не забывать, что у них включен Frendly Fire и по невнимательности можно задеть и союзников.Во Дворце тьмы или по-другому Храме тьмы можно нанять Рыцарей. Это наездники в доспехах, верхом на чёрных лошадях. Они полководцы, поэтому видимо и живут в таком огромном здании. Никогда не задумывались где тогда живёт сам герой? На фасаде храма висит два меча и щит, точно отличительный знак Рыцарей, а сам храм стоит обособленно от других зданий.Вот мы с вами и добрались до постройки с самыми мощными существами в городе. Костяные и Призрачные драконы живут в скале, в Склепе драконов. Если отбросить всю жуть, то склеп - это обычное гнездо с кормушкой перед ней. Наверное окно в скале должно открываться, но судя по всему оно просто заколочено и бедные драконы вынуждены искать другое место для того, чтобы вылетеить наружу.Те, кто играл в игру помнят, что открыв карту-загадку, игрок может получить обелиск, который сильно улучшает характеристики города. Например, обелиск Темница Душ наполовину увеличивает прирост юнитов и добавляет в казну по 5000 золотых монет каждый день. Найти обелиск не так сложно, а польза от него достаточно большая.В Некрополисе просто огромное количество надгробий нежити. Я потратил ещё какое-то время, чтобы добавить и их и приступил к созданию ландшафта.Мне оставалось добавить небольшие постройки вроде Разрытых могил и Преобразователя скелетов, а потом создать скалы, выставить освещение и конечно же настроить все текстуры.Я пропущу этот интересный, но достаточно монотонный процесс и покажу вам финальный результат прямо сейчас: "
]