[
   "Некоторые приёмы работы в Битрикс на SQL и BASH",
   "Я продолжаю писать о Битриксе в контексте обменов, Mysql и командной строки Linux. \n\r\nЭта статья является вводной к серии статей о структуре базы данных Битрикс, где эта тема будет раскрыта достаточно подробно. Для начала же будут представлены решения некоторых небольших, но назойливых задач. Как всегда, знание SQL обязательно. \n\r\nВ статье рассматриваются довольно частные вопросы, которые не возникают ежедневно. Конечно, вы можете использовать эти материалы по их прямому назначению, но главная цель статьи не в этом. Я начинаю вскрывать «чёрный ящик» под названием «структура базы данных битрикс», и показывать, что эти знания могут пригодиться для повышения уровня владения как системой, так и базовыми технологиями (SQL, linux shell), что, конечно, помогает решать новые, сложные, интересные, разнообразные задачи.\n\r\nСтраница, с которой можно делать SQL запросы в базу, или mysql web клиент битрикс, находится в панели управления Битрикса по пути: «Настройки->Инструменты->SQL запрос».\n\r\nТакже, конечно, можно делать запросы из командной строки операционной системы, для чего могу предложить вам несложную операцию извлечения логина и пароля прямо из настроек Битрикса:\n\nlog=$(grep -i \"login\" /home/bitrix/www/bitrix/php_interface/dbconn.php | cut -f2 -d'\"')\npas=$(grep -i \"pass\" /home/bitrix/www/bitrix/php_interface/dbconn.php | cut -f2 -d'\"')\nmysql -u$log -p$pas $log\n\r\n — таким образом можно получить логин и пароль к базе данных Mysql Bitrix из командной строки linux на bash. Пути, конечно же, заменяйте на ваши собственные. В варианте, предоставляемом виртаульной машиной Битрикс, DOCUMENT_ROOT выглядит как /home/bitrix/www/.\n\n1. Настройка «Избранного» для всех пользователей панели управления Bitrix сразу.\r\nКогда вводится новый сайт, разработчику не хочется объяснять каждому, кто добавляет новости или редактирует страницы, что нужно нажать, чтобы попасть в новости или каталог товаров. Лучше вывести ссылки прямо на стартовую страницу панели управления битрикс, тем более, что в битриксе «рабочий стол» в админке для этого и предназначен. \n\r\nЕсли настройки так называемого «рабочего стола» можно распространить на всех, кто зайдёт в админку Битрикса, то колонку «Избранное» пользователь заполняет только для себя. Это логично, но обычно пользователи пренебрегают такой возможностью, поэтому сделаем эту работу за них. \n\r\nК тому же, не всё можно поместить на «Рабочий стол», а в «Избранное» можно добавить всё, что угодно, даже ссылку на сторонний ресурс, например, на почту или тикеты службы техподдержки другой системы.\n\r\nЗаполнить блок «Избранное» в админке битрикса именно для всех контент-менеджеров панель управления не позволяет: нет такой кнопочки. Поэтому, вначале добавим нужные ссылки в блок «Избранное» для себя.\n\r\nУзнайте ваш ID пользователя. Если вы под администратором (admin) в панели управления, то ваш ID пользователя =1.\n\r\nОчевидно, эти данные относятся к пользователю, и первый взгляд бросается на таблицы, начинающиеся с b_user_, которых в базе Битрикса с десяток. Однако, нужная нам таблица не имеет такого префикса и называется b_favorites. \n\r\nЭта таблица содержит поле COMMON, которое для всех записей имеет значение 'N'. Как обнаруживается, функция показа избранного для всех пользователей есть, и поле COMMON в таблице b_favorites полностью оправдывает своё наименование.\n\nupdate b_favorite set common='Y' where user_id=1;\r\nНам даже не нужно дублировать записи администратора для всех пользователей (а как тогда было бы с вновь заводимыми администраторами сайта?.. Делать mysql триггер?.. Заводить событие?...). Теперь все пользователи админки Bitrix видят те же самые «Избранные», что и вы. Задача решена.\n\n2. Как сменить логин и пароль пользователя битрикс через базу данных. Как сбросить пароль администратора Bitrix.\r\nЕсли вы не можете зайти в панель управления Битрикс, но база доступна, вы можете либо установить свой собственный пароль для пользователя, либо сделать его таким же, как у какого-то другого пользователя, пароль которого вы знаете.\n\r\nОсновные данные всех пользователей хранятся в таблице b_user. Вам нужно знать ID пользователя в системе Битрикс. \n\nУстановка собственного логина и пароля Bitrix средствами Mysql\r\nПароль хранится в базе в виде:\n\n<соль_строка>md5(<соль_строка><пароль>)\n\r\nГоворят, они что-то ещё изменили, но если вы сделаете так, то оно будет работать.\n\nupdate b_user set login='su',password=concat('12345678',md5('12345678stupidpassword')) where id=8;\nгде\r\n su — новый логин пользователя\r\n 12345678 — соль\r\n stupidpassword — новый пароль пользователя\r\n id=8 — id пользователя (если admin, то =1)\r\nПароль битрикс сброшен, задача решена. Заодно, вы можете изменить и логин.\n\nКопирование пароля от другого пользователя\r\nИ второй, очень простой, способ сброса пароля в битрикс. \n\r\nНа этот раз, нам нужно просто перенести хеш пароля от одного пользователя к другому. Конечно, нужно знать ID обоих пользователей в bitrix, в данном случае пользователю с ID=36 мы устанавливаем пароль от пользователя с ID=895.\n\nupdate b_user b1 inner join b_user b2 on b2.id=36 set b1.password=b2.password where b1.id=895;\n3. Применение настройки полей в редактировании заказа в Bitrix админке для всех пользователей.\r\nВ некоей доменной зоне второго уровня, на некотором сайте, в административной панели системы управления Битрикс располагается страница редактирования заказа интернет-магазина, в заголовке таблицы товаров которой есть кнопка настройки в виде шестерёнки, и бывает эта кнопка то синяя, то серая…\n\r\nНажав на эту кнопку, можно задавать поля заказа, которые будут выводиться в таблице, в том числе и пользовательские свойства заказа. Но при этом, задаётся это только для одного пользователя. \n\r\nЧтобы применить эти настройки ко всем пользователям панели управления битрикса, а не объяснять каждому, «нажмите маленькую кнопочку в заголовке таблицы с товарами, видите список свойств… Выберите нужные вам...», выставим настройки через базу.\n\r\nЭти настройки хранятся в таблице b_user_option, которые сопоставлены определённому пользователю посредством поля user_id. Но есть одна особенность: если user_id=0, то свойство — глобальное, и применяется для всех пользователей.\n\nupdate b_user_option set user_id=0 where name='table_columns' and category='order_basket_table' and user_id=1\r\nгде user_id=1 — ID пользователя, под которым вы настраивали таблицу товаров. Если это admin, то ID=1.\n\r\nЗадача решена: Теперь ваши настройки таблицы товаров работают у всех сразу.\n\n4. Сортировка результатов поиска в битрикс по собственному алгоритму.\r\nЕсли речь идёт о поиске по сайту, основной таблицей для модулей поиска в битриксе является b_search_content.\n\r\nИнтересные поля таблицы b_search_content:\n\r\ncustom_rank — поле, по которому сортировка работает прежде всех остальных полей\r\n param1 — код инфоблока\r\n param2 — номер инфоблока\r\n module_id — ='iblock'\r\n item_id — id элемента или раздела\r\n — для поиска в инфоблоках.\n\r\nПрежде всего нас интересует поле custom_rank. \n\r\nЕсли в предыдущих случаях мы пользовались предусмотренными, но нереализованными возможностями Битрикс, то для этого поля в панели управления специальная «галочка» есть. Но выставляется она отдельно для каждого элемента, и обычно этой возможностью не пользуются.\n\r\nЭто поле кстати оказывается числовым, так и заполним его по своему усмотрению, тем самым задавая собственные правила сортировки результатов поиска. По умолчанию, для всех элементов его значение равно нулю.\n\r\nВ моём случае, при поиске товаров в каталоге интернет-магазина, реализованном на решении разработчика romza, нужно было вначале выводить те товары, у которых была установлена некая специальная галочка, которая являлась «свойством», соответствующим наличию товара в определённой торговой точке. Прилетало всё это добро с инкрементальной загрузкой из 1С, поэтому данный SQL запрос был повешен на событие окончания обмена с 1С.\n\nupdate \n\tb_search_content sc\ninner join \n\tb_iblock_element_property elp on\n\t\telp.iblock_element_id=sc.item_id and\n\t\telp.iblock_property_id=<числовой_id_параметра>\nset\n\tsc.custom_rank=if(elp.value=<числовой_id_значения_параметра>,<произвольное_число>,0)\nwhere\n\tsc.param1='<код_инфоблока>' and\n\tsc.param2=<номер_инфоблока>\n \r\nВ настройке инфоблока должно быть указано «Значения свойств хранятся: в общей таблице (по умолчанию)», а не в отдельной таблице, иначе запрос будет выглядеть несколько по-другому. \n\r\nСейчас же, за счёт того, что запрос идёт вначале по таблице b_iblock_element_property, а не b_iblock_element, которая является основной для хранения элементов инфоблоков, мы отбираем только те элементы, у которых нужное свойство вообще есть, и если оно равно нужному значению, то поднимается custom_rank, в противном случае, он сбрасывается в ноль.\n\r\nВ моём случае задача решена, а для вас имеется полный простор для реализации своей собственной логики сортировки результатов поиска. А если вам не совсем знакомы эти наименования таблиц, то уже в следующей статье я раскрою их назначение более подробно.\n\nКак быстро почистить кеш в битрикс.\r\n«И на footer.php»: Очистка кеша в битрикс через панель управления происходит очень медленно. На самом деле, идёт всего лишь удаление файлов в определённых директориях, просто это делается медленными средствами. Сделаем специальный файл для очистки кеша в битрикс в командной строке linux.\n\ncd /home/bitrix/\ncat <<'EOF' > clearcache.sh\n#!/bin/bash\ncd $( dirname $0 )\nbasedir=$(pwd)/www/bitrix/\nfor d in cache managed_cache; do\nfind $basedir$d -mindepth 1 -delete\ndone\nEOF\nchmod 0775 clearcache.sh\n\r\nТеперь вы можете запустить ./clearcache.sh, и кеш битрикса очистится практически мгновенно.\n\r\nСкрипт этот должен лежать на одну директорию выше, чем DOCUMENT_ROOT вашего сайта. Хотя, вы можете изменить как место его нахождения, так и код, суть в том, что мы должны удалить все файлы из директорий:\n\r\ncache\r\n managed_cache\r\n stack_cache — раньше была ещё эта директория, но в последних версиях я её не наблюдаю, поэтому сейчас без неё.\n\r\nНа самом деле, если удалить и сами директории, ничего не случится, они пересоздадутся. Но более правильно их оставлять.\n\r\nВ виртаульной машине Битрикс DOCUMENT_ROOT равен /home/bitrix/www/, если же у вас сайт установлен в другую директорию, скорректируйте скрипт согласно вашим путям. "
]