[
   "О мере успеха. Градусные экспедиции: завершение",
   "Это завершение рассказа о Великих градусных экспедициях XVIII века, которые должны были определить, сплюснутая Земля или вытянутая. Публикация работУже в августе 1737 года Лапландская экспедиция возвращается в Париж. И Мопертюи тут же начинает давать концерты, то есть, популярные лекции о своем путешествии. Он спешит взять публику, пока горячо. Вольтер устраивает своему другу целую медиа-кампанию. Пишет фантастическую работу “Микромегас”, где великана измеряют геометры, подозрительно похожие на наших лапландских астрономов. Есть там, к примеру, такой пассаж:“геометры забрали свои секстанты, квадранты и лапландских девиц и спустились на пальцы великана”.Кстати, про лапландских девиц - запомните. Они сегодня еще прозвучат.В начале следующего, 1738 года, выходит книга Мопертюи “Фигура Земли”, где он рассказывает о своем путешествии, измерениях и результатах. Газеты публикуют многочисленные тизеры, тираж расходится, как горячие пирожки. Чтобы увеличить охват аудитории, книга публикуется сразу во французской, английской и немецкой версиях. Не обойдется без отзыва от Вольтера. Знаете, как бывает, когда на обложке печатают лестные отзывы именитых критиков? Вот он:\"Я прочитал историю о физике, куда более увлекательную, чем любую художественную повесть. Ваше предисловие заставляет в нетерпении ожидать путешествия в Лапландию. Как только читатель оказывается там с вами - он с вами в зачарованной стране, где философы и являются феями. В возбуждении и страхе, я иду за вами по порогам и водоворотами, карабкаюсь на обледеневшие горы. Если ваши работы стоят Архимеда, Ваша отвага - Колумба, то способность описывать снега - кисти Микеланджело\".Кстати, если Вольтер преувеличивает, то не сильно. Книга, в духе времени, была наполнена саспенсом полярных ночей. Вот пример:\"когда открываешь дверь из дома, воздух на улице наполняется клубящимся паром. Выходишь на улицу, и холод рвет легкие. Об усилении морозов нас предупреждал скрип бревен, из которых были построены наши дома. Холод настолько суров, что некоторые местные жители время от времени теряют обмороженными руку или ногу”.В этом увлекательном чтиве, как водится, была и слабая, тщательно замаскированная сторона. Кстати, если вам любопытно заглянуть в первоисточник: на Google книгах Фигура Земли Мопертюи выложена в общий доступ, по крайней мере, во французской и английской версиях. От себя советую обратить внимание на текстовое вступление: о героическом преодолении. А вот с подробным и точным описанием измерений и их методики, все было не так хорошо.Например, мне не удалось найти удовлетворительного описания процесса базисных измерений (когда меряют расстояние). Автор упоминает укладывание восьми 30-футовых вех на лед. Но расчищали снег или нет, на штативы клали вехи или нет - не написано. Да и вообще, 30-футовая веха - это 9-метровая балка. Как ее перевозить, изготавливать и укладывать на снег - не очень понятно. Для сравнения - Годен и Буге на экваторе пользовались 2-футовыми (примерно 60 см) вехами и довольно подробно описывают, как их стыковали и укладывали на штативы или колышки.Спойлер: это все описано у аббата Утье, но его отчеты выйдут десять лет спустя.Уборка снега так, как это делала Арктическая экспедиция. И, если вопросы возникают у меня, копающей эту историю именно ради геройства и скандалов, то астрономическое сообщество Парижа просто не могло пройти мимо опущенных деталей. Тем более, что Кассини II и его ученики считали Мопертюи выскочкой без какого-либо опыта. И вот тут этот выскочка придумал очень ловкий ход: он вообще мало приводит обработки измерений. В первых редакциях его книги имелась оговорка о том, что пытливый читатель может сам проверить результаты, повторив вычисления самостоятельно. А сами измерения углов и широт: вот они, на страницах ниже. Для удобства приведены самые “согласующиеся”, чтобы не перегружать читателя лишними цифрами,Возражения КассиниДля династии Кассини вся шумиха вокруг “Фигуры Земли” была крайне неприятна. Семья (если считать совместную с Пикаром работу) почти сто лет мерила Парижский меридиан. Посвятила себя и своих сыновей геодезии. Положила жизнь на алтарь науки. А тут пришел новичок-математик, за месяц ознакомился с приборами и уехал на север, где, как он утверждает, взял точнейшие наблюдения, да еще и упрекает их, Кассини, колоссальные наработки в погрешностях. Это, может быть, отчасти справедливо. Потому что сто лет назад приборы и были не те и точности тоже. Но мсье Мопертюи строит свою риторику так агрессивно, что согласиться с ним в одном - значит уничтожить свою репутацию полностью. Заметим, в 18 веке приличные люди не опускались до прямых нападок, и самые жаркие споры приобретали вид пространных рассуждений.Парижский меридиан, которым занимались КассиниВот и Жак Кассини (он же Кассини II, пятидесятилетний директор Парижской обсерватории) выпускает работу, где рассуждает о том, что измерения - это то, что мы видим, а не то, что мы хотим наблюдать согласно нашим аналитическим выкладкам. Также автор сомневается в корректности результатов измерения широты зенитным сектором (а этот новомодный прибор Грэхема был главным козырем Мопертюи), поскольку с ним не было выполнено двух приемов измерений: прямого и с поворотом сектора на 180 градусов (в современной геодезии ближайший аналог - это измерение угла при круге право и круге лево тахеометра). Вдобавок Мопертюи, к сожалению, не приводит удовлетворительного описания поверок инструмента, принятых в астрономической практике. Иными словами, трудно поверить, что математики впервые использовали новейший астрономический прибор по собственной методике и сразу получили желаемый и точный результат. Мопертюи и Клеро защищаются (это уже цитата из личной переписки):\"трудно поверить, что шесть астрономов и математиков не могли бы выполнить такую простую операцию, как измерение широты”.Борьба крепчает, переходит в партер (точнее, в газеты и салоны) и начинает отдавать душком неприкрытой вражды. К лету 1738 года книга Мопертюи, вроде бы, и стала бестселлером, вроде бы, король доволен результатом экспедиции, а публика считает Мопертюи “попрателем миров и Кассини” с легкой руки Вольтера, но эта победа кажется зыбкой. Астрономическое сообщество находит в его работе слишком много спорных моментов и недочетов. Сам ученый жалуется на ситуацию: \"я лишен того превосходства, на которое рассчитывал, мои результаты не будут приняты без результатов Перуанской миссии, которая, быть может, никогда не вернется\".Почему тут он вообще помянул Перуанскую миссию? Почему судьба Мопертюи, Цельсия и Клеро должна зависеть от этих, затерявшихся в джунглях астрономов (напомню, что в 1738 году они только мерили свои 33 треугольника в высокогорье и сражались с высотной болезнью, холодом и лихорадкой)?Дело в том, что экспедиция Мопертюи однозначно доказала \"сплюснутость\" планеты. Однако с тем, какова величина этой сплюснутости, была проблема. Экспедицию корона оплачивала не для удовлетворения абстрактного любопытства, а с целью уточнения размеров и формы Земли. Как мы помним, бюджет на обе градусные экспедиции выделял морской министр Морепа и ему было крайне важно, чтобы французские штурманы хорошо вычисляли расстояния (для чего, собственно, размеры и сжатие Земли было важно).Сравнение Арктической миссии с Парижскими измерениями Кассини дало сжатие Земли в 1/178.Между тем как число, которое предсказывал Ньютон, было: 1/230.Алексис Клеро (который очень активно взялся за геометрию Земли) предположит величину сжатия между 1/230 и 1/500.Как бы то ни было, сжатие, полученное по результатам Арктической миссии и Парижа, не бьется ни с одним из ожидаемых чисел. Стало быть, понять ошибался ли Мопертюи, можно будет только тогда, когда вернется Перуанская Миссия. А пока - выводы делать рано.Как бы ни было ожидание 1738-1739 года мучительно для Мопертюи, публику он развлекал исправно, подкидывая разнообразные инфоповоды вспомнить о своем путешествии на Север. В начале 1739 года в Париже появляются лапландские девицы и сразу привносят в светскую жизнь приятное возбуждение. Причем слухи ползут из замка Сире, где у Вольтера и Эмили дю Шатле гостят, собственно, Мопертюи и еще одна известная дама: Франсуаза де Граффиньи (писательница, сплетница и держательница салонов). Граффиньи пишет:“Секретарь мсье Клеро, один из северных путешественников, полюбил лапландку, обещал на ней жениться, и уехал, не сдержав обещания. Девушка приехала в Париж с сестрой - искать своего возлюбленного. Они остановились дома у мсье Клеро, который укрывает их, не смотря на то что он сам весьма небогат. Жених отказывается жениться, а девушка - возвращаться. Весь Париж ходит к Клеро посмотреть на Лапландок”.Сам Мопертюи в личной переписке придерживается другой версии:\"Наш художник поклялся девушке, что женится на ней и что он очень богат и сделает ее знатной дамой. И вот, эта несчастная приехала за ним, а с ней ее сестра, обе рассчитывали на его вымышленные богатства. А художник не только беден, как церковная мышь, но и женат на другой. Бедная девочка была так ранена этим, что опасно заболела. Мы все очень тронуты ее несчастьем и надеемся, что двор может позаботиться о ней, если она отречется от лютеранской веры. Тем временем, вся компания, ездившая в Арктику, старается финансово поддержать бедняжек. Пока что мы поместили девушек в монастырь, чтобы те вкусили прелести святой веры. Я же все еще нахожусь под впечатлением от того, как смело девушка пустилась в путешествие с целью выйти замуж за художника, хотя ничего о нем не знала, кроме того, что он ей наобещал. Нам крайне неловко из-за всего этого\".Как видите, желание любой ценой попасть в Париж не вчера придумали. И даже не позавчера. Впрочем, для смелых девиц эта история закончилась не очень-то славно. За переход в католицизм им выхлопотали небольшое содержание (о чем Мопертюи просит выше). Одна из девушек, говорят, повредилась умом и отправилась в монастырь, а другая - в компаньонки к графине д’Агильон (не той, которая варила бульон, правда), писательнице и подруге Мопертюи. Потом она вышла замуж за мушкетера, но неудачно. Муж бил ее и заточил в монастырь, остаток жизни женщина провела, пытаясь развестись с супругом. Вот такая вот бытовуха для романтических лапландок.Аббатство, в которое удалилась Кристина Планстрем. Википедия.Летом 1739 года Мопертюи предпринимает попытку на деле доказать верность своей методики измерений и, вместе с Кассини-Тюри, отравляется на измерения парижского меридиана. Ранее в Академию Наук поступило письмо от Джорджа Грэхема, где тот признает, что для точного определения широты его сектором два приема совсем необязательно. Однако какая-то бумажка из-за Ла-Манша Академию не убедила. В результате летних упражнений, Кассини-Тюри (это Кассини III, еще молодой астроном, дружески к математику расположенный) признает, что результаты Мопертюи вполне релевантны, а измерения Парижского меридиана требуют введения поправок. Казалось бы, это победа. Но не полная.Мопертюи проводит время в Фонтебло, каждый день общается с министром Морепа, покоряет знатных дам и развлекает вельмож. Графиня Сен Пьер пишет: \"Вы невероятно в моде при дворе, какая удивительная победа для математика\". Морепа организует для него специальную почетную должность, позволяющую получать доход в 3000 ливров. Казалось бы - больше нечего желать. Но… и тут я процитирую всю ту же сплетницу - мадам Граффиньи:“Он утверждает, что желал почета, славы и денег. У него все это есть. Теперь он обедает в Фонтебло с королем. Нам остается надеяться, что он удовлетворится этим, хотя я полагаю, что это невозможно. Есть люди, которые постоянно твердят себе, что они несчастны и изводят себя.\" Jean-François DE TROY, Un déjeuner de chasse, 1737 © 2005 RMN / Hervé Lewandowski Мопертюи действительно недоволен. Он оскорблен смехотворно низкой пенсией в 1200 ливров, которую ему выделяет Академия Наук за проделанную работу. Вопрос с величиной “сжатия” Земли подвис: на дворе 1740-й год, а от Перуанской экспедиции нет новостей. Клеро пишет свою основную работу: “Теория Фигуры Земли, основанная на началах гидростатики\". Но до публикации этой работы еще три года.А Мопертюи, чтобы развлечь скучающую публику, придумывает мистификацию.“Независимое исследование работ по теме Фигуры Земли” было опубликовано анонимно в несуществующем городе Ольденбурге в, якобы, 1738 году (на самом деле в 1740). В те времена подобные игры были в порядке вещей. Та же мадам де Граффиньи издавала свои романы “В Нужде” (а не в Париже). И тут же, на эту новую книжку неизвестного автора сыплются хвалебные отзывы.Монтескье: “Интересная книжка у нас тут вышла. Ее автор кажется сдержанным и разумным человеком, не позволяющем себе глупостей”. Работа наделала шума в Париже. Дамы, едва умывшись, не только гадают, кто же автор, но и желают узнать, какой же формы Земля, которую топчут их ножки. Сам Мопертюи, поддерживая тайну, в письме к Бернулли-младшему говорит о том, что “эту книгу приписывают то Кассини, то мне, то Фонтенелю, то Мерану. И, главное, никто так не может понять, она написана против Кассини или в их поддержку”.В общем, типичные медиа-технологии XVIII века. В книге пять страниц посвящено экспедиции в Лапландию и более тридцати - работе Пикара и Кассини. Обычные читатели не вполне понимают, что же имел в виду очень умный и рассудительный автор, в прессе появляются фейковые письма от (якобы) разных ученых в духе: “Фу, какая дурная книжка, она порочит честных Кассини!”. И тут же находятся те, кто им возражает.Только Вольтер раскусил автора. Он пишет:“В этой книге столько всего, что оправдывает Кассини, но ничего, что указывает на их правоту. Такое могли написать только Вы”.Когда инкогнито раскрывается, Мопертюи уже открыто, публично и очень жестоко поднимает Жака Кассини на смех. В ход идут явно враждебные высказывания: “Чтобы сделать вывод о том, что Земля вытянутая, Кассини должен был насажать простейших арифметических ошибок вроде два плюс два - равно пять”. Это уже некрасиво. И Кассини-Тюри, который раньше выступал в дружелюбном тоне, и научное сообщество, отворачиваются от зарвавшегося ученого. Но Мопертюи уже не остановить, не зря Лакондамин упрекал его в высокомерии: он позирует для портрета, на котором в шапке и шубе, среди оленей попирает земной глобус, а потом бросает все и уезжает в Берлин. Там его любят и ценят. Там восхищающийся им прусский король Фридрих 2й, который возьмет его с собой на войну, да так неудачно, что ученый попадет в австрийский плен (правда, ненадолго). C этого момента история борьбы Мопертюи за сплюснутую Землю заканчивается. С 1740-го года он наведывается в Париж только по случаю.Что же происходит с результатами Градусных экспедиций?В 1744 году в Париж возвращаются Пьер Буге и Лакондамин, которые по отдельности привозят результаты экваториальной миссии. Сравнение Градусных измерений на экваторе с арктическими даст предсказанную Ньютоном величину сжатия в 1/230. Сравнение экватора с французскими результатами - 1/300.Спойлер: она-то на самом деле близка к той, которой мы оперируем сейчас.Но для современников Лапландская и Арктическая миссия однозначно подтвердили результаты друг друга и предположения Ньютона. А вот Парижский меридиан себя немного дискредитировал. Стало ясно, что нужно не сводить воедино триангуляцию, которая выполнялась на разных широтах на протяжении последних ста лет, а единым блоком измерить все заново. Чем и занялись сначала Кассини-Тюри, а потом его сын - граф Кассини, а после - Мешен с Лежандром (привет, еще одно имя из учебника математики). Кстати, граф Кассини (Кассини IV) предложил объединить измерения Парижского меридиана с Гринвичским: а это огромный проект, занявший несколько десятилетий.Но это будет после - во второй половине XVIII века. А сейчас: повторение и уточнение французских измерений, наравне с доказательством того, что в споре декартистов и ньютонианцев правы последние - вот результаты двух Великих Градусных экспедиций. Первых международных.Что же случится с их участниками дальше?Мы уже говорили, что Лакондамин и Буге будут трудиться порознь. Один - на ниве популяризации науки, а другой - на ниве гидрографии. Положение Буге сильно ухудшится с 1749 года, когда граф Морепа проиграет войну влияние на Людовика XV одной из его фавориток. И будет выслан из Парижа.Мопертюи в 1744-м году (как раз в год возвращения Лакондамина и Буге) представит во Французской Академии свой труд, в котором будет формулировать принцип наименьшего действия:«Когда в природе происходит некоторое изменение, Количество Действия, необходимое для этого изменения, является наименьшим возможным».Математик уйдет от геодезии, в которой ему не удалось добиться быстрого и активного успеха, в сторону физики и философии. Через год будет рассуждать о природе людей и животных: это философские рассуждения о чем-то, похожем на эволюционную теорию. А в 1746-м и дальше - снова вернется к рассуждению о количестве действия и того, как стройно устроен мир. Наверняка вам встречалось такое мнение: “Посмотрите, как стройно и славно устроен наш мир? Никакая природа и случайность не могли привести к этому. Только высшее существо могло такое сотворить”. Похоже, Мопертюи был первым пророком этой идеи. Разумеется, против него тут же ополчились противники религии во главе с Вольтером.Последний напишет «Диатрибу доктора Акакия» (Мопюртезиану), еще один свой бестселлер, где будет едко троллить бывшего друга, замечая, что целесообразность устройства мира особенно проявилась в том, что Бог послал Мопертюи Эйлера, который и дал принципу наименьшего действия осмысленное математическое выражение, в то время как сам Мопертюи «ничего не смог понять». Увы, Вольтер Мопертюи затроллил. Звезда математика, после разгромной “диатрибы”, начнет клониться к закату. Он умрет в Базеле, в присутствии двух монахов в возрасте 61 года.Любопытный факт: Фридрих Великий, большой почитатель математика, посвятит два ему стихотворения, которые у нас известны в переводе Державина. Из-за трудностей перевода с французского, математик-Мопертюи превратится в «Мовтерпия».Что же касается остальных:Алексис Клеро станет астрономом-теоретиком и механиком. Он аналитически определит соотношение между силой тяжести и размерами Земли, что заложит основы гравиметрии, внесет огромный вклад в теорию движения небесных тел, и, чуть старше пятидесяти, закончит свои дни во Франции в окружении товарищей, учеников и хорошеньких женщин.Перевод Клеро на русский, сделанный только в середине 20 века.Андреас Цельсий недолго будет работать в Уппсальской обсерватории. В 1744 году (тогда Перуанская экспедиция вернется в Париж) он умрет от туберкулеза. Наверное, именно поэтому мы не знаем его как астронома, хотя небо и измерения интересовали его куда больше, чем температура.ЗаключениеВеликие градусные экспедиции: Экваториальная и Арктическая, стали первыми в своем роде, но потянули за собой целую цепочку измерений длины дуги меридиана: Парижского, Гринвичского. В XIX веке к ним присоединятся дуга Струве (самая длинная из градусных измерений) и дуга полковника Эвереста (того самого, чьим именем названа гора).Источники к этому циклу: Экваториальная экспедиция:1. La figure de la terre, déterminée par les observations de messieurs Bouguer & de La Condamine, P.Bouger, 1749.2.Mesure des trois premiers degrés du méridien dans l'hémisphere austral, Ch.M. de la Condamine   3. Observaciones astronomicas y phisicas hechas de orden de S. M. en los Reynos del Peru, J. Juan, A. de Ulloa, 1773 4. Relacion historica del viaje a la America Meridional hecho de orden de S. Mag. para medir algunos grados de meridiano terrestre y venir por ellos en conocimiento de la verdadera figura y magnitud de la tierra, con otras observaciones astronomicas y phisicas / por D. Jorge Juan y D. Antonio de Ulloa, 1743, в 2 томах.  5. Noticias secretas de América,J.Juan y A. de Ulloa, 1735-1826.  6. Journal du voyage fait par ordre du roi, a l'Équateur, servant d'introduction historique a la Mesure des trois premiers degrés du méridien, Ch.M. de la Condamine, 1751.Арктическая экспедиция:La figure de la terre déterminée par les observations de Maupertuis, Clairaut e t.c., P.M.de Maupertuis, 1738. Та же книга в англоязычном издании: https://archive.org/details/b30537782_0001/mode/1upJournal d'un voyage au nord, en 1736-1737, Reginald Outhier, 1754.Книги и исследования:Экваториальная экспедицияMeasure of the Earth, Larrie D. Ferreiro, 2011. Это самая основательная и интересная из работ, что мне встречались по перуанской экспедиции. На английском языке, доступна в Google книгах и на Амазоне. Автор - историк, инженер-судостроитель, за другую свою работу по истории навигации номинирован на Пульцеровскую премию. Очень подробно, со ссылками на первоисточниками, по которым потом можно пройтись.The Quest for the True Figure of the Earth: Ideas and Expeditions in Four Centuries of Geodesy Science, Technology and Culture, 1700-1945, Michael Rand Hoare, Routledge, 2017. Короче, более сжато, больше времени уделяется обеим экспедициям сразу, но там есть некоторые неизвестные мне ранее подробности о жизни криольцев в Перу.La geometrización de la tierra (1735-1744), Antonio Lafuente, A.J. Delgado, 1984.  Основательная работы испанских ученых 1980-х, которые проанализировали измерения и результаты перуанской экспедиции.“Bouguer Redeemed: The Successful 1737–1740  Gravity Experiments on Pichincha and Chimborazo,”John R. Smallwood, Earth Sciences History 29, no. 1 (2010): 1–25. Статья-исследование про повторение эксперимента Буге и обсуждение результатов.Арктическая экспедицияThe Man Who Flattened the Earth. Mary Terrall, 2006. Имеется на Google книгах. Книга посвящена Мопертюи, имеются чудесные цитаты из его переписки с Клеро, дю Шатле, Вольтером. Неиссякаемый источник вдохновения.Olivier Courcelle: исследователь жизни Клеро. На его сайте приведена жизнь Клеро изо дня в день. http://www.clairaut.com/Osmo Pekonen: финский математик, посвятивший жизнь исследованию и увековечению Арктической экспедиции. Кроме книг, у него чудесный информативный сайт: https://maupertuis.fi /Предыдущие части цикла можно найти тут:О форме Земли: тыква или дыня?Как набрать команду к экватору?Планирование экспедиции.Приборы и инструменты.Дорога на Запад.Базисные измерения и политика.Триангуляция и коррида.О звездном непостоянстве.Нельзя просто так взять и вернуться из экспедиции.Арктическая градусная экспедиция. Начало.Арктическая экспедиция: на Севере диком.О мере успеха. Градусные экспедиции: завершение.  "
]