[
   "Операционные усилители. Часть 5: Частотно-зависимая обратная связь в ОУ. Активные фильтры и генераторы сигналов на ОУ",
   "\r\nВ предыдущей публикации цикла мы разобрали, как работают схемы на ОУ с нелинейными элементами в цепях обратной связи, научились производить с помощью ОУ операции умножения и деления, и узнали, как собрать на ОУ источник тока, напряжения, а также усилитель мощности.\n\r\nВ данной публикации цикла мы разберём работу ряда схем на ОУ с частотно-зависимой обратной связью и научимся собирать на ОУ активные фильтры и генераторы.\n\r\nДля тех, кто присоединился недавно, сообщаю, что это пятая из шести публикаций цикла. Содержание публикаций со ссылками на них находится в конце статьи.\n\nЧастотно-зависимая обратная связь в ОУ\r\nС частотно-зависимой обратной связью в ОУ мы впервые столкнулись при рассмотрении работы реальных ОУ «в динамике». Она интересовала нас в плане частотной коррекции передаточной характеристики для предотвращения генерации при работе ОУ в режиме усиления за счёт превращения отрицательной обратной связи в положительную из-за сдвига фаз.\n\r\nТакже мы имели дело с частотно-зависимой обратной связью, когда разбирали работу интегрирующего и дифференцирующего звеньев. Нас тогда интересовала не столько АЧХ, сколько реакция этих звеньев на воздействие единичного прямоугольного импульса.\n\r\nПо сути, интегрирующее звено на рисунке ниже имеет АЧХ фильтра низких частот (ФНЧ) 1-го порядка с частотой среза fc = 1/2πRC. Сигнал с частотой ниже fc передаётся на выход этого звена без затухания. Для частот выше fc сигнал передаётся с затуханием 6 дБ/октава, т.е. ослабляется по уровню в два раза при повышении частоты в два раза.\n\n\r\nДифференцирующее звено является ФВЧ 1-го порядка с частотой среза fc = 1/2πRC. Оно пропускает сигнал с частотой выше fc без затухания. Сигнал с частотой ниже fc передаётся с затуханием 6 дБ/октава.\n\n\nАктивные фильтры на ОУ\r\nФильтры применяются в электронике для выделения желательной составляющей спектра сигнала и/или подавления нежелательной.\n\r\nИзначально фильтры строились из пассивных RLC-компонентов. Активные фильтры стали получать распространение с развитием полупроводниковой электроники. Активные фильтры проще в изготовлении, т.к. они не требуют применения «моточных» изделий. Однако, пассивные фильтры применяются до сих пор.\n\r\nРасчёт фильтров обычно производится с применением полиномов Баттерворта, Чебышёва и Бесселя. Последнее время набирают популярность эллиптические фильтры.\n\r\nНаиболее детально тема активных фильтров на ОУ разобрана в [3] в разделе «13. Активные фильтры» на стр. 185 – 226. Мы же разберём их работу на простом и понятном материале, изложенном в [5] в разделе главы 4 «3. Фильтры звуковых частот» на стр. 138 – 145, в части, касающейся схем на ОУ.\n\r\nКак правило, активные RC-фильтры на ОУ собирают по схеме Саллена–Ки (Sallen–Key), которая действует как «источник напряжения, управляемый напряжением» (ИНУН, VCVS). Ниже приведена схема двухполюсного ФНЧ (ФНЧ второго порядка) подобного типа:\n\n\r\nЕсли резисторы и конденсаторы поменять местами, получим двухполюсный ФВЧ:\n\n\r\nДвухполюсные фильтры по схеме Саллена–Ки состоят из небольшого количества элементов и стабильны в работе. Частота среза определяется по формуле:\n\n\n\n\n(20)\n\nКоэффициент передачи K определяется соотношением сопротивлений резисторов в цепи ООС. В зависимости от коэффициента передачи у фильтров по схеме Саллена–Ки изменяется АЧХ. Из таблицы на стр. 290 [2] мы видим, что при K = 1,586 звено имеет АЧХ фильтра Баттерворта, при K = 1,268 – фильтра Бесселя, а при K = 1,842 – Чебышёва с неравномерностью в полосе пропускания 0,5 дБ.\n\r\nФильтры по схеме Саллена–Ки с числом полюсов более двух ведут себя нестабильно. Повышение порядка достигается каскадным подключением двухполюсных фильтров. Нюансы такого каскадирования наглядно продемонстрированы Поляковым в [5] на рисунке ниже:\n\n\r\nКак мы видим на иллюстрации, АЧХ шестиполюсного ФНЧ Чебышёва с частотой среза fc = 2700 Гц формируется из АЧХ двухполюсного ФНЧ с частотой среза намного меньше fc и K = 1 (обозначение «1» на графике), АЧХ двухполюсного ФНЧ с частотой среза меньше fc и K = 1,4 (обозначение «2» на графике) и АЧХ двухполюсного ФНЧ с fc = 2700 Гц и K = 1,6 (обозначение «3» на графике). Для снижения влияния неточности номиналов элементов схемы на АЧХ соотношение ёмкостей конденсаторов в каждом звене выбрано из расчёта один к трём. Номиналы резисторов подобраны из диапазона 10…100 кОм.\n\r\nИз ФВЧ и ФНЧ с перекрывающимися полосами пропускания можно получить полосовой фильтр. Активный полосовой фильтр по схеме Саллена–Ки выглядит следующим образом:\n\n\r\nПри R1 = R2, C1 = C2 и R3 = 2R1 центральную частоту полосы пропускания f0 и добротность фильтра Q (отношение f0 к ширине полосы пропускания Δf0) получаем по формулам:\n\n\n\n\n(21)\n\n\n\n\n(22)\n\nИз формулы (22) видим, что коэффициент передачи K должен быть меньше трёх.\n\r\nГораздо лучшие результаты можно получить при применении в качестве активного полосового фильтра схемы биквадратного фильтра:\n\n\r\nСхема биквадратного фильтра значительно сложней, но менее критична к неточности номиналов элементов схемы. Центральная частота полосы пропускания f0, ширина полосы пропускания Δf0, и коэффициент передачи K при R3 = R4 и R5 = R6 определяются по формулам:\n\n\n\n\n(23)\n\n\n\n\n(24)\n\n\n\n\n(25)\n\nПодробней о биквадратных фильтрах написано в [2] на стр. 293 – 295 и в [1] на стр. 106 – 108.\n\nРелаксационные генераторы на ОУ\r\nГенератор – это устройство для производства периодически изменяющихся сигналов. Релаксационный генератор – это генератор, элементы которого не обладают резонансными свойствами.\n\r\nРелаксационный генератор на ОУ можно получить, объединив схемы интегрирующего звена и триггера Шмитта в замкнутый контур:\n\n\r\nКогда на выходе триггера Шмитта присутствует напряжение высокого уровня, конденсатор C1 заряжается до тех пор, пока напряжение на входе триггера Шмитта не станет меньше порога срабатывания, после чего конденсатор C1 начнёт разряжаться, пока напряжение на входе триггера Шмитта не станет больше порога срабатывания.\n\r\nНа выходе интегрирующего звена присутствует периодический сигнал треугольной формы, на выходе триггера Шмитта – меандр. Стабилитрон VD1 ограничивает амплитуду прямоугольного сигнала на выходе триггера Шмитта Uвых2 до значения напряжения стабилизации Uст. Период автоколебаний T и амплитуду сигнала на выходе интегрирующего звена Uвых1 получаем по формулам:\n\n\n\n\n(26)\n\n\n\n\n(27)\n\nПодобные схемы принято называть «функциональными генераторами», т.к. они производят на выходе сигналы разной формы.\n\r\nРелаксационный генератор с выходным сигналом в виде меандра называется мультивибратором. Рассмотренную выше схему тоже можно использовать в качестве мультивибратора, но приведённая ниже схема проще:\n\n\r\nПри равенстве положительных и отрицательных напряжений ограничения Uогр на выходе ОУ период автоколебаний T и амплитуду сигнала на инвертирующем входе Uвх- получаем по формулам:\n\n\n\n\n(28)\n\n\n\n\n(29)\n\nRC-генераторы гармонических колебаний на ОУ\r\nСинусоидальный сигнал на выходе звена на ОУ можно получить с помощью обработки сигнала треугольной формы активным фильтром низких частот, а также применением моста Вина:\n\n\r\nСхема построена таким образом, чтобы обеспечить обратную связь с фазовым сдвигом 180° на частоте f0 и поддерживать генерацию изменением коэффициента передачи K. Запуск генерации происходит при K > 3, что достигается при R3/R4 > 2. Затем, когда запуск произведён, для стабилизации работы генератора коэффициент передачи K должен уменьшаться при увеличении амплитуды выходного сигнала. Одним из решений такой адаптивной обратной связи является использование вместо R4 лампы накаливания.\n\r\nПри равенстве R1 = R2, C1 = C2 частота генерации f0 определяется по формуле:\n\n\n\n\n(30)\n\n▍ От автора\r\nВ публикации были рассмотрены примеры реализации активных фильтров и генераторов на ОУ. С развитием DSP (Digital Signal Processors) и методов DDS (Direct digital synthesis) тема может казаться неактуальной, однако, как появление активных фильтров не отменило применение в системах связи пассивных фильтров, так и промышленное производство цифровых синтезаторов частоты не отменяет применения аналоговых генераторов сигналов.\n\r\nСледует заметить, что применение генераторов сигналов на ОУ всегда было ограничено. С одной стороны, наличием простых и надёжных интегральных таймеров семейства 555, а с другой — простыми и надёжными генераторами на транзисторах по схемам ёмкостной (индуктивной) «трёхточки».\n\r\nВ следующей публикации мы сосредоточимся на применении «реальных» ОУ в условиях реального мира: рассмотрим однополярное питание ОУ, работу ОУ в условиях помех, а также нюансы экранирования схем и каналов.\n\r\nДанный цикл публикаций состоит из шести частей. Краткое содержание публикаций:\n\r\n1. Предпосылки появления ОУ. «Идеальный» операционный усилитель. Инвертирующий и неинвертирующий усилители, повторитель.\r\n2. Отличия «реального» ОУ от «идеального». Основные характеристики реального ОУ. Ограничения реального ОУ.\r\n3. Суммирующий усилитель. Разностный усилитель. Измерительный усилитель. Интегрирующее звено. Дифференцирующее звено. Схема выборки-хранения.\r\n4. Активный детектор. Активный пиковый детектор. Логарифмический усилитель. Активный ограничитель сигнала. Компаратор на ОУ. Источник опорного напряжения. Источник тока. Усилитель мощности.\r\n5. Частотно-зависимая обратная связь в ОУ. Активные фильтры на ОУ. Генераторы сигналов на ОУ. < — Вы тут\r\n6. Однополярное включение ОУ. Входные помехи, «развязки» и защиты входных цепей, экранирование.\n\n▍ Использованные источники:\r\n1. Гутников. Интегральная электроника в измерительных устройствах. Энергоатомиздат, 1988\r\n2. Хоровиц, Хилл. Искусство схемотехники. 2-изд. Мир, 1993\r\n3. Титце, Шенк. Полупроводниковая схемотехника. 5-изд. Мир, 1982\r\n5. Поляков. Радиолюбителям о технике прямого преобразования. Патриот, 1990\n\n "
]