[
   "Отношения с IT. Часть вторая. Приходите завтра",
   "Все персонажи являются вымышленными. Любое совпадение с реально живущими или когда-либо жившими людьми случайно.- Скажи, пожалуйста, когда будет готово описание и функционал по нашим it-продуктам?- Ну, слууууууушай, сейчас очень большой объем работы. Быстро точно не сделаю. Давай в понедельник? Или лучше во вторник. — Устало говорит очень хороший начальник (но пока еще не директор).- Очень хороший начальник, нам очень нужна эта информация, чтобы мы могли объяснить заказчикам разницу в возможностях наших продуктов и политику ценообразования.- Ага, - говорит он, что в переводе с корпоративного языка нашей компании означает: «Иди в жопу, сейчас вообще не до твоей задачи».В понедельник, разговор повторяется, потом повторяется снова. Больше двух недель требуется для того, чтобы результат был стабильно – нулевым.Пока задача с описанием функционала продуктов не двигается и вопросы висят там, где они висят, команда менеджеров по продажам замирает в ожидании. Бессмысленным кажется поиск новых потенциальных заказчиков, проведение переговоров и презентаций. Потому что новым заказчикам на переговорах и в разговорах очень хочется знать: - можно ли добавить перламутровых пуговиц;- сколько это будет стоить;- есть ли возможность укоротить подол;- почему так дорого; - а где собственно платье во всем этом и т.д. Все эти ответы есть у тех, кто конструирует платья и принимает активное участие в его производстве. Только времени на то, чтобы рассказать об этом нет, потому что конструкторы и производители заняты созданием новых платьев и штопаньем старых. Уходя из дуальности, где каждый участник непременно или хороший или плохой, станет очевидно, что очень хороший начальник вовсе не главный злодей или засланный враг в девственное лоно нашей (кажется, теперь не нашей, а вашей) компании. Наоборот, он работает и живет в соответствии с принципами, правилами и выстроенными бизнес-процессами компании, в которой работает. В его списке приоритетов именно то, что транслируется и исполняется сюзереном и командой топ-менеджеров.Поэтому происходящее внутри – это совокупность всех действий, мыслей, идей, слов и поступков команды и СЕО, которые принимает заданную парадигму и транслируют ее внутри компании. Если кого-то не устраивает действующая парадигма, он в ней просто не живет или как минимум предпринимает попытки изменить. Возвращаясь к очень хорошему начальнику. В основе принятия его решений лежит мысль о том, что наибольшая степень важности всей it-компании (как системы) присутствует в том, что делает его подразделение и за что конкретно он несет ответственность. А так как коммерческий отдел ввиду исторических факторов и частой смены трудовых договоров не сформировал своей ценности, то в единый контур, образующий выручку и влияющий на непрерывную цепочку в производстве, топ-менеджментом и СЕО он не включен.Что это значит?В некоторых случаях интеллектуальный продукт и его возможности могут быть раскрыты только после его адаптации в каждом конкретном случае. Эта зона ответственности в it-компаниях принадлежит отделу внедрения или аналогичному подразделению (разработчики, аналитики, продакты), которое в зависимости от сложности проекта и списка предстоящих задач может быть представлено как в большем, так и меньшем составе. Весь процесс адаптации продукта или его внедрения можно условно разделить на этапы:Сделка.Адаптация продукта.Постобслуживание.Логично предположить, что на каждом этапе должен существовать свой результат, документ и выстроенные процессы, позволяющими контролировать качество проведенной работы и степень удовлетворенности заказчика.Для нашей (пардоньте) вашей it-компании эти важные элементы сформированы только на первых двух этапах. Сделка – подписанный контракт с условиями+$$.Адаптация продукта – акты приема-передачи+$$.Постобслуживание – ничего, потому что ничего и потому что акт и денюжки получены, а дальше голубчики сами.Для монополистов третий этап не является важным, потому что к этому моменту заказчик уже подписал договор, уже потратил много денюжек и для того, чтобы обосновать уход и смену продукта, требуются стальные яйца высокая степень влияния и экспертности. На конкурентном рынке, важность третьего этапа очевидна. Компании важно понимать, что конкретно происходит на третьем этапе, как много ресурсов требуется заказчику для качественного постобслуживания и как много ресурсов компания отдает фактически, какова рентабельность, как собираются данные на этом этапе, как их интерпретируют и главное, что с ними делают потом. Т.е. к каким управленческим решениям это приводит. Очень много внимания и сил внутри компании сюзерена направлены на первые два этапа, но если первый целиком лежит на плечах отщепенцев  менеджеров по продажам, и каждый конкретный менеджер варится в своих задачах самостоятельно, то на втором этапе работает команда. И хотя сроки первого и второго этапа от начала до получения документов и денюжек примерно одинаковые, более сложным считается второй, а более значимыми людьми в компании тоже вторые. Почему? Как минимум для этого есть 2 причины. Первая: на втором этапе большее число людей страдает задействовано в работе.Вторая: если акта по второму этапу не будет получено, прощай остаток денюжек, надежды на получение новых денюжек и здравствуй, плохая репутация.Именно поэтому все пыхтят и молятся на участников второго этапа, а после подписания актов пьют за здравие их нервной системы и ангельское терпение.И если французы говорили ищите женщину, то в бизнесе в качестве причины следует жить в парадигме «ищите денюжки». Пока взор топ-менеджмента с молитвами, ожиданием долгожданных актов направлен на ВТОРОЙ этап, первый никому не интересен кроме самих менеджеров по продажам. Наверное, мысль, что некому будет адаптировать да внедрять на втором этапе, если на первом будет ноль, не столь очевидна как кажется на первый взгляд. Если к вышесказанному добавить регулярные унижение критику и обесценивание огромной работы, которую делают менеджеры по продажам, вопросиков станет еще меньше. Прикидываю в уме, насколько стремительный карьерный рост сложится у очень хорошего начальника в следующих главах моей книги и как много времени ему потребуется для описания продуктов. "
]