[
   "Парадокс Питона (The Python Paradox)",
   "В последнем выпуске подкаста \"Цинковый прод\" помимо всего прочего обсуждался так называемый парадокс Питона (The Python Paradox). \nКак ни странно, на Хабре нет практически ни одного упоминания об этом парадоксе. При том, что, несмотря на свою простоту, мысль очень интересная\nВ далеком-предалеком 2004 году, когда язык Python был чем-то необычным, немейнстримовым, вышла статья Пола Грэма, в которой он поделился своим эмпирическим наблюдением: программисты на Питоне, которых он знает, гораздо сообразительнее, чем Java-программисты. \nВ дальнейшем, Пол объяснил, что он не имел в виду, что Java-программисты тупые. Он просто подчеркнул, что люди, которые пишут на Питоне (малоизвестном тогда языке) — это гики, которые программируют ради удовольствия; это люди с широким кругозором, которые видят недостатки одних языков и достоинства других.\nТут важно подчеркнуть, что Java была распространенным языком, а Питон нет — в этом вся суть. На Питоне было не найти работу, на нем писали только потому, что он нравился как язык, как хобби. \nПеренося эту ситуацию в сегодняшние реалии, можно было бы сказать, что среднестатистический программист на Rust или Elixir будет в среднем соображать лучше, чем средний \"чистый\" программист на Java или PHP.\nОтсюда Пол Грэм делает два вывода-парадокса\nВывод Пола для бизнеса\nЕсли компания выбирает для нового проекта относительно эзотерический язык, то те, кого она наймет, будут отличными программистами, ведь они проделали большую работу по изучению языка, и они сделали это для своего удовольствия. И им будет интересно работать.\nВывод Пола для программиста\nЯзык, который нужно выучить, чтобы получить хорошую интересную работу, это тот язык, который люди учат не только чтобы получить работу.\nЕще парочка моих выводов\n\nКак говорится, нельзя просто так взять и вернуть 2004 год. Сейчас всё поменялось, стало несколько проще. Например, микросервисная архитектура позволяет использовать зоопарк языков и технологий, и тем самым привлекать замотивированных программистов на эзотерических языках, которые будут с удовольствием работать днями и даже ночами, радостно решая проблемы, которые будут вставать у них на пути\nНеобязательно всё делить на черное и белое. Возможен и смешанный подход. Если проект уже написан на условной Джаве, и надо нанять именно джавистов, то на собеседовании обязательно стоит спросить, на каких языках человек еще писал. Если у него на гитхабе есть проекты или пулреквесты на языках, для которых не найти толком работу, то это ЖИРНЫЙ плюс\nКогда язык только-только выпускает стабильную версию, на нем пишут замотивированные профи. Но со временем из-за выросшей популярности туда повалит весь народ, и появится куча говнокода. Особенно интересно наблюдать за языком Go: язык с довольно низким порогом входа (синтаксис очень простой), при этом он стал очень популярным и высокооплачиваемым. Сейчас там, чувствую, сильно упадет среднее качество\n "
]