[
   "Петля обратной связи в импульсных источниках питания",
   "Для получения требуемого напряжения в схемотехнике, как правило, используются микросхемы импульсных  DC-DC преобразователей. Очень удобные микросхемы - высокий КПД, возможность как понизить, так и повысить напряжение, миниатюрные размеры… Но иногда они словно сходят с ума: выходное напряжение начинает плавать, скакать, они издают чётко слышимый ухом свист (на самом деле свист издаёт выходной дроссель), микросхемы начинают очень сильно нагреваться (вплоть до выхода из строя).. Причём, как правило, это наблюдается не на одном-двух экземплярах, а сразу на всех устройствах из партии, то есть, налицо какая-то схемотехническая ошибка.  Вопросу “почему это происходит” и посвящена эта статья. Чтобы понять, что происходит, надо изучить, как работает импульсный стабилизатор питания. В двух словах - смотрим, что у нас на выходе. Если напряжение ниже, чем нужно - подкачиваем порцию энергии. Если выше - не подкачиваем. Для того, чтобы определить, выше или ниже напряжение, чем нужно, используется схема под названием “усилитель ошибки” (по сути - операционный усилитель с обвязкой).  Благодаря усилителю ошибки, схема гибко реагирует на скачки потребления энергии. Вроде бы всё нормально, должно работать, но как всегда, в дело вступают нюансы. И основной нюанс состоит в том, что в реальном мире ничто не происходит мгновенно. Нужно время, чтобы накачать энергию в дроссель, нужно время на то, чтобы зарядить паразитные ёмкости, и так далее. Соответственно, в какой-то момент начинает возникать ситуация, когда реакция на скачок тока (и, соответственно, проседание напряжения), начинает слишком сильно запаздывать. Скачок потребления тока уже закончился, и напряжение уже вернулось в свои прежние границы, а усилитель ошибки  только-только начинает накачивать энергию в выходной конденсатор. В результате - напряжение на выходе растёт, это видит микросхема, начинает ограничивать накачку, напряжение проседает... В итоге микросхема начинает “раскачивать” сама себя. Для того, чтобы выяснить, как источник питания поведёт себя при разных условиях, и не пойдёт ли он вразнос, используются диаграммы Боде. При желании, их можно построить вручную, по точкам, при помощи генератора частоты и осциллографа. Но многие продвинутые осциллографы имеют возможность автоматически строить диаграмму собственными силами. Схема, при помощи которой снимаются данные диаграммы в автоматическом режиме, приведена на рис.1:Схема подключения осциллографа для снятия диаграммы БодеРассмотрим рис. 1 чуть подробнее. Прежде всего, нам надо подать “помеху”, то есть, сымитировать скачки потребления на выходе микросхемы. Для этого в верхнее плечо делителя, задающего выходное напряжение микросхемы, подаём помеху. Как видно из рисунка, помеха подаётся не на всё верхнее плечо, а на специально предусмотренный для этого резистор Rinj, малого номинала, чтобы не вносить слишком сильных искажений, и не сводить с ума микросхему. Если у вас в схеме нет этого мелкого резистора - придётся его как-то “колхозить”. Трансформатор в принципе, пойдёт практически любой, общую картину он всё равно покажет. На выходе получается что-то подобное:Диаграмма Боде Собственно, на этой диаграмме нас интересуют две характерные точки. Первая - это момент пересечения уровня в 0 децибел амплитудно-частотной кривой. До этого момента усилитель ошибки работает “в плюс”. То есть, именно что усиливает ошибку, а не ослабляет её, и, соответственно, способен корректно подавить внешнюю помеху. Вторая - это пересечение уровня в -180 градусов (некоторые осциллографы вводят свою поправку в результаты, и у них опорным является уровень 0 градусов, но сути это не меняет) фазово-частотной кривой. -180 градусов - это ровно половина волны. Пока уровень превышает -180 градусов - у нас действует отрицательная обратная связь, после пересечения  - положительная. Как гласит теория автоматического управления, с отрицательной обратной связью система в общем случае устойчива, с положительной - как правило, неустойчива. Соответственно, устойчивым будет являться DC-DC преобразователь, у которого в области положительного усиления действует исключительно отрицательная обратная связь. А вышеупомянутые “характерные точки” определяют запас этой самой устойчивости. Значение ФЧХ тот момент, когда АЧХ равна нулю, определяет запас устойчивости по фазе. Принято считать, что запас менее 30 градусов - совсем ни о чём, от 30 до 60 градусов - маловато, а более 60 градусов - приемлемо. А, соответственно, значение АЧХ в тот момент, когда ФЧХ равна -180 градусов - это запас устойчивости по амплитуде. Чем ниже, тем лучше, хотя бы -10 дБ. Пример реального графика с осциллографа приведён на рис. 3:Пример реальной диаграммы Боде с осциллографаЗдесь уже автоматически внесена поправка в 180 градусов, поэтому характерной точкой является 0 градусов. Как видно, запас по фазе - почти 85 градусов, по амплитуде - 14 дБ. Нужно понимать, что возможность импульсного преобразователя реагировать на высокочастотные помехи, помимо всего вышеописанного, ограничена законом Котельникова: максимальная частота помехи, которую способен корректно погасить даже самый устойчивый импульсник, равна половине рабочей частоты этого импульсника. Отчасти, этим и обусловлен бардак в высокочастотной части диаграммы. "
]