[
   "Переход на полную удалёнку",
   "В настоящее время, как некоторые из вас могли заметить, достаточно часто происходят различные события, меняющие уклад жизни, например, эпидемия covid-19 или какие-либо иные исторические события, которые могут побудить вас перейти на режим работы, которым мы назовём для удобства \"полная удалёнка\".Данный режим предполагает возможность работать из любой точки планеты или хотя бы такой точки, которую различные исторические события, затрагивают в минимальной степени и в этой статье мы разберём набор минимальных действий, который потребуется для того, чтобы на него перейтиПаспортНастоятельно рекомендуется иметь два загран паспорта, так как второй загран даёт огромные преимущества в ряде случаев. Выбор целевой локацииЧтобы выполнить процесс подготовки для начала нужно определить ограничения, которые вас сковывают. Затем нужно определить список стран, которые совместимы с этими ограничениями, например по часовому поясу или иным критериям, которые для вас важныСамый главный критерий выбора страны для удалёнки - это возможность находится в данной стране максимально долго без необходимости выезда из неё. Без этого все остальные пункты не имеют смысла. Лучшие варианты это те, где даётся разрешение находиться в стране как турист от 6 месяцев. Второй критерий это визаран. Существуют страны в которых возможен так называемый визаран - это когда выезд необходим только на некоторое небольшое время, например на 3 дня, после чего доступен въезд с новым полным сроком нахождения и так можно делать до бесконечности.Каждая релокация расходует тот же когнитивный ресурс, который используется для разработки и нужно стараться выбирать локации с максимальным временем до визарана. Существует также такой вариант, как релокация из одной страны в соседнюю и назад до бесконечности, это существенно расширяет перечень доступных для этой стратегии стран и позволяет использовать страны 90/180.Сам список визовых требований можно найти тутАктуальность данных нужно постоянно проверять, так как мир не стоит на месте. Например Панама, если я не ошибаюсь, не даёт те 180 дней безвиза что описаны в этой статье wiki, а 90 из 180, что является неудобным вариантом, кроме как если вы будете ездить между Коста-Рика и ПанамаДополнительным плюсом является бонус, который есть в ряде стран, где можно снимать криптовалюту, в случае если классические банковские карты массово откажут по техническим причинам неустранимого характера. Также можно открыть счёт в такой юрисдикции, которая имеет более высокую стабильность, не несёт рисков прекращения международных платежей и позволяет открывать счета её нерезидентам.Сбор данныхПеред принятием решения о релокации на полную удалёнку важно предварительно собрать следующие данные:Виза и визаранНасколько долго можно находится без выезда и можно ли сделать визаранЦеныОбщие ценники в магазинах, насколько чек выйдет больше или меньше чем в стране бывшей постоянкиЧасовой поясСовместимость с ключевыми городами, где расположены работодателиКлиматОрганизму требуется около месяца чтобы перейти из сухого климата в влажные тропики, постоянные релокации между климатическими зонами с длительной адаптацией между ними не рекомендуются СейсмикаВо многих странах мира она есть и с ней можно столкнуться, как правило в них же строения её неплохо держат, но есть некий предел. Если не хочется столкнуться с таким инцидентом, то нужно заранее убедиться в низкой активности в целевой локации. В прибрежных городах могут быть цунами вследствие сейсмической активности, не нужно снимать дом в метре от океанаВысота над уровнем моряБольшая высота над уровнем моря означает пониженное атмосферное давление, которое влияет на производительность труда какое-то время адаптации и чем она больше, тем дольше идёт адаптацияФаунаЕсть локации в которых фауна залезает в жилые здания, например многие знают, что в Крыму в дома пробираются многоножки, однако мало кто в курсе, что в Мехико в ряде районов города в дома пробираются скорпионы. Они, конечно, травятся и больше не лезут но есть другие места, где никакой лезущей фауны просто нетОтоплениеСистема центрального отопления это артефакт, которого в мире почти нигде нет. Нужно учитывать этот факт сопоставлять с климатом и выбирать правильное жилищеВодаСистемы подачи питьевой воды в мире встречаются не так часто, как хотелось бы. Её отсутствие означает, что придётся возить или носить питьевую воду из магазиновЭлектроснабжениеВ разных странах разные системы электроснабжения и оборудование должно быть к ним приспособлено. Подавляющее большинство зарядок и подобных устройств прекрасно работают во всех стандартах сетей, вопрос только в штепселеЗаконыВ ряде стран возможны ужасающие последствия за обыденные действия, например, существуют инциденты посадок людей за размещение в кармане дохлой стрекозы, в других всё более чем либерально. Нет смысла выбрать для удалёнки локацию с несовместимыми для вашего мировоззрения законамиЯзык не так важен как кажется, можно его вообще не знать и не испытывать проблем. В худшем случае можно общаться через гуглтранслейт. ПримерыГрузия:Виза - безвиз до 360 дней, визаран разрешёнЦены - либеральныеЧасовой пояс GMT+4 и совместим с МосквойКлимат - субтропикиСейсмика - последний инцидент за год 6.6 балловВысота над уровнем моря  - столица находится на высоте 400 метровФауна - в дома не лезетОтопление - как правило, газ, как правило, можно настраивать температуруВода - полусоветская система водоснабжения, такой тип один из лучших в миреЭлектроснабжение - 230V, ЕвропаЗаконы  - достаточно либеральныеМексика:Виза и визаран - 180 дней, разрешёнЦены - выше среднегоЧасовой пояс - есть все часовые пояса СШАКлимат - весь набор в зависимости от штата - от пустынного до тропических джунглей, в столице вечное лето, город озеленён до предела, Канкун влажные душные джунгли, Ла-Паз - полупустыня с весьма комфортным климатом и без скорпионовСейсмика - зависит от локации, есть локации где последний инцидент был около 7.5 баллов, есть штаты где давно землетрясений нетВысота над уровнем моря - столица находится на высоте 2200 метров, атмосферное давление на такой высоте будет составлять 75 процентов от давления на уровне моря, условное парциальное давление кислорода приведённое к уровню моря будет 16 процентов вместо 21 процента. Канкун/Ла-Паз и подобные города стоят на уровне моряФауна - в ряде штатов есть скорпионы которые любят зайти в дом, в ряде даже комары почти не встречаютсяОтопление - как правило нет, кондинционеры также редко умеют обогревать. Как правило оно никогда не нужноВода - водопроводная вода накапливается в баках на тонну другую на крышах и она не питьевая по очевидным причинам. Питьевая вода продаётся в магазинахЭлектроснабжение - 110V/СШАЗаконы - достаточно либеральныеТребования таможниДля въезда в подавляющее большинство стран требуется иметь въездной/выездной билет и бронь. Их нужно делать на пару месяцев, в подавляющем большинстве случаев всё равно проставляется максимально возможная длительность пребывания и затем вами выездной билет отменяется и потом покупается новый когда он нужен для визарана.ЖелезоНоутбук - нужно вложиться в него с запасом и потом не страдать. По возможности выбрать с typec зарядкой чтобы не таскать родную зарядку далее  с собой, используя вместо этого общую зарядную станцию.Зарядное устройство - Лучше всего выбрать так называемые зарядные станции, вместо того чтобы возить несколько разных зарядок на каждый девайс. Оптимальны зарядные станции от 2 порта typec по 100 ватт и 2 typeb по 18 и далее по потребностям.power bank - выбрать такой, чтобы его вес был оптимален к ёмкости а также его ёмкость проходила по лимитам авиакомпаний. Есть предел по ёмкости или массе лития, который можно перевозить. Все литий содержащие элементы нужно возить в ручной клади.Переходники - не экономить, дешёвые могут легко устроить вам пожарТелефон - с максимальным охватом LTE диапазонов, вы можете захотеть жить возле океана в городке на 200 селовек, а там не будет проводного инета и модет не быть wifi, а диапазон у мобильной сети будет такой, что китайфон на нём ловить ничего не будет.Остальные вещи по усмотрению, одежда и так далее как правило может быть и будет покупаться на месте по мере износа.НалогиДаже если вы находитесь более чем 183 дня вне юрисдикции той страны, которую вы решили покинуть это ещё не даёт вам право претендовать на статус налогового нерезидента. Налоговый нерезидент возможен только тогда когда вы где-то станете налоговым резидентом. Эта бумага о получении нового резидентства отправляется в налоговую той страны, где резидентство отменяется. И только так оно отменяется.А чтобы получить налоговое резидентство нужно перестать быть туристом и получать ВНЖ, а это совсем другая история. Без этого даже 50 лет вне страны отправления вы всё равно там резидент. Однако это также решаемый вопрос и возможно кто-то готов перейти на режим полной удалёнки не смотря на эту потенциальную проблему, а вопрос ВНЖ решить уже потом.Банковский счётЕсли вы ещё резидент страны выезда и вы откроете банковский счёт для удалённой работе, например, в Доминикане, для избежания небольших технических проблем ваших привычных банков, например полной неработоспособности вне страны нахождения этих банков, то Вы будете обязаны уведомлять налоговую о существовании счёта и о движении по счёту иначе вам будут выставлены штрафы до 100 процентов от суммы транзакций. Некоторые юрисдикции не передают финансовую информацию, однако они могут потом получить соглашение и передать её со всеми вытекающими, потом поэтому обходить законы не рекомендуется.А вот если вы стали не резидентом, то всё упрощается на много порядков.Ограничение на пересылку валютыЕсли какое-то государство зачем-то введёт такой запрет, то всё ещё возможно выводить валюту физически находясь в стране полной удалёнки и снимая деньги в банкомате с карты, которые вы получили в стране, которая вдруг введёт такой запрет.В таком случае если торговая сессия бирж страны будет закрыта возможны огромные спреды и следовательно ужасные курсы обмена. Для устранения подобной проблемы необходимо обменивать предварительно внутреннюю валюту на валюту, которая свободно обращается в forex в момент работы внутренней биржи через банк клиент страны, которая ввела ограничения, и настроить банк клиент, чтобы тот использовал валютный счёт.Полный запрет обслуживания карт и криптовалютыВ случае тотального технического сбоя банковской системы какой-то страны Вы можете использовать криптовалюту, чтобы обойти возникший сбой, как правило если вы правильно выбрали страну приземления, то либо криптовалюты вообще не регулируются то есть они легальны, либо они регулируются и легальны и вы их можете просто выводить тем или иным способом. Некоторые страны позволяют открывать счета не резидентам И позволяют конвертировать криптовалюты.Однако есть риски связанные с функционированием уже работодателей в такой стране где потенциально может случиться такой невиданный сбой. Весьма вероятно, что если так всё же произошло, то такое государство скорее всего не будет запрещать криптовалюты, а внедрит официальный их оборот. Если и криптовалюты в такой юрисдикции будут запрещены, а также вывод средств полностью заблокирован, то рекомендуется отказаться от работодателя в такой стране и найти другого в такой юрисдикции, где проблемы с банковскими переводами нет, а также открыть счёт в банке, который также находится в юрисдикции у которой также нет подобных проблем.Это хоть и принесёт ряд неудобств в виде потребности отправлять отчётов в налоговую такой закрытой юрисдикции, но сделает вас независимыми от дальнейшей судьбы этой юрисдикции. "
]