[
   "Прямые эфиры со спикерами из Data Science",
   "Привет!На связи Team Leads МегаФона Big Data Ваня  и Артём (@art-glazunov). Мы решили провести серию voice chats со спикерами из DS-сообщества, а потом эти записи смонтировать в выпуски подкаста «Данные люди». Это будут эфиры про данные и людей, которые с ними работают. Их истории и деятельность, как они к этому пришли и куда идут. В каждом выпуске приглашаем известных в сообществе Data Science и за его пределами и просто очень интересных людей поговорить об анализе данных.Все voice chats будут проходить в тг-канале @bigdatapeople. ​ Ближайшее расписание эфиров:18 августа — Алексей Драль (Founder & CEO BigData Team) 24 августа — Рубен Ениколопов, (PhD, Ректор Российской Экономической Школы)1 сентября — Юрий Кашницкий  (Senior ML Scientist @ Elsevier, к.т.н., лидер открытого курса по машинному обучению mlcourse.ai)Расписание ещё будет дополнятся. Время voice chats объявим позже, но это точно будет вечер, чтобы всем было удобно.Каждый выпуск будем будем выбирать самый интересный вопрос в чате и отправлять подарок победителю.Чтобы не пропустить voice chats, присоединяйтесь в наш чат Данные люди.Услышимся! ​ ",
   "  Только зарегистрированные пользователи могут участвовать в опросе. Войдите, пожалуйста. Какие темы для эфиров вам интересны? \n            33.33%\n           Карьера в Data Science, как удалось достичь успеха? \n            2\n           \n            50%\n           Чего не стоит ожидать от Data Science новичку? \n            3\n           \n            50%\n           Kaggle и работа: можно ли совмещать? И нужно ли? \n            3\n           \n            33.33%\n           Epic fails и как их избежать \n            2\n           \n            16.67%\n           Жизненный путь наших гостей \n            1\n           \n            0%\n           Как поддерживать work-life balance и оставаться продуктивным? \n            0\n           \n            16.67%\n           Что вдохновляет в Data Science и вообще, а что наоборот? \n            1\n           \n            50%\n           Будущее Data Science: что нас ожидает в области в ближайшие годы, по мнению наших гостей \n            3\n           \n            33.33%\n           Как повлияла пандемия на индустрию? \n            2\n            \n       Проголосовали 6 пользователей. \n\n       Воздержались 2 пользователя. \n    "
]