[
   "Приглашаем на бесплатный марафон по вёрстке",
   "С 12 августа по 15 сентября HTML Academy проводит бесплатный марафон по вёрстке сайтов. Тут есть сразу много плюсов. Во-первых, он бесплатный. Во-вторых, вы научитесь верстать сайты. Или станете верстать их ещё лучше.Зачем участвовать: научитесь верстать, сверстаете целый всамделишный макет и сможете выиграть бесплатное обучение на курсе «HTML и CSS. Профессиональная вёрстка сайтов».Почему марафон: потому что длится целый месяц, с 12 августа по 15 сентября. Практически полноценный курс, только без наставника. Для тех, кто давно хотел научиться верстать или вообще понять, стоит ли доверять онлайн-курсам по программированию.Кому подойдёт: новичкам, продолжающим, и тем, кто не может учиться без мотивации.Как выглядит марафон глазами участникаПрохожу тренажёрыЧитаю статьи и учебникРаботаю с макетом и делаю домашкиСмотрю, как наставник в прямом эфире рассказывает, что сделано не такХвастаюсь скриншотами с другими ребятами в чатеЗагружаю сайт в интернетЖду подведения итогов и призаНе пугайтесь — сейчас объясним всё подробнее.Что за тренажёрыТренажёр — вот такая штука, в которой вы решаете задания по вёрстке, и сразу видно всё, что вы написали. Смотрите:То есть тут сразу код, как в редакторе, потому что технически это и есть код в редакторе. Приятная новость — для участников марафона тренажёры будут бесплатными (даже те, за которые обычно нужно заплатить).Работа над вёрсткой макетаМы пришлём всем участникам макет в Figma, который нужно будет разобрать на кусочки, понять, как всё устроено, и пересобрать уже в виде готовой HTML-страницы. Одна из работ участников прошлого марафонаСразу может быть непонятно, как всё это сделать, но мы ведь и собираемся, чтобы разобраться (no pun intended). В итоге вы узнаете, как работать с графикой в Figma, писать доступную и семантическую разметку на HTML, стилизовать страницу с помощью CSS и делать сетки страниц на флексах и гридах.Потом получившийся сайт загрузите в интернет и сможете положить в портфолио. Будет там первая работа. Мы уже за вас рады!Статьи и учебникМы поделимся с участникам хорошим набором статей по HTML и CSS. Как раз для того, чтобы непонятности в вёрстке макета исчезли, а осталось только удовольствие от работы. Прямые эфиры с наставникамиМарафон по вёрстке отличается от платных курсов тем, что здесь у участников нет личного наставника. Но даже в таком режиме мы решили не оставлять вас без поддержки, поэтому наставники будут проводить прямые трансляции, делиться опытом, разбирать некоторые домашние задания и советовать, что можно улучшить.Чат сообщества и поддержкаВсе участники получат доступ к чату, где не страшно задавать любые, даже глупые вопросы о вёрстке. Там и более опытные коллеги помогут, можно познакомиться с другими ребятами, чтобы не было одиноко и грустно разбираться с флексами и гридами (но вам и не будет).Ну и мотивация, конечно, куда же без мотивации. Среди тех, кто успешно закончит марафон, разыграем участие в курсе «HTML и CSS. Профессиональная вёрстка сайтов», который начинается 20 сентября. А там уже и наставники, и настоящие испытания. И целая осень обучения по пути к работе мечты.Ведь марафон — облегчённая (и бесплатная) версия курса «HTML и CSS. Профессиональная вёрстка сайтов», которая рассчитана на начинающих.Чем же хорош главный приз и почему стоит за него побороться? Вас там ждут:Прямые эфиры с разбором теории и практики по каждому разделу. Эфиры ведут авторы курса.Личный наставник, который точно проверит код и поможет разобраться в сложных темах на индивидуальных консультациях.Несколько проектов на выбор.Проекты большей сложности, состоящие из нескольких страниц. На марафоне участники верстают только одну страницу.Полноценный учебник по вёрстке, который обновляется несколько раз в год, чтобы успевать за изменениями в индустрии.Записывайтесь на марафон «Заверстаю» — это бесплатно, пользы вагон, а старт уже скоро. Можете посмотреть ещё и лендинг, но лучше Записаться не раздумывая "
]