[
   "Риски обесточивания Чернобыльской АЭС",
   "Вчера (9.03) Чернобыльская АЭС была обесточена из-за повреждения ЛЭП [1]. Как я говорил ранее, комментируя происходящее вокруг ядерных объектов Украины сейчас, наиболее опасный объект в Чернобыльской зоне – это хранилище отработавшего ядерного топлива (ХОЯТ) с 20 тыс. топливных сборок. А потенциальный аварийный сценарий –  условно фукусимский. Когда выброс радиации начался из-за перегрева топлива, охлаждение которого было нарушено из-за обесточивания станции. Но насколько тут этот сценарий реален? ХОЯТ-1 –  это мокрое хранилище топлива первых 3 блоков станции (вот хороший ролик с кадрами оттуда). По сути это несколько больших бассейнов, в которых размещены отработавшие сборки. Они выделяют тепло даже через много лет после выгрузки из реактора. Однако этому топливу уже более 22 лет, поскольку последний реактор станции был загрушен в 2000 году. Поэтому выделяемое топливом тепло не такое большое.Мокрое хранилище ХОЯТ 1Топливо такого возраста можно хранить и в сухом виде. Например, для этого уже построено хранилище ХОЯТ-2, где топливо помещают в специальные сухие вентилируемые контейнеры. Однако пока туда перемещено мало сборок. Большая часть до сих пор в ХОЯТ-1.Сухое хранилище ХОЯТ 2Международное агентство по атомной энергии проинформировано о ситуации. По данным организации, объем бассейна и возраст топлива таковы, что охлаждение может быть достаточным даже без электроснабжения, так что ситуация \"не критична для безопасности\":В 2012 году на ЧАЭС были проведены постфукусимские стресс-тесты, показавшие, что в случае обесточивания ХОЯТ максимальная температура бассейна будет не более 70 градусов, и в таком виде без разрушения топливо может простоять до 2 месяцев. Скрин:Кроме того, на станции есть и дизель-генераторы, так что какое-то время она в теории может работать без внешнего энергоисточника. Однако обесточивание – это потеря контроля. Отсутствие информации (датчики пожарной безопасности, уровня радиационного фона и т.д.), насосы, фильтры и т.д. – все отрубится. Это риски. Случись что и персонал не сможет заметить проблем и оперативно отреагировать на них без электроснабжения.Другой более важный риск – это то что на станции до сих пор работает одна и та же смена уже две недели, с 24 февраля, когда на территорию станции вошли российские военные. Люди работают без выходных, под постоянным стрессом отвечают за безопасность такого объекта. Теперь и в условиях аварийной ситуации обесточивания. Вот как это описывает МАГАТЭ. И смогут ли они в такой ситуации нормально запусть все дублирующие системы, восстановить работоспособность оборудования и контролировать безопасное состояние объекта – большой вопрос. Причина обесточивания тоже под вопросом. Она устранена? Ведется восстановление? Там идут бои? Неизвестно.Так что риска разрушения хранилища и топлива в нем из-за обесточивания пока видимо нет. Но сам факт таких инцидентов в ситуации захвата станции и измотанного персонала не гарантирует, что это все в итоге не выльется во что-то более опасное и там не случится новых аварий.Важно: Помните, что в условиях ведения боевых действий стоит довольно критически относиться к информации от вовлеченных в конфликт сторон. Кроме того, принятый в России закон \"о фейках\" значительно ограничивает возможности всестороннего обсуждения и анализа текущией ситуации в публичном пространстве.  Источники:1. Новость об обесточивании - https://www.interfax.ru/world/8271172. Оценка ситуации от МАГАТЭ - https://twitter.com/iaeaorg/status/15015458527159050293. Стресс-тесты https://snriu.gov.ua/storage/app/sites/1/docs/Stress-tests/National%20Report%20of%20Ukraine.pdf4. МАГАТЭ о работающем на станции персонале https://www.iaea.org/ru/newscenter/pressreleases/obnovlenie-15-zayavlenie-generalnogo-direktora-magate-o-situacii-na-ukraineДата-центр ITSOFT — размещение и аренда серверов и стоек в двух дата-центрах в Москве. За последние годы UPTIME 100%. Размещение GPU-ферм и ASIC-майнеров, аренда GPU-серверов, лицензии связи, SSL-сертификаты, администрирование серверов и поддержка сайтов. "
]