[
   "Самый сумасшедший ретро стиль + микс игровых механик в игре ASCIILL",
   "Привет, ребята! Представьте, что несколько десятков лет назад вы включили ЭВМ с алфавитно-цифровым монитором. Может быть, этот компьютер находился в некой лаборатории. В рабочее время он использовался для различных расчетов, но вы дождались, когда все ушли, и запустили игру. Монитор мог отображать лишь символы, однако это не мешало погружению. Полумрак помещения и сиреневый цвет заката за окном шли комплектом к самой игре.Одна такая игра только что вышла на Стиме. Буду рад показать вам основные ретро компоненты, которые я использовал, а также первую реакцию игроков на них.Графика«От графики свело олдскулы :)», — из отзыва на Стиме.Со временем воспоминания легко могут исказиться. Кажется, что трава раньше была зеленее, а светящиеся буквы на мониторе красивее и волшебнее. Если сейчас включить древний компьютер, то картинка будет не та. Раньше было круче на этом же мониторе!Моя задача — попробовать передать в игре то самое волшебное ретро чувство. Я аккуратно добавил красок и плавность перемещения в текстовый режим. Как вам?Механика«Геймплей интересный - такая смесь action и puzzle. Микс побегать и подумать», — из отзыва на Стиме.Core-механику игры ASCIILL задумывал, как Metal Gear на Roguelike-поле с ловушками из Сапёра. Возможно, такая смесь звучит диковато, но получилось весьма играбельно, судя по отзывам. В основном режиме на разгадывание ловушек по цифрам тратится в среднем 20 % времени. В режиме «Челленж» (ежедневный случайный уровень, один для всех игроков) — до 70 %.История«Да, тексты огонь! Короткие, ненапряжные, и посмеялась местами от души», — из отзыва на Стиме.Тайный агент Эскилл направляется в инопланетный храм, напичканный ловушками. Сильнейшее электромагнитное излучение препятствует прохождению видеосигнала, поэтому вся информация проходит лишь в виде текстовых символов.Вот так нарратив объясняет графический стиль. Если бы не это электромагнитное излучение, то игра безусловно была в VR. Но условия, блин, сложные, поэтому пропускной способности канала хватает лишь на передачу картинки в расширенном текстовом режиме.Задание на каждую миссию выдает Б.О.С.С. Нужно расхищать сокровища, уничтожать инопланетных тварей, нейтрализовывать охранную технику.С каждым новым уровнем приходит понимание, что Б.О.С.С. не тот, за кого себя выдает, а Земля и агент Эскилл — лишь пешки в игре могущественных сил Вселенной.Несмотря на пародийный стиль диалогов, решил добавил несколько сюжетных поворотов. Кстати, как бы вы расшифровали аббревиатуру Б.О.С.С.? Расшифровку дает агент Эскилл в финальных титрах.НазваниеГрафика в игре сделана из символов кодировки ASCII, что и определило первые пять букв названия. Как бы вы произнесли ASCIILL? Возможно как «Эсс Килл» или «Ass Kill». В игре действительно нужно надрать (Kill) кое-кому задницу (Ass). Хотя, возможно это лишь случайность, и такой интерпретации нет. Однако финальная схватка с галактическим гадом точно есть.Буду очень рад, если вы зайдете на страничку игры в Стиме, чтобы посмотреть на графику/фишки и/или добавить в Wishlist на будущее. Спасибо! "
]