[
   "Сотрудники-нолики",
   "У меня в отделе всегда есть «нолики». Это люди, которые работают хуже других, меньше получают, чаще огребают, с завидным постоянством выгорают и увольняются. Их не очень много – ровно столько, чтобы не могли сильно повлиять на общий результат и атмосферу.Люди они хорошие – и в профессиональном, и в человеческом. Просто судьба у них такая. Причём, выбрали они её сами. Я лишь не мешаю.Их выбор звучит так: «я сам знаю, что для меня лучше». А я просто соглашаюсь, даю больше автономии, возможности выбирать и решать самостоятельно. Например, куда и как развиваться, на чём специализироваться, с какими проектами работать и т.д.Первая же ловушка, в которую попадают нолики – они не могут делать так, как большинство. Раз ляпнули «я сам знаю», приходится выдумывать любые варианты, непохожие на остальных. Даже если согласны с тем, что делает большинство. Иначе было бы странно – делать как все, но говорить «я умнее».Вторая ловушка – они не могут пользоваться стандартными социальными лифтами, которые создаю я и компания. Формально и фактически, с моей стороны нет никаких препятствий. Не могут они в силу тех же причин – стрёмно, ведь уже «базаром писанулись», что не как все. Снова приходится самим что-то выдумывать.Иногда, правда, приходят ко мне и просят, а то и требуют создания специальных программ развития и социальных лифтов для ноликов. Объясняю, как работает демократия. Ну и, конечно, вворачиваю «думаю, вы сами в силах создать себе социальные лифты, руководство поддержит». Разумеется, дальше «планирую, обдумываю» у них ещё никогда не заходило.Нолики, в результате, держатся недолго. Обычно – несколько месяцев. Денег получают меньше всех. Работают – больше всех (это часть их «борьбы»). Грязные, голодные, злые.Вопрос у вас в голове, наверное, один: нафига оно мне?Всё очень просто: нолики нужны, чтобы показывать на них пальцем.Они – как ноль системы координат. Если нуля нет, то остальные не понимают, где находятся, как у них дела, куда и как они движутся. Нолики работают как доказательство любых моих слов о том, что и как надо делать.У меня же программисты в отделе, и я для них создал несколько треков развития. Хорошо, или плохо, но у программистов возможных треков много – можно развиваться в какую угодно сторону. Если ноликов нет, то мои слова «надо развиваться в эту сторону» нечем подкрепить, кроме собственного авторитета. Авторитет, увы, надо подтверждать. В профессиональном плане это не сложно – достаточно показать на паре примеров решения задач. А вот правильность выбранной стратегии развития можно показать только на длинной траектории, в несколько лет.Раньше, когда не было ноликов, я даже приглашал своих бывших подчинённых из других компаний, чтобы те рассказали, как прошли предложенный мной путь и стали уважаемыми специалистами с большой зарплатой. Но постоянно появляются новые люди, и таскать уважаемых специалистов на регулярные выступления не очень хорошо.Так и родилась идея ноликов. Совершенно случайно, разумеется – просто появились 1-2 человека, которые вот прям усраться хотели делать всё по-своему. Я и так, и сяк поубеждал – ни в какую. Прям огонь в глазах горит – показать себя. Что ж, не наступать же на сердце Данко? Честно признаться, я в начале карьеры тоже хотел всё делать сам, и мне тоже дали полную свободу. Хотя, я и сейчас…Не суть. Так у меня появился и остался небольшой загончик ноликов. Он то наполняется, то пустеет. Если посмотреть на график их численности, результативность и эффективность, то всегда видна красивая синусоида. Загорится внутренний огонь – ползут вверх. Поймут, что хернёй страдают – падают вниз (всегда – с потерей части людей). И так уже два года.Я уже привык, и мне нравится. Совесть не мучает – это их свободный выбор. Я периодически долго и вдумчиво объясняю все его аспекты и последствия. Иногда, крайне редко, кто-то из ноликов возвращается в «толпу».Мне остаётся лишь держать популяцию ноликов под контролем. Даже физически – они, почему-то, очень заразны. Можно стать таким, как они, просто посидев рядом. "
]