[
   "Совместное предприятие «1С-Битрикс»",
   "Пресс-релиз компаний «Битрикс-Софт» и «1С» по поводу создания совместного предприятия «1С–Битрикс». В продолжение темы\n\nСегодня мы провели пресс-конференцию с фирмой «1С», на которой объявили о создании совместного предприятия «1С–Битрикс».\n\r\nНаши компании объединяют усилия для создания новых интернет-решений и достижения своих стратегических целей на рынке веб-разработок.\n\r\nСовместное предприятие «1С-Битрикс» создается с равным долевым участием сторон (50/50). В создаваемую компанию будут инвестированы значительные ресурсы для интенсивного развития.\n\r\nКомпании «1С–Битрикс» передаются исключительные права на территории стран бывшего СССР на программный продукт «Битрикс: Управление сайтом» и новые продукты «Битрикс», включая продукт для платформы .NET.\n\r\nПрограммный продукт переименовывается в «1С-Битрикс: Управление сайтом». Запланированный на март 2007 года выпуск новой версии 6.0 продукта будет произведен уже под новой торговой маркой. Разработку и техническое сопровождение программных продуктов «1С-Битрикс» будет осуществлять компания «Битрикс».\n\r\nФирма «1С» предоставляет совместному предприятию права на использование своей торговой марки для продвижения продуктов и построения единой партнерской сети.\n\r\nС момента начала работы совместного предприятия «1С-Битрикс» на него переводятся продажи от «Битрикс» и перерегистрируются действующие договоры с партнерами «Битрикс». Фирмы «1С» и «Битрикс» подчеркивают, что условия работы существующих партнеров «Битрикс» в связи с этим изменяться не будут.\n\r\nФирма «1С» и «Битрикс» будут совместно заниматься активным развитием общего продукта, его продвижением и построением партнерской сети для его распространения, внедрения и поддержки.\n\r\nГенеральным директором компании «1С–Битрикс» назначается Рыжиков Сергей Владимирович, который одновременно является директором ООО «Битрикс».\n\r\nСергей Рыжиков, директор компании «Битрикс»: «Рынок бизнес-решений интенсивно расширяется, растет спрос на интернет-решения со стороны бизнеса. И фирма «1С» сегодня является флагманом на рынке корпоративных решений. Мы рады, что «Битрикс» может дополнить линейку решений «1С» полным спектром возможностей для организации и управления интернет-бизнесом. Создание совместного предприятия «1С-Битрикс» — это правильный, логичный шаг для организации разработок, поддержки и распространения новых продуктов и сервисов. Отдельное спасибо компании ValueTech Advisers, которая оказывает финансовые консультационные услуги по сделкам слияний компаний, за своевременную помощь в процессе подготовки сделки».\n\r\nБорис Нуралиев, директор фирмы «1С», комментирует: «Рынок веб-разработок сейчас бурно растет. Ситуация частично напоминает то, что происходило на рынке бухгалтерских систем в начале 90-х или на смежном рынке комплексной автоматизации управления несколько лет назад. Спрос на технологии и услуги по созданию и управлению сайтами становится массовым, что делает эффективным создание и распространение тиражных платформенных решений. Подход «Битрикс» заключается в создании технологической среды разработки и основанных на ней модифицируемых решений, что дает возможность большому количеству партнеров организовать эффективный бизнес по созданию сайтов и охватить значительную долю клиентов потенциального рынка.\n\r\nОн хорошо соответствует последовательно выстраиваемой «1С» бизнес-модели, основанной на сочетании индустриального подхода к разработке, распространению и сопровождению программ с опорой на энергию, квалификацию и заинтересованность массовой партнерской сети. Ранее эта модель позволила нам добиться отличных результатов на таких направлениях как «1С: Предприятие» или «1С: Мультимедиа», и совместное предприятие «1С-Битрикс» дает возможность применить этот подход в области интернета». \n\r\nВ общем, случилось то, что должно было случиться. Многие предсказывали полную продажу «Битрикс-Софт» компании «1С», но этого не произошло. Случилось равное объединение интересов под новой компанией. «1С» дает «попользоваться» своё имя и ресурсы, а «Битрикс-Софт» прикладывает свои знания и опыт для развития совместного продукта. Несомненно, что приставка «1С» к «Битриксу» приподнимет доверие обывателей, очень положительно скажется на имидже продукта, да и вообще откроет для многих такой класс продуктов, как CMS. Самописным CMS и наивным идеям создать свою универсальную CMS вбит предпоследний гвоздь в крышку гроба.\n\r\nОчевидно, что будет усиленно развиваться взаимная интеграция продуктов. В ближайшем будущем, для тех, кто внедрил у себя на предприятии «1С», создание или перевод существующего сайта на «Битрикс» будет более чем логичным решением. Особенно это касается интернет-магазинов. "
]