[
   "Таиланд. Пхукет. Документы, банки. 2022",
   "Данная статья – практическое описание того через что нужно будет пройти если вынуждено или не вынуждено остаться на острове. Информация только про Пхукет, в остальных провинциях могут отличаться какие-то нюансы.Так получилось, что давно запланированный отпуск с семьёй на Пхукете заканчивается тем, что отменены рейсы, невозможно дозвониться в авиакомпанию, отрезана возможность получать зарплату, не работают карточки российских банков и даже никакие средства не отправить через системы мгновенных переводов. Остались ещё криптовалюты, но и с ними есть нюансы.Ниже будет информация, которая будет полезна тем, кто оказался в подобной ситуации, что именно нужно сделать, куда обратиться, какие именно бумаги требуются и для чего. Так как информация постоянно меняется, то не могу гарантировать, что через неделю всё будет также, но практика показывает, что если что-то и меняется, то как ни странно, в упрощение, в лучшую сторону.Шаг 1. Продление пребыванияЯ въехал по \"штампу\" – ставят в аэропорту по прилёту и по нему можно находиться 30 дней. Этот срок необходим продлевать. Для этого есть несколько вариантов, но в данный момент самый оптимальный (на мой взгляд) вариант – это так называемое \"ковидное продление\", по которому на 60 дней увеличивают срок действия \"штампа\", то есть именно на 60 дней с даты окончания действия, а не с даты когда подашь заявление.Что надо для продления?Загран паспортКопия заграна с лицом + копия иммиграционной карточки (заполняется в самолёте, маленький квиток - форма TM6) + копия страницы со штампом. Нужно расписаться на каждой копии. Копии можно сделать в отеле, обычно это бесплатноЦветное фото 4х6 - его можно сделать рядом с иммиграционным офисом, я делал тут: https://goo.gl/maps/doi1X59wBDjKSwn49форма TM30 - подтверждение проживания, выдаётся в отеле, для тех кто снимает квартиру, она иная, нужно получать у того у кого снимаете, они должны знать. Я брал в отеле, делают её не сразу, лучше заказать заранее за день до похода. Выглядит форма так: TM30то есть это по сути скрин с их какой-то системы учёта и такое принимается – все именно такое и приносят. На мой взгляд несколько странно, но там так.заполненные формы: TM7, STM2, Affidavit Covid-19Настоятельно рекомендую распечатать это всё заранее и спокойно заполнить дома/в отеле. Формы можно найти тут. Пример заполнения отлично описан по этой ссылке: Ковидная виза в Таиланде на 2 месяца (60 дней) (room-number.ru) цена вопроса: 1900 бат на каждого заявителя. Есть информация что этот сбор собираются отменить, но пока так.Все документы делаются на каждого члена семьи. Подавать может кто-то один за всех, но присутствовать при подаче должны все, нужно будет показаться оператору и оператор сфотает вас с паспортом и номерком. По этому номерку потом получать сам паспорт со штампиком.Куда ехать? 482 Phuket Rd, Tambon Talat Yai, Mueang Phuket District, Phuket 83000 или https://goo.gl/maps/pqkkyTrNPPru1iWK7 Режим работы: с 8:30 до 12:00 и с 13:00 до 16:30.Лучше всего с утра. Если до обеда подать документы, то после обеда их уже отдадут и не надо будет второй раз туда мотаться. При первом посещении этого заведения может быть некоторая растерянность, но на самом деле всё довольно просто. Везде висят таблички куда идти, часто на русском, всегда на английском. Если вообще ничего не понятно – можно спросить у оператора, расскажут подробно и направят в нужное окошко. В целом всё довольно просто, но долго, лучше выделить на это день и спокойно сделать.Шаг 2. Временное \"резидентство\"Чтоб наладить какой-то финансовый процесс хорошо бы открыть счёт в банке. Для этого в том же центре иммиграции нужно получить вот такую бумажку:Говорите \"document for bank account\" – сразу понятно что вам нужно.для её оформления требуется:форма TM30 из шага 1такое же фото 4х6300 батоколо часа времени на ожидание в очередяхЕсли подать документы на продление пребывания (шаг 1), затем получить после обеда паспорт и сразу подать на получение этой бумаги, то можно значительно упростить себе жизнь и сэкономить время. Я этого не знал и пришлось ездить несколько раз.Зачем она нужна эта бумажка? Иностранцам с таким вот временным \"штампиком\" нигде вообще счёт не открывают. Специально сегодня обошёл наверное 6 банков – везде нужен work permit или виза на долгий срок. Зато есть замечательный Bangkok Bank, который открывает именно с такой бумажкой.Шаг 3. Открытие счёта в банкеОткрытие счёта со страховкой от несчастных случаев, карточкой UnionPay и стартовыми 500 батами на счету стоит 7100 бат. Сегодня появилась информация, что страховку поменяют и будет раза в два дешевле. Хорошо если так.За дополнительные 500 бат можно сразу же получить мастеркард.Куда обращаться?В любой офис Bangkok Bank, он есть в Old Town, в Central Festival – на 4-м этаже торгового центра. В общем куда ближе – туда и надо идти.Что нужно?паспортместный мобильный номер телефонабумажка из шага 2в банке примерно минут 30 времени для заполнения кучи бумажекПо итогу будет счёт в банке в тайских батах. Можно открыть счёт и в другой валюте, вот тарифы:Свифт-переводы работают, уже проверено. При переводе валюты отличной от батов – сконвертируется по курсу банка, который не такой уж и плохой. Карточки тоже работают сразу. В общем можно немного вздохнуть.В банке сразу лучше поставить приложение (для iOS это: https://apps.apple.com/ru/app/bualuang-mbanking/id660238716), залогиниться, проверить что всё хорошо. Само приложение вроде как неплохое, всё основное есть, но до российских примерно как до луны.Надеюсь, информация будет полезна и сэкономит время тем кто оказался в подобной моей ситуации. "
]