[
   "Фреймворки против Битрикс",
   "История и настоящее БитриксПо состоянию на начало 2020 года продукт «1С-Битрикс» занял 11-е место в рейтинге Forbes «20 самых дорогих компаний Рунета». Редакторы Forbes оценили компанию в $135 млн. Для сравнения, в топ-3 рейтинга редакторское жюри разместило компании:«Яндекс» ($14640 млн); «Mail.ru Group» ($5285 млн); «Avito.ru» ($3850 млн).Битрикс — единственная в рейтинге компания, предлагающая решение для разработки программного обеспечения. Это говорит о по-прежнему сильном потенциале компании на рынке продаж ПО, но не добавляет причин для выбора Битрикс в качестве средства разработки. В статье мы рассматриваем аргументы «за» и «против» в выборе 1С-Битрикс.Первый продукт, ставший заметным на рынке ПО, компания выпустила в 2003 году. Это была версия «Битрикс: Управление сайтом 3.0». Именно эта версия упоминается в пресс-релизах того времени, как «успешная». С момента выхода на рынок ПО целью компании стало наращивание оборота продаж. Для этого в 2007 году компания «Битрикс» Сергея Рыжикова объединилась с компанией «1С» Бориса Нуралиева. Сотрудничество стало успешным, и через несколько лет слово «1С-Битрикс» стало означать почти единственный способ создания сайта в сети Интернет.За последующие 13 лет компания выпускала новые версии «1С-Битрикс», отчитываясь об улучшениях и обновлениях. В 2006 и 2008 годах продукт «1С-Битрикс: Управление» получил «Премию Рунета» в категориях «Технологии и инновации» и «Экономика и бизнес».На конец 2020 года компания предлагает версию «1С-Битрикс: Управление сайтом 20.200.550».По состоянию на март 2020 года «1С-Битрикс» занимала 2-е место рейтинга «CMS Рунета» с долей 13,33%. Первое место занимал Wordpress с долей 44,74%.Почему мы приравниваем «CMS» к «framework»? С точки зрения клиента-заказчика, существует лишь один вариант готового решения его бизнес-задачи: это — сайт, который работает, реализует бизнес-функции и приносит ему, клиенту, пользу. Клиент предъявляет конкретные требования к сайту: «управлять данными и обрабатывать данные». Выбор же функционала «CMS» или «framework» лежит на разработчике: именно он реализует бизнес-задачу клиента посредством программных инструментов.Почему НЕ Битрикс?Устройтесь поудобнее и посвятите 60 минут вашего свободного времени этому воодушевляющему рассказу «Презентация новой версии “1С-Битрикс: Управление Сайтом 18.0”». Если вы досмотрите это видео до конца, то Сергей Рыжиков, гений и главный идеолог серии «Битрикс», восхитительно убедит вас в необходимости обязательно, непременно, уже вчера приобрести для своих сайтов «1С-Битрикс: Управление Сайтом 18.0». И забыть как страшный сон все иные, прочие средства разработки.В жизни же реальность разработки сайта на «1С-Битрикс» складывается иначе. Основные причины, по которым разработчики не желают связываться с этой framework-подобной CMS:Отсутствует актуальная документация. Типичный сценарий битрикс-разработчика выглядит как «посмотреть в исходный код компонента Битрикс, чтобы понять, как оно работает». Бесполезность технической поддержки со стороны компании «1С-Битрикс». Вопрос, который не укладывается в рамки проблемы «что должна вернуть эта функция», может быть рассмотрен в два дня, и а может и не получить ответа вовсе. Зачастую диалог с техподдержкой начинается с указания «проверьте вашу версию php… операционной системы… браузера…» и заканчивается декларацией «штатный функционал вашей версии 1С-Битрикс не предусматривает реализации такого сценария. Рекомендуем обратиться к услугам компании-интегратора».Готовый функционал «из коробки» реализует сценарии процессов с жёстко заданными параметрами. Требуется чуть в сторону? Делай copy-paste (о нём — ниже) и переписывай предоставляемый функционал или программируй свои задачи сам, своим кодом. Отсутствие единой концепции разработки. Авторы заявляют Битрикс «MVC-фреймворком», функционирующим на базе ядра D7. А на деле? На деле — «вёрстка, CSS, JavaScript и PHP впридачу — всё это в одном шаблоне». Многие настройки и функции сайта скрыты в неочевидных разделах админ-панели, доступны только через админ-панель, нередко дублируются и, как правило, не документированы. Доступ и знание таких нюансов Битрикс остаются уделом тех разработчиков, кто ранее докопался до нужного функционала админки, и тех, кто занимается исключительно разработкой на Битрикс. Широкое использование глобальных переменных. Простой пример присваивания свойства класса в методе показывает, что в любой момент выполнения кода значение этого свойства — непредсказуемо:public function setTableHeader() { $this->content .= '<table width=\"100%\" cellspacing=\"4\" cellpadding=\"8\">'; }.ПреимуществаЧем хорош 1С-Битрикс из коробки? Он — работает. Нужен блог, афиша, магазин? В нём уже есть админка с разграничением прав разработчика, модератора, контент-менеджера. Другие frameworks и CMS также без проблем умеют работать из коробки, но у Битрикс есть определённые преимущества. Битрикс — на слуху и поддерживается сторонними разработчиками. Найти «уже вчера» PHP-разработчика для доработки битрикс-проекта можно в течение суток. Для поиска хорошего битрикс-разработчика потребуется чуть больше времени. И лишь задача по поиску сертифицированного битриксоида с опытом работы может занять и месяц, и два: спрос на таких программистов не снижается в среде госзаказчиков и крупных студий веб-разработки. Битрикс используют в качестве основного движка крупные коммерческие проекты и государственные структуры. Этому есть и административно-законодательные причины, и выбор самих заказчиков.Что думают о Битрикс заказчики сайтов?«1С-Битрикс: Управление сайтами» позиционируется как универсальная система, на которой можно создавать в том числе персональные сайты, но стоимость лицензий, сложность разработки и функциональность прямо говорят о том, что наиболее эффективным будет использовать Битрикс для создания средних и крупных по объёму и нагрузке проектов. Хотя Битрикс и стал в Рунете самым популярным коммерческим движком для разработки сайтов, это не значит, что он подходит для всех. С созданием лендингов, корпоративных сайтов и небольших магазинов отлично справляются и конструкторы.Ещё один важный вопрос — простота использования. С точки зрения конечного пользователя 1С-Битрикс не предлагает ничего сложно. Но когда речь идёт о разработке проекта и его последующем совершенствовании, то надо понимать, что потребуется либо платная помощь специалистов, либо вложение своего времени в изучение языков программирования и особенностей работы 1С-Битрикс. При этом учебных материалов не так много: это не свободно распространяемая CMS, а коммерческий движок — создатели зарабатывают в том числе и на обучении разработчиков.И снова достоинстваНаиболее важный вопрос с точки зрения владельца сайта: кто всё это будет делать, а после запуска — поддерживать, чинить и развивать? В Рунете исторически сформировалось обширное сообщество битрикс-разработчиков: на любом фриланс-сервисе и бирже вакансий всегда можно выбрать битрикс-программиста. У компании Битрикс существует служба технической поддержки. Она не во всём идеальна, но в случае с другими фреймворками техподдержка может быть недоступна для русскоязычных пользователей. А в случае заказчика, связанного с госструктурами, и вовсе находиться в зарубежной юрисдикции.Компания 1С-Битрикс организует обучение и сертификацию битрикс-программистов. Это является плюсом с точки зрения владельца сайта на Битрикс. Какие еще варианты?В определённых случаях при разработке крупных сайтов оказывается, что необходимого функционала в Битрикс не существует либо доработка существующего потребует значительных усилий. В таких случаях разработчики создают гибридный движок сайта: Битрикс + фреймворк. В качестве фреймворка используются Laravel, Symfony, Yii. В таких случаях функционал админки и кабинет контент-менеджера обеспечивают штатные модули Битрикс, а сложные или нетипичные для Битрикс задачи решаются с помощью стороннего кода.Доля рынка1С-Битрикс занимает значительную долю рынка разработки ПО, и это показывают различные рейтинги Рунета:Тренды 2020 года: 1С Битрикс + Битрикс 24 - связка №1 в России55,36%Рейтинг платных CMS54.85%Общей рейтинг CMS, платных и бесплатных13,33%Топ20 CMS на доменах .ru13,3%Как относятся к Битрикс разработчики?Мнения профессиональных разработчиков сходятся в одном: 1С-Битрикс — это плохая среда для разработки сайтов. Самые распространённые аргументы:Продукты 1С-Битрикс «из коробки» плохи во всём, начиная от качества кода и заканчивая производительностью.Стандартная поставка Битрикс излишне усложнена неиспользуемыми компонентами.Объём пространства, занимаемого инфоблоками, перерастает все мыслимые границы. 5, 10, 15 Гбайт для интернет-магазина с ассортиментом менее 1000 наименований — это норма для Битрикс.Штатные интеграции, предлагаемые «в коробке», работают в рамках указанных версий продуктов. Во всех других случаях требуется значительная доработка кода.Код и структура компонентов Битрикс сильно различаются между собой, и возникает впечатление, что Битрикс в целом не следует единой идеологии разработки. Из-за этого схожие по функциональности компоненты могут работать абсолютно по-разному.Штатные компоненты перегружены входными параметрами. Передать в компонент 20 параметров — это много? А 40 — это как?Ежегодно на конференции разработчиков Битрикс, проводимой компанией «1С-Битрикс», заявляется о внедрении «новых функций и возможностей». А старые ошибки и некорректный функционал… как говорится, «а воз и ныне там»… не исправляются, накапливаются от версии к версии и через несколько лет превращаются в «чёрный ящик» с непредсказуемым поведением.БудущееПрограммная среда 1С-Битрикс как готовый пакет разработки будет существовать по-прежнему в ближайшие 10 лет. В настоящий момент, как и 5 лет назад, на российском рынке веб-разработки не появилось адекватной замены. Многие серьёзные и производительные фреймворки, как Symfony и Laravel, требуют от разработчика профессиональной квалификации и недоступны конечному потребителю «из коробки» в качестве веб-инструмента «поставил, и — сразу заработало».Альтернативы БитриксFrameworks и CMSСамые популярные в Рунете фреймворки: Laravel, Symfony, Yii2, Magento. Но Magento в Рунете практически не используется. В Интернете же картина иная: по данным издания mageplaza.com, сообщество Magento-разработчиков насчитывает более 300 000 программистов по всему миру, а годовой товарооборот интернет-магазинов на базе Magento превышает $100 млрд.Среди CMS наиболее часто используются для создания сайтов Wordpress, Instant CMS, OpenCart, Joomla, Drupal. Каждая из них предоставляет владельцу магазинов базовые и расширенные функции для организации торговли в Интернете. Сертификация разработчиковСтатус сертифицированного специалиста, как правило, влияет на оплату труда разработчика. Работодатель принимает во внимание именно платные сертификаты: такие, для получения которых требуется оплатить процесс сдачи экзамена.Некоторые программисты, получившие сертификат разработчика, считают, что «толку от этого нет, просто самолюбие потешить», но это не совсем так. Если желание повысить собственную стоимость как разработчика велико, то прежде оплаты прохождения экзамена и получения сертификата следует выяснить у своего работодателя: «Какие преимущества в зарплате или карьерном росте я получу при наличии такого-то сертификата»?БитриксРазработчик может получить два типа сертификата: бесплатный и за оплату. Экзамен на бесплатный сертификат можно легко сдать, открыв на соседнем мониторе Гугл.Условия сдачи платного экзамена серьёзнее: требуется отдельное помещение без присутствия других, на экзамен отводится ограниченное время, экзаменационные задания выполняются на удалённой виртуальной машине, предоставляемой компанией «1С-Битрикс». Экзамен проводится под контролем экзаменатора через видеокамеру, запрещается пользоваться какими-либо гаджетами или подсказками.Разработчик может сдать экзамен на три различных сертификата, при этом сложность заданий каждого этапа повышается, а для получения следующего сертификата необходимо успешно сдать экзамены предыдущего этапа.На сайте Битрикс предлагаются учебные материалы для успешной сдачи экзаменов, в том числе видео, демонстрирующие типовые решения задач экзаменов. Типы сертификатов БитриксУровень «Базовый»Предназначен для тестирования начинающих разработчиков. Проверяются навыки владения типовыми возможностями системы: интеграция дизайна (внедрение HTML-шаблонов), компоненты, настройка.Стоимость: 999 рублей.Уровень «Профессионал»Предназначен для разработчиков, чей уровень превышает навыки «Базового». Разработчик должен иметь навыки по расширению типовых возможностей системы: создание компонентов, использование обработчиков событий и т.п. Важно знать и уметь использовать заложенные в систему технологии. Уровень «Профессионал» — это хорошее понимание архитектуры платформы..В рамках этого уровня разработчик может сдать два экзамена:Экзамен №1 — «Интеграция дизайна и настройка платформы», стоимость 999 рублей.Экзамен №2 — «Основные технологии и расширение типовых возможностей системы»,стоимость 1999 рублей.Наличие сертификата Битрикс напрямую влияет на уровень зарплаты разработчика.LaravelЭкзамен состоит из 45 вопросов, на решение которых отводится 50 минут. В случае неуспешной сдачи экзаменатор предоставляет вторую попытку в течение 3 месяцев. Для прохождения экзамена необходимо приобрести ваучер. Экзамен «Laravel Certification program», стоимость €249.Вопросы экзамена охватывают все разделы фреймворка, поэтому наличие сертификата Laravel свидетельствует о хорошей квалификации разработчика.SymfonyПретенденту на сертификат предлагается два типа экзаменов. Для сдачи экзамена требуется приобрести ваучер.Типы сертификатов Symfony:Разработчик «Symfony Certification», стоимость €250. Состоит из 75 вопросов, на которые отводится 90 минут.  Разработчик «Twig», стоимость €149. Состоит из 45 вопросов, на которые отводится 60 минут.Вопросы экзаменов охватывают все вопросы и технологии разработки Symfony/Twig.Где платят больше?Средний и максимальный уровень зарплаты разработчику Битрикс, Symfony и Laravel был получен по предложениям на hh.ru работодателей из Москвы по состоянию на январь 2021 года.Опыт разработки на Symfony и Laravel ценится работодателями выше, чем опыт разработки на Битрикс. Но за большее вознаграждение от разработчика требуется более глубокое знание средств разработки.  Уровень зарплатыСреда разработкиМаксимальныйСреднийSymfony и Laravelдо 300 тыс рублей150 тыс. рублей1С-Битриксдо 200 тыс рублей120 тыс. рублейОбзор предложений работодателей, январь 2021 годаЗапрос по вакансиям мы сделали по следующим параметрам:опыт работы от 3 до 6 лет;полная занятость, полный день;работа в Москве.В базе HeadHunter были найдены предложения в таком количестве:Среда разработкиВакансий, шт.1С-Битрикс590Symfony160Laravel152Wordpress57Opencart7Yii108Yii 2111Magento, Magento 211Joomla11Drupal, версии 7, 814Какой фреймворк полезнее?А именно — какой фреймворк полезнее знать и уметь для личного бюджета разработчика, работающего в России?В идеальном случае это будут Symfony и Laravel. Ещё один плюс уверенного владения этими инструментами — перспектива работать на зарубежного работодателя. Очевидно, что разработчик 1С-Битрикс работодателям в Европе или США не требуется.Знание Битрикс принесёт разработчику хорошую, относительно работы библиотекарем, зарплату с перспективой стабильной занятости. Проекты на Битрикс существуют годами и крайне редко рефакторятся на другие платформы.Другие CMS, которых на российском рынке веб-разработки осталось не так много, по-прежнему используются в небольших проектах. Со временем, по мере роста и развития проекта, их владельцы переходят на что-то более производительное и выбирают новый движок для сайта из 1С-Битрикс, Yii, Symfony и Laravel. "
]